zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>ANDCPP</name>
    <description><![CDATA[This register is used to logically AND PWM output pairs for each timer]]></description>
    <addressOffset>0x00000FB4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CPP_AND_EN</name>
    <description><![CDATA[Bit 0 enables anding of the CPP outputs for timers A and B ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>GPT0</name>
<description><![CDATA[]]></description>
<baseAddress>0x40010000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CFG</name>
    <description><![CDATA[GPTM Configuration]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[GPTM Configuration -  The GPTMCFG values are defined as follows:  Value Description 0x0 32-bit timer configuration.  0x1 32-bit real-time clock 0x2 Reserved 0x3 Reserved 0x4 16-bit timer configuration.  The function is controlled by bits 1:0 of GPTMTAMR and GPTMTBMR.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAMR</name>
    <description><![CDATA[GPTM Timer A Mode (GPTMTAMR), Offset 0x004]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>TCACT</name>
    <description><![CDATA[Timer Compare Action Select 0: Disable compare operations 1: Toggle State on Time-Out 2: Clear CCP on Time-Out 3: Set CCP on Time-Out 4: Set CCP immediately and toggle on Time-Out 5: Clear CCP immediately and toggle on Time-Out 6: Set CCP immediately and clear on Time-Out 7: Clear CCP immediately and set on Time-Out]]></description>
    <bitRange>[15:13]</bitRange>
  </field>
  <field>
    <name>TACINTD</name>
    <description><![CDATA[One-Shot/Periodic Interrupt Mode 0: Normal Time-Out Interrupt 1: Mask Time-Out Interrupt]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TAPLO</name>
    <description><![CDATA[Legacy PWM operation 0: Legacy operation 1: CCP is set to 1 on time-out]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>TAMRSU</name>
    <description><![CDATA[Timer A Match Register Update mode 0: Update the GPTMAMATCHR and the GPTMAPR, if used on the next cycle.  1: Update the GPTMAMATCHR and the GPTMAPR, if used on the next time-out.  If the timer is disabled (TAEN is clear) when this bit is set, GPTMTAMATCHR and GPTMTAPR are updated when the timer is enabled. If the timer is stalled (TASTALL is set), GPTMTAMATCHR and GPTMTAPR are updated according to the configuration of this bit.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>TAPWMIE</name>
    <description><![CDATA[GPTM Timer A PWM Interrupt Enable This bit enables interrupts in PWM mode on rising, falling, or both edges of the CCP output 0: Interrupt is disabled.  1: Interrupt is enabled.  This bit is only valid in PWM mode.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TAILD</name>
    <description><![CDATA[GPTM Timer A PWM Interval Load Write 0: Update the GPTMTAR register with the value in the GPTMTAILR register on the next clock cycle. If the pre-scaler is used, update the GPTMTAPS register with the value in the GPTMTAPR register on the next clock cycle.  1: Update the GPTMTAR register with the value in the GPTMTAILR register on the next timeout. If the prescaler is used, update the GPTMTAPS register with the value in the GPTMTAPR register on the next timeout.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>TASNAPS</name>
    <description><![CDATA[GPTM Timer A Snap-Shot Mode 0: Snap-shot mode is disabled.  1: If Timer A is configured in the periodic mode, the actual free-running value of Timer A is loaded at the time-out event into the GPTM Timer A (GPTMTAR) register.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TAWOT</name>
    <description><![CDATA[GPTM Timer A Wait-On-Trigger 0: Timer A begins counting as soon as it is enabled.  1: If Timer A is enabled (TAEN is set in the GPTMCTL register), Timer A does not begin counting until it receives a trigger from the timer in the previous position in the daisy chain. This bit must be clear for GP Timer Module 0, Timer A]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TAMIE</name>
    <description><![CDATA[GPTM Timer A Match Interrupt Enable -0: The match interrupt is disabled.  -1: An interrupt is generated when the match value in the GPTMTAMATCHR register is reached in the one-shot and periodic modes.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TACDIR</name>
    <description><![CDATA[GPTM Timer A Count Direction -0: The timer counts down.  -1: The timer counts up. When counting up, the timer starts from a value of 0x0.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TAAMS</name>
    <description><![CDATA[GPTM Timer A Alternate Mode -0: Capture/Compare mode is enabled.  -1: PWM mode is enabled.  -Note: To enable PWM mode, you must also clear the TACM bit and configure the TAMR field to 0x2.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TACM</name>
    <description><![CDATA[GPTM Timer A Capture Mode -0: Edge-Count mode -1: Edge-Time mode]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TAMR</name>
    <description><![CDATA[GPTM Timer A Mode-0x0 Reserved -0x1 One-Shot Timer mode -0x2 Periodic Timer mode -0x3 Capture mode -The Timer mode is based on the timer configuration defined by bits 2:0 in the GPTMCFG register]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBMR</name>
    <description><![CDATA[GPTM Timer B Mode (GPTMTBMR)]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>TCACT</name>
    <description><![CDATA[Timer Compare Action Select0: Disable compare operations 1: Toggle State on Time-Out 2: Clear CCP on Time-Out 3: Set CCP on Time-Out 4: Set CCP immediately and toggle on Time-Out 5: Clear CCP immediately and toggle on Time-Out 6: Set CCP immediately and clear on Time-Out 7: Clear CCP immediately and set on Time-Out ]]></description>
    <bitRange>[15:13]</bitRange>
  </field>
  <field>
    <name>TBCINTD</name>
    <description><![CDATA[One-Shot/Periodic Interrupt Mode0: Normal Time-Out Interrupt 1: Mask Time-Out Interrupt ]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TBPLO</name>
    <description><![CDATA[Legacy PWM operation0: Legacy operation 1: CCP is set to 1 on time-out ]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>TBMRSU</name>
    <description><![CDATA[Timer B Match RegisterUpdate mode 0: Update the GPTMBMATCHR and the GPTMBPR]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>TBPWMIE</name>
    <description><![CDATA[GPTM Timer B PWM Interrupt EnableThis bit enables interrupts in PWM mode on rising]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBILD</name>
    <description><![CDATA[GPTM Timer A PWM Interval Load Write 0: Update the GPTMTAR register with the value in the GPTMTAILR register on the next clock cycle. If the pre-scaler is used, update the GPTMTAPS register with the value in the GPTMTAPR register on the next clock cycle.  1: Update the GPTMTAR register with the value in the GPTMTAILR register on the next timeout. If the prescaler is used, update the GPTMTAPS register with the value in the GPTMTAPR register on the next timeout.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>TBSNAPS</name>
    <description><![CDATA[GPTM Timer B Snap-Shot Mode0: Snap-shot mode is disabled. 1: If Timer B is configured in the periodic mode]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TBWOT</name>
    <description><![CDATA[GPTM Timer B Wait-On-Trigger0: Timer B begins counting as soon as it is enabled. 1: If Timer B is enabled (TBEN is set in the GPTMCTL register)]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TBMIE</name>
    <description><![CDATA[GPTM Timer B Match Interrupt Enable0: The match interrupt is disabled. 1: An interrupt is generated when the match value in the GPTMTBMATCHR register is reached in the one-shot and periodic modes. ]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TBCDIR</name>
    <description><![CDATA[GPTM Timer B Count Direction0: The timer counts down. 1: The timer counts up. When counting up]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TBAMS</name>
    <description><![CDATA[GPTM Timer B Alternate Mode0: Capture/Compare mode is enabled. 1: PWM mode is enabled. Note: To enable PWM mode]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TBCM</name>
    <description><![CDATA[GPTM Timer B Capture Mode0: Edge-Count mode GPTM1632S Specification version 0.5 Page 21 TI Confidential  NDA Restrictions 1: Edge-Time mode ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TBMR</name>
    <description><![CDATA[GPTM Timer B Mode0x0 Reserved 0x1 One-Shot Timer mode 0x2 Periodic Timer mode 0x3 Capture mode The Timer mode is based on the timer configuration defined by bits 2:0 in the GPTMCFG register. ]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTL</name>
    <description><![CDATA[GPTM Control (GPTMCTL)]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Software should not rely on the value of areserved bit. To provide compatibility with future products]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>TBPWML</name>
    <description><![CDATA[GPTM Timer B PWM Output Level0: Output is unaffected. 1: Output is inverted. ]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>TBOTE</name>
    <description><![CDATA[GPTM Timer B Output Trigger Enable0: The output Timer B ADC trigger is disabled. 1: The output Timer B ADC trigger is enabled. ]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of areserved bit. To provide compatibility with future products]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TBEVENT</name>
    <description><![CDATA[GPTM Timer B Event Mode0x0 Positive edge 0x1 Negative edge 0x2 Reserved 0x3 Both edges ]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>TBSTALL</name>
    <description><![CDATA[GPTM Timer B Stall Enable0: Timer B continues counting while the processor is halted by the debugger. 1: Timer B freezes counting while the processor is halted by the debugger. ]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBEN</name>
    <description><![CDATA[GPTM Timer B Enable0: Timer B is disabled. 1: Timer B is enabled and begins counting or the capture logic is enabled based on the GPTMCFG register. ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of areserved bit. To provide compatibility with future products]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TAPWML</name>
    <description><![CDATA[GPTM Timer A PWM Output Level0: Output is unaffected. 1: Output is inverted. ]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TAOTE</name>
    <description><![CDATA[GPTM Timer A Output Trigger Enable0: The output Timer A ADC trigger is disabled. 1: The output Timer A ADC trigger is enabled. ]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RTCEN</name>
    <description><![CDATA[GPTM RTC Enable0: RTC counting is disabled. 1: RTC counting is enabled. ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TAEVENT</name>
    <description><![CDATA[GPTM Timer A Event Mode0x0 Positive edge 0x1 Negative edge 0x2 Reserved 0x3 Both edges ]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>TASTALL</name>
    <description><![CDATA[GPTM Timer A Stall Enable0: Timer A continues counting while the processor is halted by the debugger. 1: Timer A freezes counting while the processor is halted by the debugger. ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TAEN</name>
    <description><![CDATA[GPTM Timer A Enable0: Timer A is disabled. 1: Timer A is enabled and begins counting or the capture logic is enabled based on the GPTMCFG register. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNC</name>
    <description><![CDATA[GPTM Synch Register (GPTMSYNC),]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SYNC11</name>
    <description><![CDATA[Synchronize GPTM Timer 110x0 GPTM11 is not affected. 0x1 A timeout event for Timer A of GPTM11 is triggered. 0x2 A timeout event for Timer B of GPTM11 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM11 is triggered. ]]></description>
    <bitRange>[23:22]</bitRange>
  </field>
  <field>
    <name>SYNC10</name>
    <description><![CDATA[Synchronize GPTM Timer 100x0 GPTM10 is not affected. 0x1 A timeout event for Timer A of GPTM10 is triggered. 0x2 A timeout event for Timer B of GPTM10 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM10 is triggered. ]]></description>
    <bitRange>[21:20]</bitRange>
  </field>
  <field>
    <name>SYNC9</name>
    <description><![CDATA[Synchronize GPTM Timer 90x0 GPTM9 is not affected. 0x1 A timeout event for Timer A of GPTM9 is triggered. 0x2 A timeout event for Timer B of GPTM9 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM9 is triggered. ]]></description>
    <bitRange>[19:18]</bitRange>
  </field>
  <field>
    <name>SYNC8</name>
    <description><![CDATA[Synchronize GPTM Timer 80x0 GPTM8 is not affected. 0x1 A timeout event for Timer A of GPTM8 is triggered. 0x2 A timeout event for Timer B of GPTM8 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM8 is triggered. ]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>SYNC7</name>
    <description><![CDATA[Synchronize GPTM Timer 70x0 GPT7 is not affected. GPTM1632S Specification version 0.5 Page 25 TI Confidential  NDA Restrictions 0x1 A timeout event for Timer A of GPTM7 is triggered. 0x2 A timeout event for Timer B of GPTM7 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM7 is triggered. ]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>SYNC6</name>
    <description><![CDATA[Synchronize GPTM Timer 60x0 GPTM6 is not affected. 0x1 A timeout event for Timer A of GPTM6 is triggered. 0x2 A timeout event for Timer B of GPTM6 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM6 is triggered. ]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>SYNC5</name>
    <description><![CDATA[Synchronize GPTM Timer 50x0 GPTM5 is not affected. 0x1 A timeout event for Timer A of GPTM5 is triggered. 0x2 A timeout event for Timer B of GPTM5 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM5 is triggered. ]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>SYNC4</name>
    <description><![CDATA[Synchronize GPTM Timer 40x0 GPTM4 is not affected. 0x1 A timeout event for Timer A of GPTM4 is triggered. 0x2 A timeout event for Timer B of GPTM4 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM4 is triggered. ]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>SYNC3</name>
    <description><![CDATA[Synchronize GPTM Timer 30x0 GPTM3 is not affected. 0x1 A timeout event for Timer A of GPTM3 is triggered. 0x2 A timeout event for Timer B of GPTM3 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM3 is triggered. ]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>SYNC2</name>
    <description><![CDATA[Synchronize GPTM Timer 20x0 GPTM2 is not affected. 0x1 A timeout event for Timer A of GPTM2 is triggered. 0x2 A timeout event for Timer B of GPTM2 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM2 is triggered. ]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>SYNC1</name>
    <description><![CDATA[Synchronize GPTM Timer 10x0 GPTM1 is not affected. 0x1 A timeout event for Timer A of GPTM1 is triggered. GPTM1632S Specification version 0.5 Page 26 TI Confidential  NDA Restrictions 0x2 A timeout event for Timer B of GPTM1 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM1 is triggered. ]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>SYNC0</name>
    <description><![CDATA[Synchronize GPTM Timer 00x0 GPTM0 is not affected. 0x1 A timeout event for Timer A of GPTM0 is triggered. 0x2 A timeout event for Timer B of GPTM0 is triggered. 0x3 A timeout event for both Timer A and Timer B of GPTM0 is triggered. ]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IMR</name>
    <description><![CDATA[GPTM Interrupt Mask (GPTMIMR)]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_3</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>WUMIS</name>
    <description><![CDATA[GPTM Write Update Error Interrupt Mask]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>DMABIM</name>
    <description><![CDATA[GPTM Timer B DMA DONE Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TBMIM</name>
    <description><![CDATA[GPTM Timer B Match Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CBEIM</name>
    <description><![CDATA[GPTM Timer B Capture Event Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CBMIM</name>
    <description><![CDATA[GPTM Timer B Capture Match Interrupt Mask0: Interrupt is disabled.  1: Interrupt is enabled. ]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBTOIM</name>
    <description><![CDATA[GPTM Timer B Time-out Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>DMAAIM</name>
    <description><![CDATA[GPTM Timer A DMA DONE Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TAMIM</name>
    <description><![CDATA[GPTM Timer A Match Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RTCIM</name>
    <description><![CDATA[GPTM RTC Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CAEIM</name>
    <description><![CDATA[GPTM Timer A Capture Event Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CAMIM</name>
    <description><![CDATA[GPTM Timer A Capture Match Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TATOIM</name>
    <description><![CDATA[GPTM Timer A Time-out Interrupt Mask0: Interrupt is disabled. 1: Interrupt is enabled. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
