zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>RIS</name>
    <description><![CDATA[GPTM Raw Interrupt Status (GPTMRIS)]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_3</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>WURIS</name>
    <description><![CDATA[GPTM Write Update Error Raw Interrupt0: No error. 1: Either Timer A or B was written twice in a Row or Timer A was written before the corresponding Timer B was written. ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>DMABRIS</name>
    <description><![CDATA[GPTM Timer B DMA Done Raw Interrupt]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TBMRIS</name>
    <description><![CDATA[GPTM Timer B Match Raw Interrupt]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CBERIS</name>
    <description><![CDATA[GPTM Timer B Capture Event Raw Interrupt]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CBMRIS</name>
    <description><![CDATA[GPTM Timer B Capture Match Raw Interrupt]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBTORIS</name>
    <description><![CDATA[GPTM Timer B Time-out Raw Interrupt]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>DMAARIS</name>
    <description><![CDATA[GPTM Timer A DMA DONE Raw Interrupt]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TAMRIS</name>
    <description><![CDATA[GPTM Timer A Match Raw Interrupt]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RTCRIS</name>
    <description><![CDATA[GPTM RTC Raw Interrupt]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CAERIS</name>
    <description><![CDATA[GPTM Timer A Capture Event Raw Interrupt]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CAMRIS</name>
    <description><![CDATA[GPTM Timer A Capture Match Raw Interrupt]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TATORIS</name>
    <description><![CDATA[GPTM Timer A Time-out Raw Interrupt]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MIS</name>
    <description><![CDATA[GPTM Masked Interrupt Status (GPTMMIS),]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_3</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>WUEMIS</name>
    <description><![CDATA[GPTM Write Update Error Masked Interrupt0: No error. 1: Either Timer A or B was written twice in a Row or Timer A was written before the corresponding Timer B was written. ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>DMABMIS</name>
    <description><![CDATA[GPTM Timer B DMA DONE Masked Interrupt]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TBMMIS</name>
    <description><![CDATA[GPTM Timer B Match Masked Interrupt]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CBEMIS</name>
    <description><![CDATA[GPTM Timer B Capture Event Masked Interrupt]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CBMMIS</name>
    <description><![CDATA[GPTM Timer B Capture Match Masked Interrupt]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBTOMIS</name>
    <description><![CDATA[GPTM Timer B Time-out Masked Interrupt]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>DMAAMIS</name>
    <description><![CDATA[GPTM Timer A DMA DONE Masked Interrupt]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TAMRIS</name>
    <description><![CDATA[GPTM Timer A Match Raw Interrupt]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RTCMIS</name>
    <description><![CDATA[GPTM RTC Masked Interrupt]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CAEMIS</name>
    <description><![CDATA[GPTM Timer A Capture Event Raw Interrupt]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CAMMIS</name>
    <description><![CDATA[GPTM Timer A Capture Match Raw Interrupt]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TATOMIS</name>
    <description><![CDATA[GPTM Timer A Time-out Raw Interrupt ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ICLR</name>
    <description><![CDATA[GPTM Interrupt Clear (GPTMICLR),]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_3</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>WUECINT</name>
    <description><![CDATA[GPTM Write Update Error Interrupt Clear]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>DMABINT</name>
    <description><![CDATA[GPTM Timer B DMA DONE Interrupt Clear]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TBMCINT</name>
    <description><![CDATA[GPTM Timer B Match Interrupt Clear]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CBECINT</name>
    <description><![CDATA[GPTM Timer B Capture Event Interrupt Clear]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CBMCINT</name>
    <description><![CDATA[GPTM Timer B Capture Match Interrupt Clear]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBTOCINT</name>
    <description><![CDATA[GPTM Timer B Time-out Interrupt Clear]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>DMAAINT</name>
    <description><![CDATA[GPTM Timer A DMA DONE Interrupt Clear]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TAMCINT</name>
    <description><![CDATA[GPTM Timer A Match Interrupt Clear]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RTCCINT</name>
    <description><![CDATA[GPTM RTC Interrupt Clear]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CAECINT</name>
    <description><![CDATA[GPTM Timer A Capture Event Interrupt Clear]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CAMCINT</name>
    <description><![CDATA[GPTM Timer A Capture Match Interrupt Clear]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TATOCINT</name>
    <description><![CDATA[GPTM Timer A Time-out Interrupt Clear ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAILR</name>
    <description><![CDATA[GPTM Timer A Interval Load  Register]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TAILR</name>
    <description><![CDATA[GPTM Timer A Interval Load  Register (GPTMTAILR)]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBILR</name>
    <description><![CDATA[GPTM Timer B Interval Load  Register]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TBILR</name>
    <description><![CDATA[GPTM Timer B Interval Load  Register (GPTMTBILR)]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAMATCHR</name>
    <description><![CDATA[GPTM TimerA Match Register]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TAMATCHR</name>
    <description><![CDATA[GPTM TimerA Match Register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBMATCHR</name>
    <description><![CDATA[GPTM TimerB Match Register]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TBMATCHR</name>
    <description><![CDATA[GPTM TimerB Match Register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAPR</name>
    <description><![CDATA[GPTM Timer A Pre-scale (GPTMTAPR)]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TAPSR</name>
    <description><![CDATA[GPTM Timer A Pre-scale]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBPR</name>
    <description><![CDATA[GPTM Timer B Pre-scale (GPTMTBPR)]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TBPSR</name>
    <description><![CDATA[GPTM Timer B Match Pre-scaleRegister 16: GPTM Timer A Pre-scale Match (GPTMTAPMR)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAPMR</name>
    <description><![CDATA[GPTM Timer A Pre-scale Match (GPTMTAPMR)]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TAPSMR</name>
    <description><![CDATA[GPTM Timer A Pre-scale Match]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBPMR</name>
    <description><![CDATA[GPTM Timer B Pre-scale Match (GPTMTBPMR)]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TBPSMR</name>
    <description><![CDATA[GPTM Timer B Pre-scale Match Register ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAR</name>
    <description><![CDATA[GPTM Timer A This register shows the current value of 16-bit Timer A except for Edge-Event Time and Count modes. In the Input Edge Count mode]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TAR</name>
    <description><![CDATA[GPTM Timer A Register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBR</name>
    <description><![CDATA[GPTM Timer B This register shows the current value of 16-bit Timer B except for Edge-Event Time and Count modes. In the Input Edge Count mode]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TBR</name>
    <description><![CDATA[GPTM Timer B Register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAV</name>
    <description><![CDATA[GPTM Timer A Value This register shows the current value of the free running 16-bit Timer A. In the 32-bit mode]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TAV</name>
    <description><![CDATA[GPTM Timer A Register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBV</name>
    <description><![CDATA[GPTM Timer B Value This register shows the current value of the free running 16-bit Timer B. Note: When the alternate timer clock (TIMCLK) is enabled; a read of a timer value will return the current count  1. ]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>TAV</name>
    <description><![CDATA[GPTM Timer B Register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RTCPD</name>
    <description><![CDATA[GPTM RTC Pre-divide Value This register shows the current value of the RTC pre-divider in RTC mode. Note: When the alternate timer clock (TIMCLK) is enabled; a read of a timer value will return the current count  -1. ]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00007FFF</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RTCPD</name>
    <description><![CDATA[GPTM RTC Pre-divider]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAPS</name>
    <description><![CDATA[GPTM Timer A Pre-scale Snap-shot This register shows the current value of the Timer A pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled; a read of a timer value will return the current count -1. ]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PSS</name>
    <description><![CDATA[GPTM Timer A Pre-scaler]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBPS</name>
    <description><![CDATA[GPTM Timer A Pre-scale Snap-shot This register shows the current value of the Timer B pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled; a read of a timer value will return the current count -1. ]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on thevalue of a reserved bit. ]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PSS</name>
    <description><![CDATA[GPTM Timer B Pre-scaler ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TAPV</name>
    <description><![CDATA[GPTM Timer A Pre-scale Value This register shows the current value of the Timer A free running pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled; a read of a timer value will return the current count  1. ]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PSV</name>
    <description><![CDATA[GPTM Timer A Pre-scaler Value]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TBPV</name>
    <description><![CDATA[GPTM Timer B Pre-scale Value This register shows the current value of the Timer B free running pre-scaler in the 16-bit mode. Note: When the alternate timer clock (TIMCLK) is enabled; a read of a timer value will return the current count-1. ]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PSV</name>
    <description><![CDATA[GPTM Timer B Pre-scaler Value ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DMAEV</name>
    <description><![CDATA[GPTM DMA Event This register allows software to enable/disable GPTM DMA trigger events. ]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>TBMDMAEN</name>
    <description><![CDATA[GPTM Timer B Match DMA Trigger Enable]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CBEDMAEN</name>
    <description><![CDATA[GPTM Timer B Capture Event DMA TriggerEnable ]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CBMDMAEN</name>
    <description><![CDATA[GPTM Timer B Capture Match DMA TriggerEnable ]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBTODMAEN</name>
    <description><![CDATA[GPTM Timer B Time-Out DMA TriggerEnable ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>TAMDMAEN</name>
    <description><![CDATA[GPTM Timer A Match DMA Trigger Enable]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RTCDMAEN</name>
    <description><![CDATA[GPTM RTC Match DMA Trigger Enable]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CAEDMAEN</name>
    <description><![CDATA[GPTM Timer A Capture Event DMA TriggerEnable ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CAMDMAEN</name>
    <description><![CDATA[GPTM Timer A Capture Match DMA TriggerEnable ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TATODMAEN</name>
    <description><![CDATA[GPTM Timer A Time-Out DMA TriggerEnable  ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCEV</name>
    <description><![CDATA[GPTM DMA Event This register allows software to enable/disable GPTM ADC trigger events. ]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>TBMADCEN</name>
    <description><![CDATA[GPTM Timer B Match ADC Trigger Enable]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CBEADCEN</name>
    <description><![CDATA[GPTM Timer B Capture Event ADC TriggerEnable ]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CBMADCEN</name>
    <description><![CDATA[GPTM Timer B Capture Match ADC TriggerEnable ]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TBTOADCEN</name>
    <description><![CDATA[GPTM Timer B Time-Out ADC TriggerEnable ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>TAMADCEN</name>
    <description><![CDATA[GPTM Timer A Match ADC Trigger Enable]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RTCADCEN</name>
    <description><![CDATA[GPTM RTC Match ADC Trigger Enable]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CAEADCEN</name>
    <description><![CDATA[GPTM Timer A Capture Event ADC TriggerEnable ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CAMADCEN</name>
    <description><![CDATA[GPTM Timer A Capture Match ADC TriggerEnable ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TATOADCEN</name>
    <description><![CDATA[GPTM Timer A Time-Out ADC TriggerEnable ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VERSION</name>
    <description><![CDATA[GPTM Peripheral Properties This register provides information regarding the GPTM ]]></description>
    <addressOffset>0x00000FB0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000400</resetValue>
<fields>
  <field>
    <name>VERSION</name>
    <description><![CDATA[Timer Size  0: Timer A/B are 16-bits wide with 8-bit prescale 1: Timer A/B are 32-bits wide with 16-bit prescale. ]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
