zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>ANDCPP</name>
    <description><![CDATA[This register is used to logically AND PWM output pairs for each timer]]></description>
    <addressOffset>0x00000FB4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CPP_AND_EN</name>
    <description><![CDATA[Bit 0 enables anding of the CPP outputs for timers A and B ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>VIMS</name>
<description><![CDATA[]]></description>
<baseAddress>0x40034000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>STATUS</name>
    <description><![CDATA[VIMS status]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Unused – reserved]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>LBDISABLED</name>
    <description><![CDATA[0: SYSBUS linebuffer is enabled or in transition to disabled
1: SYSBUS linebuffer is disabled and flushed]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MODECHANGE</name>
    <description><![CDATA[0 : VIMS is in the mode defined by bit[1:0]
1 : VIMS is in the process of changing to  the mode specified in the control register]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>INV</name>
    <description><![CDATA[Invalidate in progress]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>MODE</name>
    <description><![CDATA[Current mode
00 : Disabled
01 : Enabled
10 : Split
11 : Off]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONTROL</name>
    <description><![CDATA[VIMS control]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CLRSTAT</name>
    <description><![CDATA[Set to clear statistic counters.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>ENSTAT</name>
    <description><![CDATA[Set to enable statistic counters.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[29:5]</bitRange>
  </field>
  <field>
    <name>LBDISABLE</name>
    <description><![CDATA[0: SYSBUS linebuffer enable request (default)
1: SYSBUS linebuffer disable request]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ARBITRATION</name>
    <description><![CDATA[Arbitration priority between sysbus and icode/dcode
0 : Static ( icode/docde > sysbus)
1: round-robin]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PREFETCH</name>
    <description><![CDATA[Enable tag-prefetch]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>MODE</name>
    <description><![CDATA[VIMS mode request
00 : Disabled
01 : Enabled
10 : Split
11 : Off]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT0</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>HITS</name>
    <description><![CDATA[Cache hit counter.
Increments on every cache hit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT1</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>MISS</name>
    <description><![CDATA[Cache miss counter.
Increments on every cache miss]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT2</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LBHITS</name>
    <description><![CDATA[Cache linebuffer hit counter.
Increments on every read from linebuffer]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT3</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PFHIT</name>
    <description><![CDATA[Cache prefetch hit counter.
Increments if prefetched tag is used in next access]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT4</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ICODESTALL</name>
    <description><![CDATA[Icode stall counter.
Increments every cycle where icode is stalled (HREADY==0)]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT5</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DCODESTALL</name>
    <description><![CDATA[Dcode stall counter.
Increments every cycle where dcode is stalled (HREADY=0)]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT6DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>WAY0HIT</name>
    <description><![CDATA[Cache hit counter – way0]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT7DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x0000011C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>WAY1HIT</name>
    <description><![CDATA[Cache hit counter – way1]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT8DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000120</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>WAY2HIT</name>
    <description><![CDATA[Cache hit counter – way2]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT9DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000124</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>WAY3HIT</name>
    <description><![CDATA[Cache hit counter – way3]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT10DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000128</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FBOVERFLOW</name>
    <description><![CDATA[Fill buffer overflow counter]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT11DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x0000012C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PFCNT</name>
    <description><![CDATA[Tag prefetch counter]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT12DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000130</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>TAGCACHE</name>
    <description><![CDATA[Tag versus cache writes]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT13DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000134</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ICODERUN</name>
    <description><![CDATA[Icode run counter]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT14DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000138</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DCODERUN</name>
    <description><![CDATA[Dcode run counter]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT15DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x0000013C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FLASHCACHEREQ</name>
    <description><![CDATA[Flash request from cache block]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT16DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000140</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FLASHIDREQ</name>
    <description><![CDATA[Flash requests from idbus]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT17DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000144</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CACHEREQ</name>
    <description><![CDATA[Cache read requests]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STAT18DEBUG</name>
    <description><![CDATA[Cache statistics]]></description>
    <addressOffset>0x00000148</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>BROMIDREQ</name>
    <description><![CDATA[Boot ROM read requests from icode/dcode]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
