zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>ADI3</name>
<description><![CDATA[Analog Digital Interface]]></description>
<baseAddress>0x40086200</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000200</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DIR03</name>
    <description><![CDATA[Direct access for  adi byte offsets 0 to 3]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to ADI register 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to ADI register 2]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to ADI register 1]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to ADI register 0]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR47</name>
    <description><![CDATA[Direct access for  adi byte offsets 4 to 7]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to ADI register 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to ADI register 6]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to ADI register 5]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to ADI register 4]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR811</name>
    <description><![CDATA[Direct access for  adi byte offsets 8 to 11]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to ADI register 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to ADI register 10]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to ADI register 9]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to ADI register 8]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR1215</name>
    <description><![CDATA[Direct access for  adi byte offsets 12 to 15]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to ADI register 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to ADI register 14]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to ADI register 13]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to ADI register 12]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET03</name>
    <description><![CDATA[Set register for ADI byte offsets 0 to 3]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 3. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 2. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 1. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 0. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET47</name>
    <description><![CDATA[Set register for ADI byte offsets 4 to 7]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 7. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 6. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 5. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 4. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET811</name>
    <description><![CDATA[Set register for ADI byte offsets 8 to 11]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 11. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 10. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 9. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 8. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET1215</name>
    <description><![CDATA[Set register for ADI byte offsets 12 to 15]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 15. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 14. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 13. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in ADI register 12. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR03</name>
    <description><![CDATA[Clear register for ADI byte offsets 0 to 3]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 2]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 1]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 0]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR47</name>
    <description><![CDATA[Clear register for ADI byte offsets 4 to 7]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 6]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 5]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 4]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR811</name>
    <description><![CDATA[Clear register for ADI byte offsets 8 to 11]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 10]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 9]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 8]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR1215</name>
    <description><![CDATA[Clear register for ADI byte offsets 12 to 15]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 14]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 13]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in ADI register 12]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SLAVESTAT</name>
    <description><![CDATA[ADI Slave status register]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DI_REQ</name>
    <description><![CDATA[Read current value of DI_REQ signal. Writing 0 to this bit forces a sync with slave, ensuring that req will be 0. It is recommended to write 0 to this register before power down of the master.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DI_ACK</name>
    <description><![CDATA[Read current value of DI_ACK signal]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SLAVECLR</name>
    <description><![CDATA[ADI Slave reset register]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RESETLOCK</name>
    <description><![CDATA[This register is no longer accessible when this bit is set.  (unless sticky_bit_overwrite is asserted on top module)]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[6:1]</bitRange>
  </field>
  <field>
    <name>RESET</name>
    <description><![CDATA[Write 1 to reset the ADI slave]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SLAVECONF</name>
    <description><![CDATA[ADI Master configuration register]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000004</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CONFLOCK</name>
    <description><![CDATA[This register is no longer accessible when this bit is set.  (unless sticky_bit_overwrite is asserted on top module)]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[6:3]</bitRange>
  </field>
  <field>
    <name>WAITFORACK</name>
    <description><![CDATA[A transaction on the ADI interface does not end until ack has been received from the slave when this bit is set.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>ADICLKSPEED</name>
    <description><![CDATA[Sets the period of an ADI transactions. All transactions takes an even number of clock cycles,- ADI clock rising edge occurs in the middle of the period. Data and ctrl to slave is set up in beginning of cycle, and data from slave is read in after the transaction
00: An ADI transaction takes 2 master clock cyclkes
01: An ADI transaction takes 4 master clock cycles
10: And ADI Transaction takes 8 master clock cycles
11: An ADI transaction takes 16 master clock cycles]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B01</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 0 and 1]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 1]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 1, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 1]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 1, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 0]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 0, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 0]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 0, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B23</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 2 and 3]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 3]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 3, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 3]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 3, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 2]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 2, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 2]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 2, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B45</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 4 and 5]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 5]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 5, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 5]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 5, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 4]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 4, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 4]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 4, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B67</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 6 and 7]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 7]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 7, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 7]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 7, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 6]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 6, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 6]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 6, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
