zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MASK4B89</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 8 and 9]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 9]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 9, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 9]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 9, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 8]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 8, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 8]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 8, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1011</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 10 and 11]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 11]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 11, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 11]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 11, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 10]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 10, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 10]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 10, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1213</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 12 and 13]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 13]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 13, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 13]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 13, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 12]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 12, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 12]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 12, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1415</name>
    <description><![CDATA[Masked access (4m/4d) for ADI Registers at byte offsets 14 and 15]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 15]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 15, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 15]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 15, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in ADI register 14]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in ADI register 14, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in ADI register 14]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in ADI register 14, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B01</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 0 and 1]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 1]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 1, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 0]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 0, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B23</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 2 and 3]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 3, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 2]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 2, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B45</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 4 and 5]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 5]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 5, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 4]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 4, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B67</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 6 and 7]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 7, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 6]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 6, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B89</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 8 and 9]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 9]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 9, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 8]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 8, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1011</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 10 and 11]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 11, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 10]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 10, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1213</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 12 and 13]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 13]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 13, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 12]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 12, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1415</name>
    <description><![CDATA[Masked access (8m/8d) for ADI Registers at byte offsets 14 and 15]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  ADI register 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for ADI register 15, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  ADI register 14]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for ADI register 14, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B01</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 0 and 1]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 0 and 1]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  0 and 1, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B23</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 2 and 3]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 2 and 3]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  2 and 3, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B45</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 4 and 5]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 4 and 5]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  4 and 5, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B67</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 6 and 7]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 6 and 7]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  6 and 7, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B89</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 8 and 9]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 8 and 9]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  8 and 9, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1011</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 10 and 11]]></description>
    <addressOffset>0x00000094</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 10 and 11]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  10 and 11, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1213</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 12 and 13]]></description>
    <addressOffset>0x00000098</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 12 and 13]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  12 and 13, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1415</name>
    <description><![CDATA[Masked access (16m/16d) for ADI Registers at byte offsets 14 and 15]]></description>
    <addressOffset>0x0000009C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for ADI register 14 and 15]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for ADI register at offsets  14 and 15, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
