zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>TRNG</name>
<description><![CDATA[True Random Number generator]]></description>
<baseAddress>0x40028000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00002000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>OUTLOW</name>
    <description><![CDATA[Output register for LSW randon number
read  access to LSW of 64-bit random number]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>OUT</name>
    <description><![CDATA[Least significant word half of 64-bit word of random data, only valid when the 'ready'
bit in the TRNG_STATUS register has value '1'.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OUTHI</name>
    <description><![CDATA[To Read MSW of Random Number
read access to MSW of 64-bit random number]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>OUT</name>
    <description><![CDATA[Most significant word half of 64-bit word of random data, only valid when the 'ready'
bit in the TRNG_STATUS register has value '1'.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STATUS</name>
    <description><![CDATA[Status register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>NEED_CLOCK</name>
    <description><![CDATA[1' indicates that the TRNG is busy generating entropy or is in one of its test modes - clocks may not be turned off and the power supply voltage must be kept stable. This bit is a direct mirror of the 'TRNG_need_clock' output signal of the module.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[30:2]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN_OFLO</name>
    <description><![CDATA[1' = the number of FROs shut down after a second 'error event' (i.e. the number of
'1' bits in the TRNG_ALARMSTOP register) has exceeded the threshold set by 'shutdown_threshold' in the TRNG_ERRORCNT register. Writing a '1' to bit [1] of the TRNG_INTACK register clears this bit to '0' again.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>READY</name>
    <description><![CDATA[1' = data is available in the TRNG_OUTPUT_H/L registers. Acknowledging this state by writing a '1' to bit [0] of the TRNG_INTACK register clears this bit to '0', if a new number is already available in the internal register of the TRNG, the number is directly clocked into the result register. In this case the status bit is asserted again, after one clock cycle.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INTMASK</name>
    <description><![CDATA[Interrupt mask register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN_OFLO</name>
    <description><![CDATA[1' = allow the 'shutdown_oflo' bit in the TRNG_STATUS register to activate the
(active LOW) 'SINTREQUEST' output.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>READY</name>
    <description><![CDATA[1' = allow the 'ready' bit in the TRNG_STATUS register to activate the (active LOW)
'SINTREQUEST' output.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INTACK</name>
    <description><![CDATA[Interrupt acknowledge register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN_OFLO</name>
    <description><![CDATA[Write a '1' to clear the 'shutdown_oflo' bit in the TRNG_STATUS register. Need not
be written with a '0' after writing a '1', always reads '0'.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>READY</name>
    <description><![CDATA[Write a '1' to clear the 'ready' bit in the TRNG_STATUS register. Need not be written with a '0' after writing a '1', always reads '0'.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONTROL</name>
    <description><![CDATA[Control register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>STARTUP_CYCLES</name>
    <description><![CDATA[This field determines the number of samples (between 28 and 224) taken to gather entropy from the FROs during startup. If the written value of this field is zero, the number of samples is 224, otherwise the number of samples equals the written value
times 28.
This field can only be written when 'enable_trng' was '0' before the write.]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:11]</bitRange>
  </field>
  <field>
    <name>ENABLE_TRNG</name>
    <description><![CDATA[Setting this bit to '1' starts the TRNG, gathering entropy from the FROs for the
number of samples determined by the value in the 'startup_cycles' field. Resetting this bit to '0' forces all TRNG logic back into the idle state immediately.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[9:3]</bitRange>
  </field>
  <field>
    <name>NO_LFSR_FB</name>
    <description><![CDATA[1' = Remove XNOR feedback from the main LFSR, converting it into a normal shift
register for the XOR-ed outputs of the FROs (shifting data in on the LSB side). A '1' also forces the LFSR to sample continuously.
This bit can only be set to '1' when 'test_mode' is also set to '1'.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TEST_MODE</name>
    <description><![CDATA[1' = Enables access to the TRNG_COUNT and TRNG_LFSR_L/M/H registers (the latter are cleared before enabling access)  and keep 'TRNG_need_clock' output active
HIGH for testing purposes.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG</name>
    <description><![CDATA[Contains the seed]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>MAX_REFILL_CYCLES</name>
    <description><![CDATA[This field determines the maximum number of samples (between 28 and 224) taken to re-generate entropy from the FROs after reading out a 64 bits random number. If the written value of this field is zero, the number of samples is 224, otherwise the number of samples equals the written value times 28.
This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0'.]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>SAMPLE_DIV</name>
    <description><![CDATA[This field directly controls the number of CLK input cycles between samples taken
from the FROs. Default value 0 indicates that samples are taken every CLK cycle,
maximum value 15d takes one sample every 16 CLK cycles.
This field must be set to a value such that the slowest FRO (even under worst-case
conditions) has a cycle time less than twice the sample period.
This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0'.]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>MIN_REFILL_CYCLES</name>
    <description><![CDATA[This field determines the minimum number of samples (between 26 and 224) taken to re-generate entropy from the FROs after reading out a 64 bits random number. If the value of this field is zero, the number of samples is fixed to the value determined by the 'max_refill_cycles' field, otherwise the minimum number of samples equals the written value times 64 (which can be up to 214). The number of samples defined here
cannot be higher than the number defined by the 'max_refill_cycles' field (i.e. that field takes precedence).
This field can only be modified while 'enable_trng' in TRNG_CONTROL is '0'.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALARMCNT</name>
    <description><![CDATA[Shutdown interr cntrl registers]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000FF</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN_COUNT</name>
    <description><![CDATA[Read-only, indicates the number of '1' bits in the TRNG_ALARMSTOP register.
This field is 6 bits wide to allow up to 32 'ones' to be indicated; the actual maximum
value equals the number of FROs.]]></description>
    <bitRange>[29:24]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN_THRESHOLD</name>
    <description><![CDATA[Threshold setting for generating the 'shutdown_oflo' interrupt, which is activated
when the 'shutdown_count' value in this register exceeds the value set here.]]></description>
    <bitRange>[20:16]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>ALARM_THRESHOLD</name>
    <description><![CDATA[Alarm detection threshold for the repeating pattern detectors on each FRO. An FRO 'alarm event' is declared when a repeating pattern (of up to four samples length) is detected continuously for the number of samples defined by this field's value. Reset value 255d should keep the number of 'alarm events' to a manageable level.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FROENABLE</name>
    <description><![CDATA[FRO enable register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00FFFFFF</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>FRO_ENABLES</name>
    <description><![CDATA[Enable bits for the individual FROs, a '1' in bit [n] enables FRO 'n'. Default state is all '1's to enable all FROs after power-up (note that they are not actually started up before the 'enable_trng' bit in the TRNG_CONTROL register is set to '1'). Bits are automatically forced to '0' here (and cannot be written to '1') while the corresponding bit in the TRNG_ALARMSTOP register has value '1'.]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FRODETUNE</name>
    <description><![CDATA[FRO de-tune bits register]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>FRO_DETUNES</name>
    <description><![CDATA[De-tune bits for the individual FROs, a '1' in bit [n] lets FRO 'n' run approximately 5% faster. The value of one of these bits may only be changed while the corresponding FRO is turned off (by temporarily writing a '0' in the corresponding
bit of the TRNG_FROENABLE register).]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALARMMASK</name>
    <description><![CDATA[Alarm event log register]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>FRO_ALARMMASKS</name>
    <description><![CDATA[Logging bits for the 'alarm events' of individual FROs. A '1' in bit [n] indicates FRO 'n' experienced an 'alarm event'.]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALARMSTOP</name>
    <description><![CDATA[Alarm shutdown register]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>FRO_ALARMSTOPS</name>
    <description><![CDATA[Logging bits for the 'alarm events' of individual FROs, a '1' in bit [n] indicates FRO 'n' experienced more than one 'alarm event' in quick succession and has been turned off. A '1' in this field forces the corresponding bit in the  TRNG_FROENABLE register to '0'.]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LFSR_L</name>
    <description><![CDATA[Main LFSR bits [31:0]]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LFSR_31_0</name>
    <description><![CDATA[Bits [31:0] of the main entropy accumulation LFSR. Register can only be accessed when 'test_mode' bit in TRNG_CONTROL is set to '1', register contents will be
cleared to zero before access is enabled.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LFSR_M</name>
    <description><![CDATA[Main LFSR bits [63:32]]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LFSR_63_32</name>
    <description><![CDATA[Bits [63:32] of the main entropy accumulation LFSR. Register can only be accessed when 'test_mode' bit in TRNG_CONTROL is set to '1', register contents will be cleared to zero before access is enabled.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LFSR_H</name>
    <description><![CDATA[Main LFSR bits [80:64]]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>LFSR_80_64</name>
    <description><![CDATA[Bits [80:64] of the main entropy accumulation LFSR. Register can only be accessed
when 'test_mode' bit in TRNG_CONTROL is set to '1', register contents will be
cleared to zero before access is enabled.]]></description>
    <bitRange>[16:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>COUNT</name>
    <description><![CDATA[Revision number
]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SAMPLE_COUNTER</name>
    <description><![CDATA[Sample counter used by control FSM. Counter can only be accessed when 'test_mode' bit in TRNG_CONTROL is set to '1'.]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEST</name>
    <description><![CDATA[Engine options information]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>TEST_PATTERN</name>
    <description><![CDATA[Repeating sequence of bits to be fed into the selected FRO delay chain ('test_patt_fro'
= '1') and/or the selected FRO error detection circuit ('test_patt_det' = '1'). This field is rotated right over one bit once every sample period when either of these control bits is '1', bit [16] is the actual pattern bit fed into the test target.]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Bits should be written with a '0' and should be ignored on a read.]]></description>
    <bitRange>[15:13]</bitRange>
  </field>
  <field>
    <name>TEST_SELECT</name>
    <description><![CDATA[Number of the FRO to be tested, value should be in range 0 - 23.]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>TEST_PATT_DET</name>
    <description><![CDATA[1' = Repeatedly feed 'test_pattern' into the error detection circuit of the FRO selected by the 'test_select' field.
This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TEST_PATT_FRO</name>
    <description><![CDATA[1' = Repeatedly feed 'test_pattern' into the delay chain of the FRO selected by the 'test_select' field by forcing the corresponding 'TEST_fro_enable' output LOW and forcing the corresponding 'TEST_fro_testin' output to the state of bit [16] of this
register.
This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TEST_EN_OUT</name>
    <description><![CDATA[1' = Enable the 'tst_fro_clk_out' output, connecting to the FRO selected by the 'test_select' field.
This bit can only be set to '1' when 'test_mode' in TRNG_CONTROL is '1' too.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OPTIONS</name>
    <description><![CDATA[Engine options information]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000600</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>NR_OF_FROS</name>
    <description><![CDATA[Number of FROs implemented in this TRNG, value 24 (decimal) for now.]]></description>
    <bitRange>[11:6]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EIP_REV</name>
    <description><![CDATA[EIP number and core revision]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0200B44B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>MAJOR_HW_REVISION</name>
    <description><![CDATA[4 bits binary encoding of the major hardware revision number.]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>MINOR_HW_REVISION</name>
    <description><![CDATA[4 bits binary encoding of the minor hardware revision number.]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>HW_PATCH_LEVEL</name>
    <description><![CDATA[4 bits binary encoding of the hardware patch level, initial release will carry value zero.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>COMPLEMENT_OF_BASIC_EIP_NUMBER</name>
    <description><![CDATA[Bit-by-bit logic complement of bits [7:0], EIP 75t gives 0xB4.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>BASIC_EIP_NUMBER</name>
    <description><![CDATA[8 bits binary encoding of the EIP number, EIP 75t gives 0x4B.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MMR_STATUS_EN</name>
    <description><![CDATA[A read only reg indicating the Overall interrupt status]]></description>
    <addressOffset>0x00001FD8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN_OFLO</name>
    <description><![CDATA[]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>READY</name>
    <description><![CDATA[Indicates that when asserted Random number ready to be
read out.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>REV</name>
    <description><![CDATA[EIP-75t Module revision number]]></description>
    <addressOffset>0x00001FE0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000020</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>REVISION</name>
    <description><![CDATA[The revision number of this module is Rev 2.0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYSCONF</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00001FE4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>IDLE_TYPE</name>
    <description><![CDATA["00" for Force idle & "10" for smart idle]]></description>
    <bitRange>[4:3]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>AUTOIDLE</name>
    <description><![CDATA[]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MMR_STATUS_SET</name>
    <description><![CDATA[A read write register where the contents of mmr_status_raw can be read from this address.]]></description>
    <addressOffset>0x00001FEC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SW_INT</name>
    <description><![CDATA[To set interrupts for testability purpose by soft ware]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
