zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>SOFTRESET</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00001FF0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SOFT_RESET</name>
    <description><![CDATA[Write '1' to soft reset , reset will be low for 4-5 clock cycles.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQ_EOI_REG</name>
    <description><![CDATA[To clear top_intr_req]]></description>
    <addressOffset>0x00001FF4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>PULSE_INT_CLEAR</name>
    <description><![CDATA[write 1 to clear the pulse interrupt]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQSTATUS</name>
    <description><![CDATA[Interrupt Status]]></description>
    <addressOffset>0x00001FF8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[These bits should be written with zero and ignored on reads]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[TRNG Interrupt status.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQENABLE</name>
    <description><![CDATA[The TRNG_IRQENABLE is a read write register that enables the interrupt of the TRNG engine]]></description>
    <addressOffset>0x00001FFC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ENABLE</name>
    <description><![CDATA[Enable the TRNG Interrupt.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>SPIS</name>
<description><![CDATA[SPI Slave Component]]></description>
<baseAddress>0x40085000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>GPF</name>
    <description><![CDATA[Register: GP_FLAGS

This register contains some general purpose SPI related flags. All flag bits herein are set ('1') by the peripheral when the respective event occurs. If an event occurs while the MCU domain is off, the event flag will be set when the MCU domain is powered on. This allows the MCU software to notice and take action on events that have occurred while the MCU domain has been off. Flags are sticky '1' until cleared by software by writing '0' to the respective bit field. Writing '1' to bit fields does not set the respective flag.]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>BYTEDONEEV</name>
    <description><![CDATA[BYTE_DONE_EV: A complete byte transfer event. This event is also available from SPIS Core to the AON Event Fabric. The event is cleared by accessing this register bit field.

1 = 	A complete byte transfer (TX/RX) has taken place.

0 = 	No byte done event detected since last cleared by SW.
]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PRXOFEV</name>
    <description><![CDATA[PRX_OF_EV: SPI-Core Parallel RX data overflow event.

1 =  An overflow condition of sampled SI-pin data is detected in the SPI-Core due to that the MCU-SPI module has not been able to sample the PRX data bus. The SPI Core is able to buffer one byte of data sampled on the SI-pin. This event is eventually to occur during SPI traffic when the MCU domain is in power-down. Later, when the MCU wakes up, the overflow condition is registered - and this flag is set.

0 =  No overflow condition is detected since last cleared by SW.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>INCOMEV</name>
    <description><![CDATA[INCOM_EV: Incomplete SPI transaction event.

1 =  Chip select has been de-asserted during an ongoing incomplete byte transfer.

0 =  No SPI incomplete event detected since last cleared by SW.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CSEV</name>
    <description><![CDATA[CS_EV: Chip select event.

1 =  Chip select assertion is detected.

0 =  Chip select has not been asserted since last cleared by SW.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPFD</name>
    <description><![CDATA[Register: GP_FLAGS_DEBUG

This register is intended for debug access only. The bit fields are aligned equally as the GP_FLAGS register. The bit fields are only settable, and are not readable. A read attempt will only result in 0x00. The main purpose of this register is to use it in combination with respective event signals for interrupt debugging.]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>BYTEDONE</name>
    <description><![CDATA[ - ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PRXOF</name>
    <description><![CDATA[ - ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SPIINCOM</name>
    <description><![CDATA[ - ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CS</name>
    <description><![CDATA[ - ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPFEM</name>
    <description><![CDATA[Register: GP_FLAGS_EVENT_MASK

The flag event signal is a combination of all flag associated bit fields that is defined for the peripheral. One or more flags can be enabled as event triggers - and may be polled in SW in order to determine the event source. This register defines a mask for which of the flags defined in the GP_FLAGS register that are to be enabled as flag event sources.]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>DMADONERXF</name>
    <description><![CDATA[DMA_DONE_RXF: Enable bit for DMA-done RX FIFO-channel.

1 =	Flag is enabled as an event source.
0 = 	Flag is not an event source.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DMADONETXF</name>
    <description><![CDATA[DMA_DONE_TXF: Enable bit for DMA-done TX FIFO-channel.

1 =	Flag is enabled as an event source.
0 = 	Flag is not an event source.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>BYTEDONE</name>
    <description><![CDATA[BYTE_DONE: Enable bit for GP_FLAGS<BYTE_DONE_EV> as event signal.

1 =	Flag is enabled as an event source.
0 = 	Flag is not an event source.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PRXOF</name>
    <description><![CDATA[PRX_OF: Enable bit for GP_FLAGS<PRX_OF_EV> as event signal.

1 = Flag is enabled as an event source.
0 =  Flag is not an event source.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>INCOM</name>
    <description><![CDATA[INCOM: Enable bit for GP_FLAGS<INCOM_EV> as event signal.

1 = Flag is enabled as an event source.
0 =  Flag is not an event source.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CS</name>
    <description><![CDATA[CS: Enable bit for GP_FLAGS<CS_EV> as event signal.

1 = Flag is enabled as an event source.
0 =  Flag is not an event source.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CFG</name>
    <description><![CDATA[Register: CONFIG

This register is used to define the SPI clock polarity, configuration of first bit MOSI and MISO LSB/MSB SPI data and selection of whether to use the single request or request to the DMA controller. Both the TX FIFO and RX FIFO have their own unique DMA channel. The ?X_FIFO_STATUS_EVENT_SEL registers are used to select the source that will trigger the DMA.]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>RXFDMAREQTP</name>
    <description><![CDATA[RXF_DMA_REQ_TP: RX FIFO DMA request type select.

1 = 	Single request is chosen (request output is set to '0').
0 = 	Request is chosen (single request output is set to '0').]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TXFDMAREQTP</name>
    <description><![CDATA[TXF_DMA_REQ_TP: TX FIFO DMA request type select.

1 = 	Single request is chosen (request output is set to '0').
0 = 	Request is chosen (single request output is set to '0').]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PRXSWP</name>
    <description><![CDATA[PRXSWP: MOSI first bit configuration.

1 =	First bit is MSB.
0 = 	First bit is LSB.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PTXSWP</name>
    <description><![CDATA[PTXSWP: MISO first bit configuration.

1 =	First bit is MSB.
0 = 	First bit is LSB.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>POL</name>
    <description><![CDATA[POL: SPI clock polarity.

A copy of the polarity value is latched in the AON SPI-Core module. Consequently, if the MCU domain is powered down, the polarity value is withheld and this bit field is updated once MCU powers up.

