zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
1 =	CPOL=1	CPHA=0
0 = 	CPOL=0	CPHA=0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFF</name>
    <description><![CDATA[Register: TX_FIFO_FLAGS

All flag bits herein are set ('1') by the peripheral when the respective condition is met. Flags are sticky '1' until cleared by software by writing '0' to the respective bit field. Writing '1' to bit fields does not set the respective flag. If software attempts to clear a flag that still is in condition to be set, the peripheral takes precedence and the flag remains set.]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OFLOW</name>
    <description><![CDATA[O_FLOW: TX FIFO overflow flag.

1 =  The TX FIFO has experienced overflow due to that the MCU has attempted to write data into an already full TX FIFO (sticky high until cleared by SW).

0 = The TX FIFO has not experienced overflow since last cleared by SW.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>UFLOW</name>
    <description><![CDATA[U_FLOW: TX FIFO underflow flag.

1 =  The TX FIFO has experienced underflow due to data request from the SPI Slave Core while TX FIFO is empty (sticky high until cleared by SW). Default 'empty' data sent out from the TX FIFO is 0x00.

0 =  The TX FIFO has not experienced underflow since last cleared by SW.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HAS_DATA: TX FIFO has one or more bytes flag.

1 =  Number of bytes in TX FIFO has become greater than zero (not empty) (sticky high until cleared by SW). If SW attempts to clear the flag while the TX FIFO has data (not empty), the flag remains set.

0 =  Number of bytes in TX FIFO has not become greater than zero (i.e. is empty) since last cleared by SW.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LE_WM: TX FIFO less than or equal to TX FIFO water mark level flag.
1 =  Number of bytes in TX FIFO has become equal to or less than TX FIFO water mark level (sticky high until cleared by SW). If SW attempts to clear the flag while number of bytes in TX FIFO is equal to or less than TX FIFO water mark level, the flag remains set.
0 =  Number of bytes in TX FIFO has not become equal to or less than the TX FIFO water mark level since last cleared by SW.
]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GE_WM: TX FIFO greater than or equal to TX FIFO water mark level flag.

1 =  Number of bytes in TX FIFO has become equal to or greater than TX FIFO water mark level (sticky high until cleared by SW). If SW attempts to clear the flag while number of bytes in TX FIFO is equal to or greater than TX FIFO water mark level, the flag remains set.

0 =  Number of bytes in TX FIFO has not become equal to or greater than the TX FIFO water mark level since last cleared by SW.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: TX FIFO empty flag.

1 =  TX FIFO has become empty or is empty (sticky high until cleared by SW). If SW attempts to clear the flag while the TX FIFO is empty, the flag remains set.

0 =  TX FIFO has not become empty since last cleared by SW.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: TX FIFO full flag.

1 =  TX FIFO has become full or is full (sticky high until cleared by SW). If SW attempts to clear the flag while the TX FIFO is full, the flag remains set.

0 =  TX FIFO has not become full since last cleared by SW.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFFD</name>
    <description><![CDATA[Register: TX_FIFO_FLAGS_DEBUG

This register is intended for debug access only. The bit fields are aligned equally as the TX_FIFO_FLAGS register. The bit fields are only settable, and are not readable. A read attempt will only result in 0x00. The main purpose of this register is to use it in combination with respective event signals for interrupt debugging. Neither the FIFO conditions nor the status register are modified due to actions performed on this register.]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OFLOW</name>
    <description><![CDATA[OFLOW: TX FIFO overflow flag.
1 = 	TX FIFO overflow event is forced to 1]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>UFLOW</name>
    <description><![CDATA[UFLOW: TX FIFO underflow flag.
1 = 	TX FIFO underflow event is forced to 1]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HASDATA: TX FIFO has data  flag.
1 = 	TX FIFO has data event is forced to 1]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LEWM: TX FIFO water mark level event.
1 = TX FIFO lower than water mark event is forced to 1]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GEWM: TX FIFO GE water mark level event.
1 = 	TX FIFO greater than or equal event is forced to 1]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: TX FIFO empty event.
1 = 	TX FIFO empty event is forced to 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: TX FIFO full event.
1 =  TX FIFO full event is forced to 1]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFFEM</name>
    <description><![CDATA[Register: TX_FIFO_FLAGS_EVENT_MASK

The flag event signal is a combination of all flag associated bit fields that is defined for the peripheral. One or more flags can be enabled as event triggers - and may be polled in SW in order to determine the event source. This register defines a mask for which of the flags defined in the TX_FIFO_FLAGS register that are to be enabled as flag event sources.]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OFLOW</name>
    <description><![CDATA[O_FLOW: Enable bit for TX_FIFO_FLAGS<O_FLOW> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>UFLOW</name>
    <description><![CDATA[U_FLOW: Enable bit for TX_FIFO_FLAGS<U_FLOW> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HAS_DATA: Enable bit for TX_FIFO_FLAGS<HAS_DATA> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LE_WM: Enable bit for TX_FIFO_FLAGS<LE_WM> as event signal.

1 = Flag is enabled as an event source.

