zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
0 = Flag is not an event source. ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GE_WM: Enable bit for TX_FIFO_FLAGS<GE_WM> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: Enable bit for TX_FIFO_FLAGS<EMPTY> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: Enable bit for TX_FIFO_FLAGS<FULL> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFS</name>
    <description><![CDATA[Register: TX_FIFO_STATUS

This register reflects the current status of the TX FIFO.]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HAS_DATA: TX FIFO has one or more bytes status.

1 = Number of bytes in TX FIFO is greater than zero (not empty).

0 = Number of bytes in TX FIFO is zero (empty).]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LE_WM: TX FIFO less than or equal to TX FIFO water mark level status.

1 =  Number of bytes in TX FIFO is equal to or less than TX FIFO water mark level.

0 =  Number of bytes in TX FIFO is greater than TX FIFO water mark level.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GE_WM: TX FIFO greater than or equal to TX FIFO water mark level status.

1 =  Number of bytes in TX FIFO is equal to or greater than TX FIFO water mark level.

0 = Number of bytes in TX FIFO is less than TX FIFO water mark level.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: TX FIFO empty status.

1 =  TX FIFO is empty.

0 =  TX FIFO is not empty.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: TX FIFO full status.

1 = TX FIFO is full.

0 = TX FIFO is not full.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFSES</name>
    <description><![CDATA[Register: TX_FIFO_STATUS_EVENT_SEL

This register is used to select one of the status bit fields in the TX_FIFO_STATUS register as source for an event output - typically to be used together with a DMA controller.]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>SEL</name>
    <description><![CDATA[TX FIFO Status source select]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFWM</name>
    <description><![CDATA[Register: TX_FIFO_WM

This register defines the water mark threshold level of the TX FIFO. When a water mark threshold is defined, it may be used in conjunction with the respective water mark related bit fields in both the status register and flag register. An appropriate water mark flag can be enabled as an interrupt source in order for SW to act on the FIFO. Likewise, a suitable water mark status bit field can be selected as a DMA event source in order for the DMA controller to act on the FIFO and offload the MCU.]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>WM</name>
    <description><![CDATA[THRESHOLD:

0b0000 - 0 bytes
0b0001 - 1 byte
0b0010 - 2 bytes
...
0b1110 - 14 bytes
0b1111 - 15 bytes]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFPUSH</name>
    <description><![CDATA[Register: TX_FIFO_PUSH

This register is used to push data into the TX FIFO.]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data to be pushed into TX FIFO. ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFFLUSH</name>
    <description><![CDATA[Register: TX_FIFO_FLUSH

This register is used to flush the contents of the TX FIFO. Related status fields will update accordingly. Related flag fields are not cleared by flushing the FIFO. Some related flag fields may be set due to that the FIFO becomes empty.]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>EXEC</name>
    <description><![CDATA[EXEC: Execute TX FIFO flush command.

1 = TX FIFO is flushed.

0 = TX FIFO is not flushed (untouched).]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFSRP</name>
    <description><![CDATA[Register: TX_FIFO_SNIFF_READ_POINTER

This register returns the TX FIFO read pointer. The FIFO is circular. The read pointer points to the location of the FIFO element which is the next byte that is to be popped/read out of the FIFO.]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>RP</name>
    <description><![CDATA[RP<3:0> Read pointer at FIFO element #

