zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
0b0000 - Read Pointer at FIFO element #0
0b0001 - Read Pointer at FIFO element #1
...
0b1110 - Read Pointer at FIFO element #14
0b1111 - Read Pointer at FIFO element #15]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFSWP</name>
    <description><![CDATA[Register: TX_FIFO_SNIFF_WRITE_POINTER

This register returns the TX FIFO write pointer. The FIFO is circular. The write pointer points to the location in the FIFO where the next element that is to be pushed/written will be stored.]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>WP</name>
    <description><![CDATA[WP<3:0> Write pointer at FIFO element #

0b0000 - Write Pointer at FIFO element #0
0b0001 - Write Pointer at FIFO element #1
...
0b1110 - Write Pointer at FIFO element #14
0b1111 - Write Pointer at FIFO element #15]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFSNB</name>
    <description><![CDATA[Register: TX_FIFO_SNIFF_NUM_BYTES

This register returns the number of bytes that resides inside the FIFO.]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>NB</name>
    <description><![CDATA[NB<4:0> Number of bytes in FIFO

0b00000 - 0 bytes in FIFO
0b00001 - 1 bytes in FIFO
...
0b01110 - 14 bytes in FIFO
0b01111 - 15 bytes in FIFO
0b10000 - 16 bytes in FIFO
0b10001 to 0b11111  - unreachable values]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFF</name>
    <description><![CDATA[Register: RX_FIFO_FLAGS

All flag bits herein are set ('1') by the peripheral when the respective condition is met. Flags are sticky '1' until cleared by software by writing '0' to the respective bit field. Writing '1' to bit fields does not set the respective flag. If software attempts to clear a flag that still is in condition to be set, the peripheral takes precedence and the flag remains set.]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OFLOW</name>
    <description><![CDATA[O_FLOW: RX FIFO overflow flag.

1 =  The RX FIFO has experienced overflow due to that the MCU has attempted to write data into an already full RX FIFO (sticky high until cleared by SW).

0 = The RX FIFO has not experienced overflow since last cleared by SW.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>UFLOW</name>
    <description><![CDATA[U_FLOW: RX FIFO underflow flag.

1 =  The RX FIFO has experienced underflow due to data request from the SPI Slave Core while RX FIFO is empty (sticky high until cleared by SW). Default 'empty' data sent out from the RX FIFO is 0x00.

0 =  The RX FIFO has not experienced underflow since last cleared by SW.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HAS_DATA: RX FIFO has one or more bytes flag.

1 =  Number of bytes in RX FIFO has become greater than zero (not empty) (sticky high until cleared by SW). If SW attempts to clear the flag while the RX FIFO has data (not empty), the flag remains set.

0 =  Number of bytes in RX FIFO has not become greater than zero (i.e. is empty) since last cleared by SW.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LE_WM: RX FIFO less than or equal to RX FIFO water mark level flag.
1 =  Number of bytes in RX FIFO has become equal to or less than RX FIFO water mark level (sticky high until cleared by SW). If SW attempts to clear the flag while number of bytes in RX FIFO is equal to or less than RX FIFO water mark level, the flag remains set.
0 =  Number of bytes in RX FIFO has not become equal to or less than the RX FIFO water mark level since last cleared by SW.
]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GE_WM: RX FIFO greater than or equal to RX FIFO water mark level flag.

1 =  Number of bytes in RX FIFO has become equal to or greater than RX FIFO water mark level (sticky high until cleared by SW). If SW attempts to clear the flag while number of bytes in RX FIFO is equal to or greater than RX FIFO water mark level, the flag remains set.

0 =  Number of bytes in RX FIFO has not become equal to or greater than the RX FIFO water mark level since last cleared by SW.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: RX FIFO empty flag.

1 =  RX FIFO has become empty or is empty (sticky high until cleared by SW). If SW attempts to clear the flag while the RX FIFO is empty, the flag remains set.

0 =  RX FIFO has not become empty since last cleared by SW.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: RX FIFO full flag.

1 =  RX FIFO has become full or is full (sticky high until cleared by SW). If SW attempts to clear the flag while the RX FIFO is full, the flag remains set.

0 =  RX FIFO has not become full since last cleared by SW.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFFD</name>
    <description><![CDATA[Register: RX_FIFO_FLAGS_DEBUG

This register is intended for debug access only. The bit fields are aligned equally as the RX_FIFO_FLAGS register. The bit fields are only settable, and are not readable. A read attempt will only result in 0x00. The main purpose of this register is to use it in combination with respective event signals for interrupt debugging. Neither the FIFO conditions nor the status register are modified due to actions performed on this register.]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OFLOW</name>
    <description><![CDATA[OFLOW: RX FIFO overflow flag.
1 = 	RX FIFO overflow event is forced to 1]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>UFLOW</name>
    <description><![CDATA[UFLOW: RX FIFO underflow flag.
1 = 	RX FIFO underflow event is forced to 1]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HASDATA: RX FIFO has data  flag.
1 = 	RX FIFO has data event is forced to 1]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LEWM: RX FIFO water mark level event.
1 = 	RX FIFO lower than water mark event is forced to 1]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GEWM: RX FIFO GE water mark level event.
1 = 	RX FIFO greater than or equal event is forced to 1]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: RX FIFO empty event.
1 = 	RX FIFO empty event is forced to 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: RX FIFO full event.
1 =  RX FIFO full event is forced to 1]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFFEM</name>
    <description><![CDATA[Register: RX_FIFO_FLAGS_EVENT_MASK

