zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
The flag event signal is a combination of all flag associated bit fields that is defined for the peripheral. One or more flags can be enabled as event triggers - and may be polled in SW in order to determine the event source. This register defines a mask for which of the flags defined in the RX_FIFO_FLAGS register that are to be enabled as flag event sources.]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OFLOW</name>
    <description><![CDATA[O_FLOW: Enable bit for RX_FIFO_FLAGS<O_FLOW> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>UFLOW</name>
    <description><![CDATA[U_FLOW: Enable bit for RX_FIFO_FLAGS<U_FLOW> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HAS_DATA: Enable bit for RX_FIFO_FLAGS<HAS_DATA> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LE_WM: Enable bit for RX_FIFO_FLAGS<LE_WM> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source. ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GE_WM: Enable bit for RX_FIFO_FLAGS<GE_WM> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: Enable bit for RX_FIFO_FLAGS<EMPTY> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: Enable bit for RX_FIFO_FLAGS<FULL> as event signal.

1 = Flag is enabled as an event source.

0 = Flag is not an event source.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFS</name>
    <description><![CDATA[Register: RX_FIFO_STATUS

This register reflects the current status of the RX FIFO.]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>HASDATA</name>
    <description><![CDATA[HAS_DATA: RX FIFO has one or more bytes status.

1 = Number of bytes in RX FIFO is greater than zero (not empty).

0 = Number of bytes in RX FIFO is zero (empty).]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LEWM</name>
    <description><![CDATA[LE_WM: RX FIFO less than or equal to RX FIFO water mark level status.

1 =  Number of bytes in RX FIFO is equal to or less than RX FIFO water mark level.

0 =  Number of bytes in RX FIFO is greater than RX FIFO water mark level.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>GEWM</name>
    <description><![CDATA[GE_WM: RX FIFO greater than or equal to RX FIFO water mark level status.

1 =  Number of bytes in RX FIFO is equal to or greater than RX FIFO water mark level.

0 = Number of bytes in RX FIFO is less than RX FIFO water mark level.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[EMPTY: RX FIFO empty status.

1 =  RX FIFO is empty.

0 =  RX FIFO is not empty.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[FULL: RX FIFO full status.

1 = RX FIFO is full.

0 = RX FIFO is not full.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFSES</name>
    <description><![CDATA[Register: RX_FIFO_STATUS_EVENT_SEL

This register is used to select one of the status bit fields in the RX_FIFO_STATUS register as source for an event output - typically to be used together with a DMA controller.]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>SEL</name>
    <description><![CDATA[RX FIFO Status source select]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFWM</name>
    <description><![CDATA[Register: RX_FIFO_WM

This register defines the water mark threshold level of the RX FIFO. When a water mark threshold is defined, it may be used in conjunction with the respective water mark related bit fields in both the status register and flag register. An appropriate water mark flag can be enabled as an interrupt source in order for SW to act on the FIFO. Likewise, a suitable water mark status bit field can be selected as a DMA event source in order for the DMA controller to act on the FIFO and offload the MCU.]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>WM</name>
    <description><![CDATA[THRESHOLD:

0b0000 - 0 bytes
0b0001 - 1 byte
0b0010 - 2 bytes
...
0b1110 - 14 bytes
0b1111 - 15 bytes]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFPOP</name>
    <description><![CDATA[Register: RX_FIFO_POP

