zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
This register is used to pop data from the RX FIFO. Access to an empty RX FIFO returns a read value of 0x00 - while also causing an underflow condition.]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data popped from RX FIFO. ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFFLUSH</name>
    <description><![CDATA[Register: RX_FIFO_FLUSH

This register is used to flush the contents of the RX FIFO. Related status fields will update accordingly. Related flag fields are not cleared by flushing the FIFO. Some related flag fields may be set due to that the FIFO becomes empty.]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>EXEC</name>
    <description><![CDATA[EXEC: Execute RX FIFO flush command.

1 = RX FIFO is flushed.

0 = RX FIFO is not flushed (untouched).]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFSRP</name>
    <description><![CDATA[Register: RX_FIFO_SNIFF_READ_POINTER

This register returns the RX FIFO read pointer. The FIFO is circular. The read pointer points to the location of the FIFO element which is the next byte that is to be popped/read out of the FIFO.]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>RP</name>
    <description><![CDATA[RP<3:0> Read pointer at FIFO element #

0b0000 - Read Pointer at FIFO element #0
0b0001 - Read Pointer at FIFO element #1
...
0b1110 - Read Pointer at FIFO element #14
0b1111 - Read Pointer at FIFO element #15]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFSWP</name>
    <description><![CDATA[Register: RX_FIFO_SNIFF_WRITE_POINTER

This register returns the RX FIFO write pointer. The FIFO is circular. The write pointer points to the location in the FIFO where the next element that is to be pushed/written will be stored.]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>WP</name>
    <description><![CDATA[WP<3:0> Write pointer at FIFO element #

0b0000 - Write Pointer at FIFO element #0
0b0001 - Write Pointer at FIFO element #1
...
0b1110 - Write Pointer at FIFO element #14
0b1111 - Write Pointer at FIFO element #15]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFSNB</name>
    <description><![CDATA[Register: RX_FIFO_SNIFF_NUM_BYTES

This register returns the number of bytes that resides inside the FIFO.]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>NB</name>
    <description><![CDATA[NB<4:0> Number of bytes in FIFO

0b00000 - 0 bytes in FIFO
0b00001 - 1 bytes in FIFO
...
0b01110 - 14 bytes in FIFO
0b01111 - 15 bytes in FIFO
0b10000 - 16 bytes in FIFO
0b10001 to 0b11111  - unreachable values]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TXFSD</name>
    <description><![CDATA[Register: TX_FIFO_SNIFF_DATA

The contents of the TX FIFO can be read through direct access of the internal memory elements without intervention to the FIFO controller logic. The FIFO works as a ring buffer. There are 16 memory elements, each eight bits wide.]]></description>
    <addressOffset>0x00000400</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>EL</name>
    <description><![CDATA[FIFO element]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RXFSD</name>
    <description><![CDATA[Register: RX_FIFO_SNIFF_DATA

The contents of the RX FIFO can be read through direct access of the internal memory elements without intervention to the FIFO controller logic. The FIFO works as a ring buffer. There are 16 memory elements, each eight bits wide.]]></description>
    <addressOffset>0x00000800</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>EL</name>
    <description><![CDATA[FIFO element]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>FLASH</name>
<description><![CDATA[]]></description>
<baseAddress>0x40030000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00004000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>WAITSTATES</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>WAITSTATES</name>
    <description><![CDATA[Flash reading wait states (USERCODE range). Number of clock cycles to acces flash.Range 1 to 255, Default 3, Setting 0 will behave like minimum = 1]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SAMPLE_PERIOD</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SAMPLE_PERIOD</name>
    <description><![CDATA[Sample and hold timing
Time between sampling. In clock cyclces prescaled by SAMP_PRE. Default 999 (1 ms with prescaler to 1 us)]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PRE_SAMPLE</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PRE_SAMPLE</name>
    <description><![CDATA[Prescaler for SAMPLE_PERIOD.  Default 47 (Prescaler 1 MHz / 1 us )]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SAMHOLD_SA</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SAMHOLD_SA</name>
    <description><![CDATA[Sample and hold timing Time for sampling pulse width. In clockcycles. Default 47 (1 us)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SAMHOLD_SU</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SAMHOLD_SU</name>
    <description><![CDATA[Sample and hold timing
Time for enable setup before sampling pulse. In clockcycles. Default 47 (1 us)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BANK_0_EFUSE</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>BANK_0_EFUSE</name>
    <description><![CDATA[Bank 0 Efuse register. To be written with factory configuration data before flash module can initialize. Default (For first simulation): 00100011010111011010011011000101]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STATUS</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EFUSE_BLANK</name>
    <description><![CDATA[Efuse scanning detected a blank efuse ROM]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>EFUSE_TIMEOUT</name>
    <description><![CDATA[Efuse scanning resulted in timeout error.]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>EFUSE_CRC_ERROR</name>
    <description><![CDATA[Efuse scanning resulted in scan chain CRC error.]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>EFUSE_ERRCODE</name>
    <description><![CDATA[Same as EFUSEERROR.CODE[4:0]]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>SAMHOLD_DIS</name>
    <description><![CDATA[1' when sample and hold are disabled and stable]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[Fast version of the FMC FMSTAT:BUSY bit.
This flag is valid immediately after the operation setting it (FMSTAT is delayed some cycles)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>POWER_MODE</name>
    <description><![CDATA[Actual low power mode.
0 : Low power
1 : Active]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WAIT_SYSCODE</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>WAIT_SYSCODE</name>
    <description><![CDATA[Flash reading wait states (SYSCODE range). Number of clock cycles to acces flash.Range 1 to 255, Default 3, Setting 0 will behave like minimum = 1]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CONFIGURED</name>
    <description><![CDATA[Sticky. Module configured. Disable write access to some configuration registers.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[30:5]</bitRange>
  </field>
  <field>
    <name>DIS_READACCESS</name>
    <description><![CDATA[Disable read access to flash. This bit will disable all read accesses to the flash. The purpose is to block read access from other masters when changing the 48 MHz clock source. Firmware has to disable all CPU accesses to the flash before setting this bit.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ENABLE_SWINTF</name>
    <description><![CDATA[Enable Software Interface read access.  This bit is writeprotected by the 'CONFIGURED' bit.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PROTECTCFG</name>
    <description><![CDATA[Activate CFG read protection. Range defined in PCFGSTART and PCFGEND registers.  This bit is writeprotected by the 'CONFIGURED' bit.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DIS_STANDBY</name>
    <description><![CDATA[Disable standby functionality in read idle state]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DIS_IDLE</name>
    <description><![CDATA[Disable sample and hold functionality in read idle state]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYSCODE_START</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>SYSCODE_START</name>
    <description><![CDATA[Syscode addressing offset. This register will point to the sector number in the flash where syscode starts. The pupose of syscode is to emulate ROM code in a flash version of cc26xx. The ROM code is placed in the flash from the specified sector. Sectorsize is 4 Kbyte.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FLASH_SIZE</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SECTORS</name>
    <description><![CDATA[Flash size. The number of flash sectors in the configured device. Read access to sectors equal to this number or higher will result in an error. The CCFG is the sector (FLASH_SIZE - 1) Writing to this register is disabled by the CONFIG:CONFIGURED bit.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCFGSTART</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADDR</name>
    <description><![CDATA[CFG Read protect.Start address of the protected range. Address is byte address but must be 32 bit aligned.Writing to this register is disabled by the CONFIG:CONFIGURED bit.]]></description>
    <bitRange>[14:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCFGEND</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADDR</name>
    <description><![CDATA[CFG Read protect. Last address of the protected range. Address is byte address but must be 32 bit aligned.Writing to this register is disabled by the CONFIG:CONFIGURED bit.]]></description>
    <bitRange>[14:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWLOCK</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>FWLOCK</name>
    <description><![CDATA[LOCK register for FWFLAG. Writing to FWFLAG requires  FWLOCK = 5]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWFLAG</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED32</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>FWFLAG</name>
    <description><![CDATA[Flags available for Firmware. Writing to FWFLAG requires  FWLOCK = 5]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSE</name>
    <description><![CDATA[The instruction register holds the code that is to be executed by the eFuse controller. The codes for each instruction, along with the description of each instruction, are detailed in the eFuse controller instructions section. Unlike the other registers, the instruction register is written and read from bits [34:30] of the eFuse controller's JTAG/IEEE1500 control register. With the exception of the DumpWord instruction, when the instruction register is written, bits [29:0] of the controller are ignored. The reason for this is to shorten test time by scanning only 10 bits into the controller's JTAG/IEEE1500 control register to initiate an instruction. The DumpWord instruction expects the address to dump as bits [15:0]. Once an instruction code is loaded, the controller immediately executes the instruction. For this reason, all of the other registers that supply data for the instruction should be written before the Instruction register is written. Loading any instruction while the controller is executing a previously loaded instruction causes the controller to interrupt the previous instruction, report an error (depending on the previous instruction), and start executing the newinstruction. This can cause problems, depending on the interrupted instruction, and should be avoided.]]></description>
    <addressOffset>0x00001000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>INSTRUCTION</name>
    <description><![CDATA[Holds the eFuse controller instruction.]]></description>
    <bitRange>[28:24]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>DUMPWORD</name>
    <description><![CDATA[Holds the address to use for the DumpWord instruction. All other
instructions ignore these bits.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEADDR</name>
    <description><![CDATA[The address register is used to select the FuseROM and FuseROM row
to be read or written]]></description>
    <addressOffset>0x00001004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>BLOCK</name>
    <description><![CDATA[FuseROM block select. These five bits select which of the 32 possible FuseROMs is used in the following instruction.]]></description>
    <bitRange>[15:11]</bitRange>
  </field>
  <field>
    <name>ROW</name>
    <description><![CDATA[FuseROMrow address. Given the FuseROMselected by the FuseROM block select, these 11 bits select which row of the FuseROM is used in the following instruction. Since the maximum number of rows for a FuseROM is 64, only bits [5:0] of the FuseROM row address should be used. Address bits [10:6] should be set low ('0').]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATAUPPER</name>
    <description><![CDATA[The data register holds the FuseROM row data selected by the address register.]]></description>
    <addressOffset>0x00001008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SPARE</name>
    <description><![CDATA[Unused range]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>P</name>
    <description><![CDATA[Protect (P). Once this bit is set high (1), the other bits in the row can no longer be programmed or read back. A dumpword instruction will return all zeroes. The actual data of that row will still be loaded into the fuse scan chain during an autoload operation.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>R</name>
    <description><![CDATA[Redundant (R). Once this bit is set high (1), the row is marked as having a failure and is replaced by a redundant row.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EEN</name>
    <description><![CDATA[ECC Enable (EEN). When set high (1), this bit marks the row as a Time N repair row. Data bits [31:26] are used as ECC for data bits [25:0]. The data is read and only 26 bits are sent to the fuse scan chain from the row during autoload]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATALOWER</name>
    <description><![CDATA[ROW 0 has a special description of the bitfields!]]></description>
    <addressOffset>0x0000100C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DATA</name>
    <description><![CDATA[FuseROM row data. These 32 bits are written to or read from the FuseROM. These 32 bits are also the fuse data that is scanned into the fuse scan chain during an autoload operation. The order that the bits are scanned into the chain is bit [0] (LSB) to bit [31] (MSB).]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
