zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>EFUSECONFIG</name>
    <description><![CDATA[OCP standard system configuration register]]></description>
    <addressOffset>0x00001010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED_N</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>RESERVED_12</name>
    <description><![CDATA[]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>RESERVED_9</name>
    <description><![CDATA[]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>IDLEGATING</name>
    <description><![CDATA[Control of clock internal gating while module is idle. There is one bit per clock. The actual register width depends on the number of functional clocks controlled.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_7</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RESERVED_6</name>
    <description><![CDATA[]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RESERVED_5</name>
    <description><![CDATA[]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>SLAVEPOWER</name>
    <description><![CDATA[Slave interface power management control. Idle request/acknowledge control]]></description>
    <bitRange>[4:3]</bitRange>
  </field>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>GATING</name>
    <description><![CDATA[Internal autogating control.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSESTATUS</name>
    <description><![CDATA[System Status]]></description>
    <addressOffset>0x00001014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RESETDONE</name>
    <description><![CDATA[Reset Done, This is the OCP interface reset done. Will be '1' before access to register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ACC</name>
    <description><![CDATA[Several instructions use this register to count various aspects of their execution. The specific value held in this register is explained in the discussion of each instruction.]]></description>
    <addressOffset>0x00001018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>ACCUMULATOR</name>
    <description><![CDATA[hese bits hold data after the execution of various instructions]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BOUNDARY</name>
    <description><![CDATA[The boundary register is used during testing. If the register is enabled, the inputs listed on the register block the input ports and drive the controller's internal circuitry with the value stored in the register. The boundary register can also be used to drive the output signals. The following input signals can be set using the boundary register: EFC_FDI , SYS_WS_READ_STATES , SYS_ECC_OVERRIDE_EN , SYS_DIEID_AUTOLOAD_EN , SYS_REPAIR_EN The following output signals can be set using the boundary register: , EFC_AUTOLOAD_ERROR , EFC_INSTRUCTION_ERROR , EFC_INSTRUCTION_INFO, EFC_SELF_TEST_ERROR ]]></description>
    <addressOffset>0x0000101C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>DISROW0</name>
    <description><![CDATA[Disable read row 0. When high, disables read of row 0 during initial access of FuseROM.]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>SPARE</name>
    <description><![CDATA[]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>EFC_SELF_TEST_ERROR</name>
    <description><![CDATA[Drives the error signal output when the Output enable is set.]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>EFC_INSTRUCTION_INFO</name>
    <description><![CDATA[Drives the error signal output when the Output enable is set.]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>EFC_INSTRUCTION_ERROR</name>
    <description><![CDATA[Drives the error signal output when the Output enable is set.]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>EFC_AUTOLOAD_ERROR</name>
    <description><![CDATA[Drives the error signal output when the Output enable is set.]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>OUTPUTENABLE</name>
    <description><![CDATA[The error output signals are driven by the values of the boundary register if the signal is set high (4'b1111).]]></description>
    <bitRange>[17:14]</bitRange>
  </field>
  <field>
    <name>YS_ECC_SELF_TEST_EN</name>
    <description><![CDATA[Drives the SYS_ECC_SELF_TEST_EN input when the Input enable is set.]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>SYS_ECC_OVERRIDE_EN</name>
    <description><![CDATA[This bit drives the SYS_ECC_OVERRIDE_EN input when Input enable is set.]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>EFC_FDI</name>
    <description><![CDATA[This bit drives the EFC_FDI input when Input enable is set.]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>SYS_DIEID_AUTOLOAD_EN</name>
    <description><![CDATA[This bit drives the SYS_DIEID_AUTOLOAD_EN input when Input enable is set.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>SYS_REPAIR_EN</name>
    <description><![CDATA[This bus sets the SYS_REPAIR_EN inputs when Input enable is set.]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>SYS_WS_READ_STATES</name>
    <description><![CDATA[These bits drive the SYS_WS_READ_STATES inputs when Input enable is set.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>INPUTENABLE</name>
    <description><![CDATA[Input enable. These bit are used to control whether the input ports or the boundary register drives the inputs. If set high (4'b1111), the inputs to the controller are driven by the values of the boundary register. The Self-Test Signals register and Self-Test cycles register are also controlled by these bits.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEFLAG</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00001020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>KEY</name>
    <description><![CDATA[Key flag. If the proper key is loaded into the key code bits, this bit will
read a 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEKEY</name>
    <description><![CDATA[The eFuse controller does not have to be reset during power-up of the system. To protect the FuseROMs from an inadvertent power-up in program mode, the key register must first be set with the hexadecimal value of 96969696h before the program instruction will work.]]></description>
    <addressOffset>0x00001024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CODE</name>
    <description><![CDATA[Key code. These 32 bits are used to set the key (96969696h) for the program instruction.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSERELEASE</name>
    <description><![CDATA[For every release of the FuseFarm controller soft macro, the release register is hard-coded with a date-stamp that identifies when the controllerwas released. TheRTL used to create the FuseFarmcontroller soft macro design can then be determined from this register]]></description>
    <addressOffset>0x00001028</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>ODPYEAR</name>
    <description><![CDATA[Release code indicating year of ODP controller macro release]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>ODPMONTH</name>
    <description><![CDATA[Release code indicating month of ODP controller macro release.]]></description>
    <bitRange>[24:21]</bitRange>
  </field>
  <field>
    <name>ODPDAY</name>
    <description><![CDATA[Release code indicating day of ODP controller macro release.]]></description>
    <bitRange>[20:16]</bitRange>
  </field>
  <field>
    <name>EFUSEYEAR</name>
    <description><![CDATA[Release code indicating year of eFuse controller macro release.]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>EFUSEMONTH</name>
    <description><![CDATA[Release code indicating month of eFuse controller macro release.]]></description>
    <bitRange>[8:5]</bitRange>
  </field>
  <field>
    <name>EFUSEDAY</name>
    <description><![CDATA[Release code indicating day of eFuse controller macro release.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEPINS</name>
    <description><![CDATA[The pins register is used during testing. The pins register can be read at any time and returns the current values of the following ports of the controller. If the boundary register is controlling the inputs to the eFuse controller, the pins register return the input port values, not the values stored in the boundary register.]]></description>
    <addressOffset>0x0000102C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EFC_SELF_TEST_DONE</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>EFC_SELF_TEST_ERROR</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>SYS_ECC_SELF_TEST_EN</name>
    <description><![CDATA[Input pin]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>EFC_INSTRUCTION_INFO</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>EFC_INSTRUCTION_ERROR</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>EFC_AUTOLOAD_ERROR</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>SYS_ECC_OVERRIDE_EN</name>
    <description><![CDATA[Input pin]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>EFC_READY</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>EFC_FCLRZ</name>
    <description><![CDATA[Output pin]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>SYS_DIEID_AUTOLOAD_EN</name>
    <description><![CDATA[Input pin]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SYS_REPAIR_EN</name>
    <description><![CDATA[Input pins]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>SYS_WS_READ_STATES</name>
    <description><![CDATA[Input pin]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSECRA</name>
    <description><![CDATA[This register stores the column repair address (CRA) data bits to be programmed into the addressed FuseROM row's CRA bits.]]></description>
    <addressOffset>0x00001030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[Data bits to be programmed into the CRA bits of the addressed row]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEREAD</name>
    <description><![CDATA[The read register is used to control the ROM clock read pulse width and set the sense amp margin limits.]]></description>
    <addressOffset>0x00001034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>DATABIT</name>
    <description><![CDATA[Read data bit. If the protect (P) bit is set in any row, only P bits are reported during a read, and the other bits are zero. See Table 20 for details on the behavior of the read_data_bit.]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>READCLOCK</name>
    <description><![CDATA[ROM clock read pulse width. Active high. Specifies the number of internal clock cycles that the FuseROM clock (pin FROM_CLK) is high ('1'). These bits override the SYS_WS_READ_STATE[3:0] ports. Values are:
Bit                                   Width
 (4b'0000)           1 * SYS_CLK period
 (4b'0001)           1 * SYS_CLK period
 (4b'0010)           2 * SYS_CLK period
 (4b'0011)           3 * SYS_CLK period
 (4b'0100)           4 * SYS_CLK period
 (4b'0101)          5 * SYS_CLK period
 (4b'0110) - (4b'1111)   Not used
]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>DEBUG</name>
    <description><![CDATA[Used for debug purposes. Keep low for normal operation.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>SPARE</name>
    <description><![CDATA[Unused bit]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>MARGIN</name>
    <description><![CDATA[Combined margin. The bits set the sense amp margin limits according to the following table. The FuseROM Compiler section in the GS60 Customer In-field Programmable FuseROM specification shows more information on combined margin.
Margin(1:0) Trip Point Label Description
00 5K Normal Normal read
01 2K Margin 0 Margin test for unblown fuses. An unblown fuse should have a resistance below the trip point.
10 22K Margin 1A Margin test for blown fuses. Higher compare resistance than normal.
11 60K Margin 1B Margin test for blown fuses. Higher margin resistance than normal or Margin 1A.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEPROGRAM</name>
    <description><![CDATA[When the program instruction is executed, the data register's value is used to determine which bits are blown in the FuseROM row selected by the address register. One sweep of all the FuseROM bits is made: The bits that are low ('0') in the FuseROM are not blown, but high ('1') bits in the data register are blown by the controller. The first attempt at blowing aFuseROMbitmay not be successful, and more than one sweep of the FuseROM row may be needed. If this is the case, the FuseROM row may be swept again. The programregister controls several aspects of the programoperation]]></description>
    <addressOffset>0x00001038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>COMPAREDISABLE</name>
    <description><![CDATA[Compare disable. Before any FuseROM bit is actually blown, the value of the data register is compared to the FuseROM data bits in the row selected by the address register. If the data register is already equal to the FuseROMrowdata, the rowis not blown, and the programinstruction is aborted. Error code 5b 01101 (for more information, see FuseFarm error codes) is placed on EFC_ERROR ports. To avoid this and force the program instruction to continue, set this bit to 1.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>CLOCKSTALL</name>
    <description><![CDATA[16-bit FuseROM clock stall pulse width. Active low. After the controller attempts to program the data register value into the FuseROM row selected by the address register, the FROM_CLK signal is held low ('0') for a specified number of internal clock cycles to separate each pass of the controller. These bits determine the number of clock cycles that the controller pauses between each sweep of the FuseROM row.]]></description>
    <bitRange>[29:14]</bitRange>
  </field>
  <field>
    <name>VPPTOVDD</name>
    <description><![CDATA[Programsignal for FuseROMVPP-to-VDD shorting switch. This bitmust be set high before executing the program instruction and low after program is completed. The eFuse controller output FROM_ENSW is created from this signal. The FROM_ENSW signal is used to disable ('1') and enable ('0') the FuseROM VPP-to-VDD shorting switch during program operation.]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>ITERATIONS</name>
    <description><![CDATA[4-bit maximum write iterations. This register sets the maximum number of sweeps that the program instruction uses to make the FuseROM row equal to the value in the data register. If the eFuse controller sweeps the number of times set in the maximum write iterations bits, an error code (5b'00111 or 5b'01000) is reported ((for more information, see FuseFarm error codes), and the program instruction sets the EFC_READY port high ('1') and JTAG_TDO high ('1') for one clock cycle]]></description>
    <bitRange>[12:9]</bitRange>
  </field>
  <field>
    <name>WRITECLOCK</name>
    <description><![CDATA[9-bit FuseROMclock write pulse width. Active low. These bits determine the width of the write phase (i.e., FROM_CLK = '0') of the FROM_CLK signal. In most instances, the width of the FROM_CLK write phase relative to the internal clock is simply equal to the unsigned decimal equivalent of the binary code. However, when this value is less than or equal to one, the following table should be used:
 Read pulse width Write pulse width FROM_CLK == '0' FROM_CLK == '1'
000 000000000 raw raw
000 000000001 1 1
001 000000000 1 1
001 000000001 1 1
The FROM_CLK signal in Figure 38 shows the write pulse signal for various program register values.]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EFUSEERROR</name>
    <description><![CDATA[Some instructions return an error/status code when completed. This code is the same value that appears on the EFC_ERROR port of the eFuse controller. An error/status code of 00000 means that the instruction completed successfully.]]></description>
    <addressOffset>0x0000103C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>DONE</name>
    <description><![CDATA[Instruction done. Set after each instruction is done. Should be cleared by the interfaces.
Updated by hardware but writable to clear.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>CODE</name>
    <description><![CDATA[Error/Status code. These five bits hold the error or status code that was returned by the instruction that was executed. Updated by hardware but writable to clear.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SINGLEBIT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00001040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FROMN</name>
    <description><![CDATA[Is set if any row in the entire FROM has a single-bit error. For each FROM, one bit is selected. For FuseROM2, bit 1 is set. For FuseROM3, bit 2 is set. Only rows that have the EEN bit set can contribute to this error. If the sys_ecc_override_en bit is set, then any row can contribute to this error.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>FROM0</name>
    <description><![CDATA[Is set if any row that has its EEN bit set from rows 3-N has a single-bit error for FROM 0. If the sys_ecc_override_en bit is set, then all rows from 3-N can contribute to this error.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TWOBIT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00001044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FROMN</name>
    <description><![CDATA[Is set if any row in the entire FROM has a two-bit error. For each FROM, one bit is selected. For FuseROM2, bit 1 is set. For FuseROM3, bit 2 is set. Only rows that have the EEN bit set can contribute to this error. If the sys_ecc_override_en bit is set, then any row can contribute to this error.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>FROM0</name>
    <description><![CDATA[Is set if any row that has its EEN bit set from rows 3-N has a two-bit error for FROM 0. If the sys_ecc_override_en bit is set, then all rows from 3- N can contribute to this error.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SELFTESTCYC</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00001048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CYCLES</name>
    <description><![CDATA[The self-test cycles register can override the value on the port sys_ecc_self_test_cycles. It drives the input upon the setting of bits [3:0] of the boundary register to 4'b1111.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SELFTESTSIGN</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000104C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SIGNATURE</name>
    <description><![CDATA[The self-test signature register can override the value on the port sys_ecc_self_test_signature. It drives the input upon the setting of bit [3:0] of the boundary register to 4'b1111.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
