zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FRDCNTL</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000200</resetValue>
<fields>
  <field>
    <name>FRDCNTL_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>IFLUSH_HOLD</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>FRDCNTL_RESERVED_23_17</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>IDLEN</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>FRDCNTL_RESERVED_15_12</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>RWAIT</name>
    <description><![CDATA[Read Wait State. This field contains the number of wait states in a read access. FCLK_period = HCLK_period X (RWAIT + 1), FSM state machine operations is usually twice this amount. ]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>FRDCNTL_RESERVED_07_05</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>ASWSTEN</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>FRDCNTL_RESERVED_03_01</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>RM</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSPRD</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSPRD_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>ROM_KEY</name>
    <description><![CDATA[ROM configurations only. When configured to talk to ROMs instead of flash memory, these four bits provide an activation key to the ROM test bank. Writing a "1010" to this field will enable the ROM test bank. Any other value will disable this bank. If the ROM_KEY is active then any read in the test ROM range will be considered good and if it is not active all reads to this range will return an abort. The test ROM range is usually bigger than the actual ROM.]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>FSPRD_RESERVED_23_17</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DIS_PREEMPT</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RMBSEM</name>
    <description><![CDATA[Read Margin Bank Select. When either RM1 or RM0 is set the RMBSELx with each bit corresponds to a bank forces the selected bank(s) to be read in the chosen margin mode. The unselected bank(s) will still be read in normal mode. The selected read margin mode will remain in effect on the bank until changed. Because read margin needs several cycles of setup time to take effect the bank must have a couple of dummy reads before it can return the true read margin values.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>FSPRD_RESERVED_07_02</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>RM1</name>
    <description><![CDATA[Read Margin 1. When set enables Read Margin 1 mode]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RM0</name>
    <description><![CDATA[Read Margin 0. When set enables Read Margin 0 mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEDACCTRL1</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEDACCTRL1_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>SUSP_IGNR</name>
    <description><![CDATA[Suspend Ignore. 1=ignore the CPU_EMUSUSP and VBUSP_EMUDBG suspend signals and allows the error bits to set even in suspend mode. It also allows the FMC to un-freeze the error bits and other registers by reading the FUNC_ERR_ADDR register even in with suspend active. 0=FMC blocks all errors from setting the error bits in suspend mode and blocks the un-freezing of the bits and registers by reading the FUNC_ERR_ADDR register. The CPU_EMUSUSP and VBUSP_EMUDBG signals have normal functions. The CPU suspend signal should not be confused with the suspend command in the FSM. ]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>FEDACCTRL1_RESERVED_23_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>EDACMODE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FEDACCTRL1_RESERVED_15_11</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:11]</bitRange>
  </field>
  <field>
    <name>EOFEN</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>EZFEN</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>EPEN</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FEDACCTRL1_RESERVED_07_06</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>EOCV</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>EZCV</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>EDACEN</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEDACCTRL2</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000200C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEDACCTRL2_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SEC_THRESHOLD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCOR_ERR_CNT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCOR_ERR_CNT_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>COR_ERR_CNT</name>
    <description><![CDATA[Not Used in CC26.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCOR_ERR_ADD</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCOR_ERR_ADD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCOR_ERR_POS</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCOR_ERR_POS_RESERVED_31_10</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>B2_ERR</name>
    <description><![CDATA[Not used on CC26. ]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>ECC_ERR</name>
    <description><![CDATA[Not Used in CC26.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>SERR_POS</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEDACSTATUS</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000201C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEDACSTATUS_RESERVED_31_26</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>RVF_INT</name>
    <description><![CDATA[When this bit is one, it indicates that FSM command `read_verify' has found a mismatch and has suspended. The error event and this status bit are enabled by setting the RV_INT_EN bit in the FSM_ST_MACHINE register. This flag must be cleared by writing a one to this bit in order to clear the event generation. ]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>FSM_DONE</name>
    <description><![CDATA[When this bit is one, it indicates that FSM has finished its operation after the FSM_EXECUTE was set. The event and this status bit are enabled by setting the FSM_INT_EN bit in the FSM_ST_MACHINE register. Check the FMSTAT flag register, for any error that might have resulted from this FSM operation. Check the BUSY bit in the FMSTAT register if polling is used instead of interrupts. ]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>COM3_MAL_GOOD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>COM2_MAL_GOOD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>ECC3_MAL_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>ECC2_MAL_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>COMB2_BUS_MAL_GOOD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>ECCB2_MAL_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>B2_UNC_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>B2_COR_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>FEDACSTATUS_RESERVED_15_14</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>B2_ERR_IS_EE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>D_UNC_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>ADD_TAG_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>ADD_PAR_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>BUF_PAR_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>ECC_MUL_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>COM1_MAL_GOOD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>COM0_MAL_GOOD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>ECC1_MAL_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>ECC0_MAL_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>D_COR_ERR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ERR_ONE_FLG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>ERR_ZERO_FLG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ERR_PRF_FLG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FUNC_ERR_ADD</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FUNC_ERR_ADD</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEDACSDIS</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>BANKID1_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS_RESERVED_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>SECTORID1_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>BANKID1</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS_RESERVED_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>SECTORID1</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>BANKID0_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[15:13]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS_RESERVED_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>SECTORID0_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>BANKID0</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS_RESERVED_04</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>SECTORID0</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FPRIM_ADD_TAG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FPRIM_ADD_TAG_RESERVED_31_23</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>PRIM_ADD_TAG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FREDU_ADD_TAG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x0000202C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FREDU_ADD_TAG_RESERVED_31_23</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>REDU_ADD_TAG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBPROT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FBPROT_RESERVED_31_01</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>PROTL1DIS</name>
    <description><![CDATA[Level 1 Protection Disable bit. Setting this bit disables protection from writing to the OTPPROTDIS bits as well as the Sector Enable registers FBSE for all banks. Clearing this bit enables protection and disables write access to the OTPPROTDIS register bits and FBSE register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBSE</name>
    <description><![CDATA[This is a special in that there is a separate BSE internal field for each bank. Accesses to this field will only affect the internal field pointed to by the FMAC register's BANK field. The FMAC must be set to the desired bank before accessing this register. When set, a bit enables the corresponding numbered sector for program or erase access. The FBSE register has both a hardware and software protection. The contents of FBSE register can only be changed when the MMR bus protection signal is active and PROTL1DIS bit is 1. The hardware protection using bus protection achieves higher protection over software ]]></description>
    <addressOffset>0x00002034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FBSE_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>BSE</name>
    <description><![CDATA[The contents of FBSE register enables or disables the corresponding numbered sector for program or erase access. Unimplemented sectors will still show a BSE bit but it will have no effect on the flash logic. The BSE register cannot handle more than 16 sectors in a bank so special provisions apply if the FLEE or FLES memory has more than 16 sectors. For more than 16 sectors, then all 16 BSE bits must be high to do an erase or program of any sector. The sector_erased bits in the FSM_SECTOR1 register and FSM_SECTOR2 register provide additional protection and control of the upper sectors.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBBUSY</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002038</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000FE</resetValue>
<fields>
  <field>
    <name>FBBUSY_RESERVED_31_08</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[This read-only location allows the host system to determine if any flash bank is busy performing an FSM command operation (erase, program, sector validation, etc.) or is busy with a Bus2 operation. It displays the states of the BUSY signals from each bank simultaneously. Each bit corresponds to one flash bank. These bits are read-only. Writes have no effect. Unimplemented banks always show ones.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBAC</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000203C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000F</resetValue>
<fields>
  <field>
    <name>FBAC_RESERVED_31_24</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>OTPPROTDIS_RESEREVED_7_1</name>
    <description><![CDATA[Reserved for addional banks 1 to 7]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>OTPPROTDIS</name>
    <description><![CDATA[OTP Sector Protection Disable. Each bit corresponds to an flash bank. When this bit is set, it enables programming and erasing of the OTP sector. This bit can be set only when PROTL1DIS = 1 and the MMR bus protection is active. ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>BAGP</name>
    <description><![CDATA[These bits contain the starting count value for the BAGP down counter. Any access to a given bank causes its BAGP counter to reload the common BAGP value into the individual bank counter for that bank. After the last access to this flash bank, the down counter delays from 0 to 255 prescaled HCLK clock cycles before putting the bank into one of the fallback power modes as determined by BNKPWR in this register. This value must be greater than 1 when the fallback mode is not ACTIVE. Note: The prescaled clock used for the BAGP down counter is a clock divided by 16 from input HCLK. ]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>VREADS</name>
    <description><![CDATA[These bits contain the starting count value for the VREAD to CPWRDNZ setup time counter. When Pump module is in active power state at which time the VREAD power supply becomes stable, the VREADST down counter delays from 0 to VREADST HCLK clock cycles before starting the bank power up sequencing. Reset value depends on given clock speed.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
