zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FBFALLBACK</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002040</addressOffset>
    <access>read-write</access>
    <resetValue>0x0505FFFF</resetValue>
<fields>
  <field>
    <name>FBAC_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>FSM_PWRSAV</name>
    <description><![CDATA[When this register is not "1010" the FMC uses power saving logic in many of the Finite State Machine (FSM) logic registers. If the register is "1010" then this power saving feature is turned off. This register also controls the following internal clocks:  clk_all_late, clk_fsm, clk_fsmv, clk_read, clk_read_mmr, clk_read_early.]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>FBAC_RESERVED_23_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>REG_PWRSAV</name>
    <description><![CDATA[When this register is not "1010" the FMC uses power saving logic in many of the Register control registers. If the register is "1010" then this power saving feature is turned off. This register control the following clocks: clk_all, clk_bus2, clk_vbus_late, clk_vbus_ctl, clk_test, clk_edac.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>BANKPWR7</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>BANKPWR6</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>BANKPWR5</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>BANKPWR4</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>BANKPWR3</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>BANKPWR2</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>BANKPWR1</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>BANKPWR0</name>
    <description><![CDATA[Bank power mode. 00= sleep (Sense amplifiers and sense reference disabled), 01= deep standby (Sense amplifiers disabled, but sense reference enabled), 10=reserved (same as active now), 11=active (Both sense amplifiers and sense reference enabled). It is recommended that the power mode for a bank only be changed while that bank is in the active mode. ]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBPRDY</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00FF00FE</resetValue>
<fields>
  <field>
    <name>FBPRDY_RESERVED_31_24</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>BANKBUSY_RESERVED_7_1</name>
    <description><![CDATA[Reserved for additonal banks 1 to 7]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>BANKBUSY</name>
    <description><![CDATA[Bank Busy with FSM, SW_INTF This register will indicate which banks are currently busy with a FSM, or Software_interface operation. It will also read a one if the bank is not ready.  ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>PUMPRDY</name>
    <description><![CDATA[When set, it means that the charge pump is in active power state. If an access is made to a bank which is not ready then wait states is asserted until it becomes ready.]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>FBPRDY_RESERVED_14_08</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>BANKRDY_RESERVED_7_1</name>
    <description><![CDATA[Reserved for additonal banks 1 to 7]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>BANKRDY</name>
    <description><![CDATA[This is a read-only register which allows software to determine if the corresponding bank is ready for flash access before the access is attempted. When a corresponding bit is set, it means that the bank is in active power state. User should wait for both the pump and the targeted bank to be ready before attempting an access. When the banks enter the low power modes, sleep modes or standby modes then the bank ready signal for that bank or pump will go low as some as it exits the active state.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBAC1</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002048</addressOffset>
    <access>read-write</access>
    <resetValue>0x02080001</resetValue>
<fields>
  <field>
    <name>FBAC1_RESERVED_31_27</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>PSLEEPTDIS</name>
    <description><![CDATA[Reset value depends on clock speed. These bits determine the time the FMC waits for the pump voltages to become valid after the PWRDNZ goes high when waking up from sleep. The reset value of this field is determined by the PUMP_CONSTANT keyword in the input configuration file. The pump requires 20 us for this time. PSLEEP  = PSLEEP_REQ_ns / 2 / HCLK_period_ns  520 = 20,000 / 2 / 19.23    when HCLK= 52 MHz. This value is also used as the pump RESETZ minimum hold time. The pump must remain with RESETZ low for at least the on-half the PSLEEP time before the RESETZ can go high again. ]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FBAC1_RESERVED_15_01</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:1]</bitRange>
  </field>
  <field>
    <name>PUMPPWR</name>
    <description><![CDATA[This bit selects what power mode the charge pump enters after the pump active grace period (PAGP) counter has timed out. 0=pump_sleep, 1= pump_active. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBAC2</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000204C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FBAC2_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAGP</name>
    <description><![CDATA[Contains the starting count value for the PAGP mode down counter. Any access to flash memory causes the counter to reload with the PAGP value. After the last bank has gone to sleep, the down counter delays this number of prescaled HCLK clock cycles before entering one of the charge pump fallback power modes as determined by PUMPPWR in the PAC1 register. The PAGP uses a divided by 16 of HCLK.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FMAC</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FMAC_RESERVED_31_03</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>BANK</name>
    <description><![CDATA[These bits select which bank is enabled for operations using the FSM or Software_interface and some registers (FBSE, FSM_SECTOR). The bank field must match the bank pointed to by the FADDR register during FSM operation or an error will result.
Only exising bank numbers are accepted.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FMSTAT</name>
    <description><![CDATA[Use the clear_status or clear_more FSM command to clear bits in this register. This should be done be issuing any new FSM commands.]]></description>
    <addressOffset>0x00002054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FMSTAT_RESERVED_31_18</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>RVSUSP</name>
    <description><![CDATA[Read Verify Suspend. When set, this bit indicates that the flash module has received and processed a suspend command during a read-verify operation. This bit remains set until the read-verify-resume command has been issued or the Clear_More command is run. ]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>RDVER</name>
    <description><![CDATA[Read verify command currently underway. When set, this bit indicates that the flash module is actively performing a read-verify operation. This bit is set when read-verify starts and is cleared when it is complete. It is also cleared when the read-verify is suspended and set when the read-verify resumes. ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RVF</name>
    <description><![CDATA[Read Verify Failure When set, indicates that a read verify mismatch is detected using the Read Verify command. This bit remains set until clear_status or clear_more FSM commands are run. ]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>ILA</name>
    <description><![CDATA[illegal Address. When set, indicates that an illegal address is detected. These conditions can set illegal address flag. 1=Writing to a hole (un-implemented logical address space) within a flash bank. 2=Writing to an address location to an un-implemented flash space. 3=Input address for write is decoded to select a different bank from the bank ID register FMAC register. 4=The address range does not match the type of FSM command. For example, the erase_sector and erase_OTP commands must match the address regions. 5=TI-OTP address selected but CMD_EN in FSM_ST_MACHINE is not set. ]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>DBF</name>
    <description><![CDATA[This bit sets during a Program Sector command when the FSM first reads an address and it is not all ones. Controlled by DIS_TST_EN of the FSM_ST_MACHINE register.]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>PGV</name>
    <description><![CDATA[Program verify. When set, indicates that a word is not successfully programmed after the maximum allowed number of program pulses are given for program operation.]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>PCV</name>
    <description><![CDATA[Precondition verify. When set, indicates that a sector is not successfully preconditioned (pre-erased) after the maximum allowed number of program pulses are given for precondition operation for any applied command such as Erase Sector command. During Precondition verify command, this flag is set immediately if a flash bit is found to be 1.f Precondition Terminate Enable bit is cleared then PCV is not set when preconditioning fails. Setting Precondition Terminate Enable bit allows FSM to terminate the command immediately if precondition operation fails during any type of erase commands. ]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>EV</name>
    <description><![CDATA[Erase verify. When set, indicates that a sector is not successfully erased after the maximum allowed number of erase pulses are given for erase operation. During Erase verify command, this flag is set immediately if a bit is found to be 0.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CV</name>
    <description><![CDATA[Compact Verify. When set, indicates that a sector contains one or more bits in depletion after an erase operation with CMPV_ALLOWED set. During compact verify command, this flag is set immediately if a bit is found to be 1]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[When set, this bit indicates that a program, erase, or suspend operation is being processed.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>ERS</name>
    <description><![CDATA[Erase Active. When set, this bit indicates that the flash module is actively performing an erase operation. This bit is set when erasing starts and is cleared when erasing is complete. It is also cleared when the erase is suspended and set when the erase resumes.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>PGM</name>
    <description><![CDATA[Program Active. When set, this bit indicates that the flash module is currently performing a program operation. This bit is set when programming starts and is cleared when programming is complete. It is also cleared when programming is suspended and set when programming is resumes.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>INVDAT</name>
    <description><![CDATA[Invalid Data. When set, this bit indicates that the user attempted to program a "1" where a "0" was already present.   This bit is cleared by the Clear Status command.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>CSTAT</name>
    <description><![CDATA[Command Status. Once the FSM starts any failure will set this bit. When set, this bit informs the host that the program, erase, or validate sector command failed and the command was stopped. This bit is cleared by the Clear Status command. For some errors, this will be the only indication of an FSM error because the cause does not fall within the other error bit types.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>VOLSTAT</name>
    <description><![CDATA[Core Voltage Status. When set, this bit indicates that the core voltage generator of the pump power supply dipped below the lower limit allowable during a program or erase operation. This bit is cleared by the Clear Status command.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ESUSP</name>
    <description><![CDATA[Erase Suspend. When set, this bit indicates that the flash module has received and processed an erase suspend operation. This bit remains set until the erase resume command has been issued or until the Clear_More command is run]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PSUSP</name>
    <description><![CDATA[Program Suspend. When set, this bit indicates that the flash module has received and processed a program suspend operation. This bit remains set until the program resume command has been issued or until the Clear_More command is run.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SLOCK</name>
    <description><![CDATA[Sector Lock Status. When set, this bit indicates that the operation was halted because the target sector was locked for erasing and programming either by the sector protect bit or by OTP write protection disable bits. (Bits BSE in FBSE register or OTPPROTDIS in register FBAC). This bit is cleared by the Clear Status command. No SLOCK FSM error will occur if all sectors in a bank erase operation are set to 1. All the sectors will be checked but no SLOCK will be set if no operation occurs due to the SECT_ERASED bits being set to all ones. A SLOCK error will occur if attempting to do a sector erase with either BSE is cleared or SECT_ERASED is set ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEMU_DMSW</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEMU_DMSW</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEMU_DLSW</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000205C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEMU_DLSW</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEMU_ECC</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEMU_ECC_RESERVED_31_08</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>EMU_ECC</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FLOCK</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002064</addressOffset>
    <access>read-write</access>
    <resetValue>0x000055AA</resetValue>
<fields>
  <field>
    <name>FLOCK_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ENCOM</name>
    <description><![CDATA[If the user writes 0xAA55 to this register, it enables Software Interface and connects the "Command" register bits to the respective bank and pump signals. The user can now manipulate the pump and bank signals directly via software to the selected bank. Writing any value other than 0xAA55 will disable Software Interface and prevent the "Command" registers from having any effect on the bank and pump signals. The CPU can only write to registers location 08xh, and 100h-10Ch when this register is AA55h. These contain the voltage control registers and the bank control signals. No ECC checking is enabled in software interface mode for the bank selected in the FMAC register. If the device does the ECC in the CPU then the FMC will calculate the ECC from the data and output it to the CPU. This effectively disables the ECC stored in the flash bank. Writing 0xAA55 to this register will prevent the bank pointed to by the FMAC BANK field from being accessed normally. All CPU access to the selected bank will use the FADDR register as the base address and not the CPU address. This is part of the Software Interface and PMT mode operation. The value AAAA will allow writes to the voltage registers and to the SWINTF registers without entering the software interface mode. This allows easier setup of the registers.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEMU_ADDR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEMU_ADDR_RESERVED_31_22</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>EMU_ADDR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[21:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FDIAGCTRL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x0000206C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FDIAGCTRL_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DIAG_TRIG</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>FDIAGCTRL_RESERVED_23_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>DIAG_EN_KEY</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FDIAGCTRL_RESERVED_15</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>DIAG_ECC_SEL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[14:12]</bitRange>
  </field>
  <field>
    <name>FDIAGCTRL_RESERVED_11_10</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>DIAG_BUF_SEL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>FDIAGCTRL_RESERVED_07_03</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>DIAGMODE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FRAW_DATAH</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FRAW_DATAH</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FRAW_DATAL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FRAW_DATAL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FRAW_ECC</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FRAW_ECC_RESERVED_31_08</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RAW_ECC</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FPAR_OVR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x0000207C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FPAR_OVR_RESERVED_31_17</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>BNK_INV_PAR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>BUS_PAR_DIS</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>PAR_OVR_KEY</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>ADD_INV_PAR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>DAT_INV_PAR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
