zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FVREADCT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000008</resetValue>
<fields>
  <field>
    <name>FVREADCT_RESERVED_31_04</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>VREADCT</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of wordline power supply for read mode.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FVHVCT1</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00840088</resetValue>
<fields>
  <field>
    <name>FVHVCT1_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>TRIM13_E</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high voltage supply input during erase operation.]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>VHVCT_E</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high voltage supply input during erase operation.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FVHVCT1_RESERVED_15_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>TRIM13_PV</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high voltage supply input during program verify operation.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>VHVCT_PV</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high voltage supply input during program verify operation.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FVHVCT2</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00A20000</resetValue>
<fields>
  <field>
    <name>FVHVCT2_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>TRIM13_P</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high voltage supply input during program operation.]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>VHVCT_P</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high voltage supply input during program operation.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FVHVCT2_RESERVED_15_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FVHVCT3</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000208C</addressOffset>
    <access>read-write</access>
    <resetValue>0x000F0000</resetValue>
<fields>
  <field>
    <name>FVHVCT3_RESERVED_31_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>WCT</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FVHVCT3_RESERVED_15_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>VHVCT_READ</name>
    <description><![CDATA[These bits control the voltage level for the specified pump voltage of high voltage supply input during TCR mode read operation.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FVNVCT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000800</resetValue>
<fields>
  <field>
    <name>FVNVCT_RESERVED_31_13</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>VCG2P5CT</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the VCG 2.5 CT pump voltage. ]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>FVNVCT_RESERVED_07_05</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>VIN_CT</name>
    <description><![CDATA[These bits control the voltage level for the specified pump VINCT voltage. ]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FVSLP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002094</addressOffset>
    <access>read-write</access>
    <resetValue>0x00007000</resetValue>
<fields>
  <field>
    <name>FVLSP_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VSL_P</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of high current power input during program operation.]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>FVLSP_RESERVED_11_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FVWLCT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002098</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000008</resetValue>
<fields>
  <field>
    <name>FVWLCT_RESERVED_31_05</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>VWLCT_P</name>
    <description><![CDATA[[Configured by boot firmware]
These bits control the voltage level for the specified pump voltage of wordline power supply during programming operations. ]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEFUSECTRL</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000209C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0701010A</resetValue>
<fields>
  <field>
    <name>FEFUSECTRL_RESERVED_31_27</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>CHAIN_SEL</name>
    <description><![CDATA[These bits are used by the flash banks to control which scan chain is used. Scan chain zero is by default the EFUSE scan chain. Consult the bank or pump specification for more detail. Keep CHAIN_SEL at 7 when not being used to de-select the scan operation. Chains_sel to the banks are 7 when EFUSE_EN is not 5.]]></description>
    <bitRange>[26:24]</bitRange>
  </field>
  <field>
    <name>FEFUSECTRL_RESERVED_23_18</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:18]</bitRange>
  </field>
  <field>
    <name>WRITE_EN</name>
    <description><![CDATA[If this bit is zero then the EFUSE controller only reads the selected bank and chain. The FDO shift output is looped around to both the FDI shift input and to the EFUSE_DATA register. Writing to byte 0 of the EFUSEDATA register will start the read shifting but the EFUSEDATA will not be shifted into the BANK nor PUMP. Also the EF_CLRZ function is blocked when the WRITE_EN is 0. If the WRITE_EN is one then the EFUSEDATA will be shifted into the BANK or PUMP and the current BANK or PUMP data is shifted into the EFUSEDATA register at the same time. The EF_CLRZ also works when the WRITE_EN is 1.]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>BP_SEL</name>
    <description><![CDATA[If zero then the pumps are select and if one the FMAC register determines which bank is selected. BP_SEL is only looked at by the logic if CHAIN_SEL is zero. Banks are selected regardless of BP_SEL if CHAIN_SEL is not zero.]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>FEFUSECTRL_RESERVED_15_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>EF_CLRZ</name>
    <description><![CDATA[This value is driven on the bank selected by the FMAC register immediately. Change the FMAC register to every bank to clear the EFUSE data from every bank. Change the BPSEL to clear the pump values 0=Drive 0 on the FCLRZ signal(clear) ; 1=Drive 1 on the FCLRZ signal (not cleared)]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FEFUSECTRL_RESERVED_07_05</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>EF_TEST</name>
    <description><![CDATA[Efuse Test. This pin may or may not be connected to the flash bank. This value is driven immediately on the all banks and pumps. ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>EFUSE_EN</name>
    <description><![CDATA[Efuse Soft test enable. 0101=Soft test is enabled. When enabled, the wrapper will steer the multiplex to select flash wrapper as the efuse controller for controlling FCLK, FCLRZ, TEST, FDI and FDO. Soft test is disabled for any other value. The pump or bank must be in low power sleep mode before scanning. For the pump this usually means running out of RAM.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEFUSESTAT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x000020A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEFUSE_RESERVED_31_01</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SHIFT_DONE</name>
    <description><![CDATA[When set it means the data in FEFUSEDATA register has been scanned out. CPU can either write 1 to clear this bit or write anything to byte 0 of the FEFUSEDATA register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEFUSEDATA</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x000020A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FEFUSEDATA</name>
    <description><![CDATA[This register is a shift register. If Efuse Soft test is enabled with proper key written to EFUSEEN then EFUSEDATA acts as a shift register. When byte zero is written, the shift will start. If Efuse Soft test is not enabled then writing to this register will only store the data into the register. No shift operation will happen. Data is shifted out LSB first. The pump or bank must be in low power sleep mode before scanning. For the pump this usually means running out of RAM.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSEQPMP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x000020A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x85080000</resetValue>
<fields>
  <field>
    <name>TRIM_13</name>
    <description><![CDATA[This register goes directly to the pump's TRIM_13 port pins when VIN_BY_PASS is 1.]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>TRIM_3P4</name>
    <description><![CDATA[This register goes directly to the pump's TRIM_3P4 port pins when VIN_BY_PASS is 1.]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>FSEQPMP_RESERVED23_22</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[23:22]</bitRange>
  </field>
  <field>
    <name>TRIM_1P7</name>
    <description><![CDATA[This register goes directly to the pump's TRIM_1P7 port pins when VIN_BY_PASS is 1.]]></description>
    <bitRange>[21:20]</bitRange>
  </field>
  <field>
    <name>TRIM_0P8</name>
    <description><![CDATA[This register goes directly to the pump's TRIM_0P8 port pins when VIN_BY_PASS is 1.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FSEQPMP_RESERVED15</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>VIN_AT_X</name>
    <description><![CDATA[This register goes to the pump's VIN_AT_XPX port pins with the following encoding; if VIN_BYPASS=0 then VIN_AT_xxx is equal to VIN_AT_XIN input port. If VIN_BYPASS=1 and VIN_AT_X=0 then all VIN_AT_XXX signals are 0.
VIN_AT_X=1 then VIN_AT_1P7 is set. VIN_AT_X=2 then VIN_AT_2P1 is also set. VIN_AT_X=3 then VIN_AT_2P4 is also set. VIN_AT_X=4-7 then VIN_AT_3P0 is also set (all VIN_AT_XXX signals are 1). ]]></description>
    <bitRange>[14:12]</bitRange>
  </field>
  <field>
    <name>FSEQPMP_RESERVED11_9</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>VIN_BY_PASS</name>
    <description><![CDATA[When this bit is a zero the VIN_AT_XPX port comes from the FMC input port VIN_AT_XIN. When this bit is a one the VIN_AT_XPX port comes from the VIN_AT_X bits in 14:12.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>SEQ_PUMP</name>
    <description><![CDATA[This register is used to sequence the voltages in the pump. The values and operation of this register is TBD for now.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCLKTRIM</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x000020AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCLKTRIM_RESERVED_31_19</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>IFRF_TRIM</name>
    <description><![CDATA[This value is used to trim the 15 ma current register in the pump. Register bit 17 (IREF_TRIM bit 4) is inverted from its true value. A register value of 0 gives an IREF_TRIM of 10h. ]]></description>
    <bitRange>[18:13]</bitRange>
  </field>
  <field>
    <name>OSC_TRIM</name>
    <description><![CDATA[Pump Clock Oscillator trimming. This value is used to trim the pump oscillator clock. This pump clock provides a constant frequency independent of the HCLK or FLCLK clocks and can be used to time some of the FSM delay times if the FMS_GLBCTRL bit 0 is register set to 1. Register bit 12 (OSC_TRIM bit 5) is inverted from its true value. A register value of 0 gives an OSC_TRIM of 20h. ]]></description>
    <bitRange>[12:7]</bitRange>
  </field>
  <field>
    <name>BANDGAP_TRIM</name>
    <description><![CDATA[This value is used to trim the VBGTRIM register. Bit 5 (VBGTRIM bit 4) is inverted from its true value. Register value 0 gives a VBGTRIM value of 10h. ]]></description>
    <bitRange>[6:1]</bitRange>
  </field>
  <field>
    <name>TRIM_EN</name>
    <description><![CDATA[If this value is one then the pump will take the OSC_TRIM, BANDGAP_TRIM and IREF_TRIM values instead of the EFUSE register's values stored in the pump. If it is zero then the pump uses the pump's EFUSE register values. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ROM_TEST</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x000020B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ROM_TEST</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ROM_TEST_RESERVED_07_04</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>ROM_KEY</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FEDACSDIS2</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x000020C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>BANKID3_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS2_RESERVED_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>SECTORID3_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>BANKID3</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS2_RESERVED_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>SECTORID3</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>BANKID2_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[15:13]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS2_RESERVED_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>SECTORID2_INVERSE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>BANKID2</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>FEDACSDIS2_RESERVED_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>SECTORID2</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBSTROBES</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000104</resetValue>
<fields>
  <field>
    <name>FBSTROBES_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>ECBIT</name>
    <description><![CDATA[Used for reading ECC bits in Software interface mode. In CC26 this function is TBD.]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>FBSTROBES_RESERVED_23_18</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:19]</bitRange>
  </field>
  <field>
    <name>RWAIT2_FCLK</name>
    <description><![CDATA[If this bit is one then the FLCLK uses wait states.
FLCLK period  = 2 * (RWAIT + 1) ]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>RWAIT_FCLK</name>
    <description><![CDATA[If this bit is one then the FLCLK uses wait states.
FLCLK period  = (RWAIT + 1) ]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>FCLKEN</name>
    <description><![CDATA[Flash Clock Enable. When set, the flash clock is generated and driven to flash bank. When clear, the flash clock is inactively low. Flash clock is used to synchronize flash bank inputs, control the flash bank internal state machine and generate internal timing.]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>FBSTROBES_RESERVED_15_9</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>CTRLENZ</name>
    <description><![CDATA[Control Enable, active low, enables all special operations. Reading from the main flash arrays is the only non-special operation. When low, MODE[2:0], OTP, CUST_OTP, NOROWRED, and PRECOL, are gated in the bank allowing all modes of operation. When inactive, the bank is in standard READ mode, regardless of the listed signal's states. When active, and all above signals are inactive then the bank is also in standard read mode.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FBSTROBES_RESERVED_07</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>NOCOLRED</name>
    <description><![CDATA[Active high, disables addressing of redundant stick (for pre-erase programming of redundant columns).]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>PRECOL</name>
    <description><![CDATA[Active high, enables addressing of redundant stick (for pre-erase programming of redundant columns).]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TI_OTP</name>
    <description><![CDATA[When TI_OTP is active high, access allowed to the customer OTP section. This section is also called the TI Engineering sector. The TEST_EN bit must also be set to program or erase this area.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>OTP</name>
    <description><![CDATA[When OTP is active high, access allowed to the Customer OTP sector. ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TEZ</name>
    <description><![CDATA[Test Enable, active low, enables TESTBANK input/output for a bank, gates TCR inputs (in the banks only, not in the pump module). When inactive, no special test modes are enabled in the bank, regardless of the states of the TCR inputs. When active, all standard operations are allowed.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>FBSTROBES_RESERVED_01_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
