zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FPSTROBES</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000103</resetValue>
<fields>
  <field>
    <name>FPSTROBES_RESERVED_31_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>EXECUTEZ</name>
    <description><![CDATA[Active low. Used to gate pump outputs during program, erase, etc. Signal for pump module only.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FBSTROBES_RESERVED_07_02</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>V3PWRDNZ</name>
    <description><![CDATA[Active low forces the 3V pump module to power-down mode. When TESTEN bit of FTCTRL register is set, the 3VPWRDNZ bit can be used to directly control 3VPWRDNZ signal going into the 3V pump module. If TESTEN bit is clear then 3VPWRDNZ signal is directly controlled by the power control logic.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>V5PWRDNZ</name>
    <description><![CDATA[Active low forces the 5V pump module to power-down mode. When TESTEN bit of FTCTRL register is set, the 5VPWRDNZ bit can be used to directly control 5VPWRDNZ signal going into the 5V pump module. If TESTEN bit is clear then 5VPWRDNZ signal is directly controlled by the power control logic.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBMODE</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FBMODE_RESERVED_31_03</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>MODE</name>
    <description><![CDATA[This field is sent to the bank and pump when the software interface FLOCK register is AA55 (enabled). This field is also used during PMT modes. Also see the bank and pump specifications. The MODE should be set to zero and then wait for about 55 flash clock cycles before exiting the software interface mode in order to allow the banks to fully switch back to the flash read mode. The MODE must be changed according to bank and pump specifications.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FTCR</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000210C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FTCR_RESERVED_31_07</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>TCR</name>
    <description><![CDATA[Test Control Register mode for Banks and Pumps. This field is sent to the bank and pump when the software interface FLOCK register is AA55 (enabled). This allows the Flash memory to execute test modes. This field is also used during PMT modes. See page 302. Only Bank_Erase, Read_margin_0 and Read_margin_1 should be used by the customer. All other TCR modes are reserved for Texas Instruments use only. This field is also used by the FSM when it is not doing a bank erase.]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FADDR</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FADDR</name>
    <description><![CDATA[For software interface modes, this register contains the address relative to the first address in the selected bank to be programmed, erased or verified. This is the relative mode. For FSM mode, this register contains the absolute address of the data that the CPU would use to access the location. This is the absolute mode. For relative modes, the base address bits and the bank select bits are not stored; only the address bits common to all the banks are stored in this register. Therefore, the correct bank ID must be specified before write operation occurs. For FSM operations this register can contain the OTP or Customer OTP addresses. The ECC regions at 0xF01x_xxxx or 0xF02x_xxxx are illegal regions because the ECC programs must be done using the address of the data and the FWPWRITE_ECC register. Normally during software interface verify access modes, the host CPU can just read from a flash memory location directly by giving an address to flash module after all the flash bank timing requirements are met. To prevent a flash bank row address from being changed while EXECUTEZ is active the flash wrapper will only take BUS1 HADDR[7:0] as the column address and keep ADDR[22:8] in FADDR register for row address. Writing to the FADDR will set the FWPWRITEx register and clear its byte enables. The byte enables are used by the FSM to program only those bytes that are recently written.
It is not required to have a cycle between writing to the FADDR and writing to the FWPWRITEx registers. (The FMC requirement is handle by the MMR hardware).]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FPMT_CTRL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FPMT_CTRL_RESERVED_31_21</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:21]</bitRange>
  </field>
  <field>
    <name>SW_MODE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>WDAT_CHANGE</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[19:18]</bitRange>
  </field>
  <field>
    <name>TP_DATA_SEL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>FL_DATAIN_SEL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>TP_BUSY_SEL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[13:11]</bitRange>
  </field>
  <field>
    <name>ADDR_INCR</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PBIST_CTRL</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <addressOffset>0x00002118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PBIST_CTRL_RESERVED_31_05</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>GRP1_EN</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>PBIST_KEY</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FTCTRL</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000211C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FTCTRL_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>AUTOCALC_EN</name>
    <description><![CDATA[Not Used in CC26]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>FTCTRL_RESERVED_23_17</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>WDATA_BLK_CLR</name>
    <description><![CDATA[Block clearing of FWPWRITE register. Usually, The flash write data register FWPWRITEx is set at the end of an FSM operation or when the FADDR register is written. Setting this bit to a 1 will block the FWPWRITEx register from setting under these two conditions. The FWPWRITEx byte write enables are also blocked from clearing in the same manner. This bit is writable for any FLOCK register value.]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>FTCTRL_RESERVED_15_02</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:2]</bitRange>
  </field>
  <field>
    <name>TEST_EN</name>
    <description><![CDATA[Enable Test commands. Programming and erasing to TI OTP sectors in the software interface mode can only occur when this bit is a one. This bit is writable only when the FLOCK register (064h) is AA55 ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FTCTRL_RESERVED_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE0</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002120</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE0</name>
    <description><![CDATA[This register contains the data to write the flash memory. Each write will set data bits and another internal byte enable bit for each byte that enables that byte to be written by the FSM. The FWPWRITE register is get set to all ones after writing to the FADDR register or when the FSM completes an operation. The internal byte enables will also get cleared. The FSM completing an operation will not affect this register if the checkerboard or random bits are set in the FSM_ST_MACHINE register but writing to the FADDR register will still set it. Checkerboard mode uses 27Ch-1 (INVERT) and Random mode uses 27Ch-19. The WDAT_BLK_CLR bit (11C-16)above will also prevent the clearing of this register. During the Random mode of operation, this register will change values to match the data desired in the Flash bank. These modes are activated by the FSM_ST_MACHINE register. This mode are mainly used for program_sector and read_verify. This register will not change during FSM checkerboard pattern operations. For 128-144 bit devices, only FWPWRITE0-3 are used in bank operations. FWPWRITE4-7 are unused for most bank operations. For FLEE and FLES 64 bit memories, use only FWPWRITE0-1 for bank operations. FADDR will select which word to use. Unused bits can be written and read but they will not be part of the bank operations. Unused bits are mainly used to process the 288 bit seed during the Random LFSR modes. Note: Do not write to this register while a FSM operation is active. Do not write to this register in software interface mode while doing a program operation or any other operation that would violate bank timing requirements.      ]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE1</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002124</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE1</name>
    <description><![CDATA[Same as FWPWRITE0]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE2</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <addressOffset>0x00002128</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE2</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE3</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <addressOffset>0x0000212C</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE3</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE4</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <addressOffset>0x00002130</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE4</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE5</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <addressOffset>0x00002134</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE5</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE6</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <addressOffset>0x00002138</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE6</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE7</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <addressOffset>0x0000213C</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FWPWRITE7</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FWPWRITE_ECC</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002140</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>ECCBYTES07_00</name>
    <description><![CDATA[This register contains the error bits for the FWPWRITE7:0 registers. The location of the error bits corresponding to the data depends on the device configuration. The five currently supported configurations are shown above. Unused bits can be written and read but they will not be part of the bank operations. Unused bits are mainly used to process the 288 bit seed during the Random LFSR modes. This register is an extension of the FWPWRITE register and it will also change during the Random mode. Do not write to this register while a FSM or Software_interface operation is active. This register is set to all ones just like the FWPWRITEx registers.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>ECCBYTES15_08</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>ECCBYTES23_16</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>ECCBYTES31_24</name>
    <description><![CDATA[Not Useful in CC26]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSWSTAT</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002144</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>FSWSTAT_RESERVED_31_01</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SAFELV</name>
    <description><![CDATA[This is a low voltage signal replica of the high voltage SAFE signal from the pump module. When high, it indicates that the pump has discharged high voltage power supply for a given MODE of operation after the EXECUTEZ is de-asserted and it is SAFE to change the MODE input. This signal is useful for pump mode hold time calculations only. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_GLBCTRL</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002200</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>FSM_GLBCTRL_RESERVED_31_01</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CLKSEL</name>
    <description><![CDATA[1=Use system clock, Value is hardcoded]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_STATE</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002204</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000C00</resetValue>
<fields>
  <field>
    <name>FSM_STATE_RESERVED_31_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>CTRLENZ</name>
    <description><![CDATA[CTRLENZ signal value. This is an internal CTRLENZ generated by the FSM. This is not the final CTRLENZ driven out to the bank. This signal is usually low for FSM operations and goes high when operations are done.]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>EXECUTEZ</name>
    <description><![CDATA[EXECUTEZ signal value. This is an internal EXECTUEZ generated by the FSM. This is not the final EXECTUEZ driven out to the bank. This signal will go low when an operation is occurring. ]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>FSM_STATE_RESERVED_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>FSM_ACT</name>
    <description><![CDATA[Flash State Machine is now active. This signal goes high when performing FSM operations or has control of the bank. ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>TIOTP_ACT</name>
    <description><![CDATA[TI OTP (Engineering) array signal is active. This bit goes high when the FSM works on the TI OTP array. ]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>OTP_ACT</name>
    <description><![CDATA[One Time Programmable array signal is active. This bit goes high when the FSM works on the OTP array. ]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>FSM_STATE_RESERVED_05_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_STATUS</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00002208</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000004</resetValue>
<fields>
  <field>
    <name>FSM_STATUS_RESERVED_31_03</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>NON_OP</name>
    <description><![CDATA[Not currently doing an operation where EXECUTEZ is low. Will remain low while an operation like program, or erase is underway. ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>OVR_PUL_CNT</name>
    <description><![CDATA[Over Pulse Count. The FSM has exceeded the pulse counts set in the registers. This will be active only if OVERRIDE is set in the FSM_ST_MACHINE register (027Ch) ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>INV_DAT</name>
    <description><![CDATA[Invalid Data is detected. This has the same function as INV_DAT in the FMSTAT register (004Ch). It sets when a `1' is programed into the flash array that is already `0'; Program operations can only change flash bits from a `1' to a `0'.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_COMMAND</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000220C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_COMMAND_RESERVED_31_06</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>FSMCMD</name>
    <description><![CDATA[Flash State Machine Command. Refer to the FMC specification. Writes to this register are blocked if the state machine is busy.]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PE_OSU</name>
    <description><![CDATA[FSM Program/Erase Operation Setup  ]]></description>
    <addressOffset>0x00002210</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_PE_OSU_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PGM_OSU</name>
    <description><![CDATA[[Configured by boot firmware]
Program Operation Setup time. This determines the flash clocks from the mode change to program to the start of the program pulse. ]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>ERA_OSU</name>
    <description><![CDATA[[Configured by boot firmware]
Erase Operation Setup time. This determines the flash clocks from the mode change to the start of the erase pulse. ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_VSTAT</name>
    <description><![CDATA[FSM Voltage Status Setup  ]]></description>
    <addressOffset>0x00002214</addressOffset>
    <access>read-write</access>
    <resetValue>0x00003000</resetValue>
<fields>
  <field>
    <name>FSM_VSTAT_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VSTAT_CNT</name>
    <description><![CDATA[[Configured by boot firmware]
Voltage Status Count. Gives the number of consecutive hclk pulses that must be out of range before a voltage-out-of-range status error is given in FMSTAT bit 3. One pulse in range will reset the counter. This is mainly a glitch filter on the voltage status pump signal.]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>FSM_VSTAT_RESERVED_11_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PE_VSU</name>
    <description><![CDATA[FSM Program/Erase Verify Setup  ]]></description>
    <addressOffset>0x00002218</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_PE_VSU_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PGM_VSU</name>
    <description><![CDATA[[Configured by boot firmware]
Program Verify Setup time. This determines the flash clocks from the mode change to program verify to the change of address and the beginning of the address setup time.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>ERA_VSU</name>
    <description><![CDATA[[Configured by boot firmware]
Erase Verify Setup time. This determines the flash clocks from the mode change to erase verify to the change of address and the beginning of the address setup time. ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
