zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FSM_CMP_VSU</name>
    <description><![CDATA[FSM Compare Verify setup]]></description>
    <addressOffset>0x0000221C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_CMP_VSU_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ADD_EXZ</name>
    <description><![CDATA[[Configured by boot firmware]
Address to EXECUTEZ low setup time. This determines the flash clocks from the row address change to the time EXECUTEZ goes low. All operations use this value.]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>FSM_CMP_VSU_RESERVED_15_0</name>
    <description><![CDATA[]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_EX_VAL</name>
    <description><![CDATA[FSM EXECUTEZ to Valid Data  ]]></description>
    <addressOffset>0x00002220</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000301</resetValue>
<fields>
  <field>
    <name>FSM_EX_VAL_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>REP_VSU</name>
    <description><![CDATA[[Configured by boot firmware]
Repeat Verify action setup. If a program or erase operation advances to the program_verify or erase_verify then this special shorter mode transition time will be used in place of PRG_VSU or ERA_VSU times. ]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>EXE_VALD</name>
    <description><![CDATA[[Configured by boot firmware]
EXECUTEZ low to valid Data. Determines the number con constant or Flash clock cycles from EXECUTEZ going low to the time the verify data can be read in the program verify mode. Erase and compact verify is always a constant value which is currently set at one flash clock. This value must be greater than 0. ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_RD_H</name>
    <description><![CDATA[FSM Read Mode Hold  ]]></description>
    <addressOffset>0x00002224</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000005A</resetValue>
<fields>
  <field>
    <name>FSM_RD_H_RESERVED_31_08</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RD_H</name>
    <description><![CDATA[[Configured by boot firmware]
Read mode hold. This determines the number of flash clocks from the start of the Read mode at the end of the operations until the FSM clears the BUSY bit in FMSTAT. Writing a zero to this register will result in a value of 1. The reset value of this register is 3Ah before version 3.0.10.0 and 5Ah after this version.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_P_OH</name>
    <description><![CDATA[FSM Program Hold]]></description>
    <addressOffset>0x00002228</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000100</resetValue>
<fields>
  <field>
    <name>FSM_P_OH_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PGM_OH</name>
    <description><![CDATA[[Configured by boot firmware]
EXECUTEZ high to mode change. This value determines the flash clocks from the EXECUTEZ going high at the end of a program operation to the time the mode can change. This value must be greater than or equal to one.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>FSM_P_OH_RESERVED_07_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ERA_OH</name>
    <description><![CDATA[FSM Erase Operation Hold ]]></description>
    <addressOffset>0x0000222C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>FSM_ERA_OH_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ERA_OH</name>
    <description><![CDATA[[Configured by boot firmware]
EXECUTEZ high to mode change. Determines the flash clocks from EXECUTEZ going high at the end of an erase operation to the time the mode can change. If a bank erase happening, then this is the time to the TEZ and TCR values for bank erase are released. The mode changes 10 flash clocks after they are released. This value must be greater than or equal to one. ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_SAV_PPUL</name>
    <description><![CDATA[FSM Saved Program Pulses ]]></description>
    <addressOffset>0x00002230</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_SAV_PPUL_RESERVED_31_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>SAV_P_PUL</name>
    <description><![CDATA[Saved Program Pulses. Contains the number of pulses allowable in a suspended program operation. The current pulse counter is saved here when suspending a program operation. ]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PE_VH</name>
    <description><![CDATA[FSM Program/Erase Verify Hold ]]></description>
    <addressOffset>0x00002234</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000100</resetValue>
<fields>
  <field>
    <name>FSM_PE_VH_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PGM_VH</name>
    <description><![CDATA[[Configured by boot firmware]
Program Verify Hold. This register determines the flash clocks from EXECUTEZ going high after a program verify to a mode change. This value must be greater than or equal to one]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>ERA_VH</name>
    <description><![CDATA[Reserved ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PRG_PW</name>
    <description><![CDATA[FSM Program Pulse Width ]]></description>
    <addressOffset>0x00002240</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_PRG_PW_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PROG_PUL_WIDTH</name>
    <description><![CDATA[[Configured by boot firmware]
This register gives the number of constant or flash  clocks that the EXECUTEZ ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ERA_PW</name>
    <description><![CDATA[FSM Erase Pulse Width ]]></description>
    <addressOffset>0x00002244</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_ERA_PW</name>
    <description><![CDATA[[Configured by boot firmware]
Erase Pulse width. This register gives the number flash clocks the EXECUTEZ signal is low in a erase operation.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_SAV_ERA_PUL</name>
    <description><![CDATA[FSM Saved Erased Pulses ]]></description>
    <addressOffset>0x00002254</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_SAV_ERA_PUL_RESERVED_31_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>SAV_ERA_PUL</name>
    <description><![CDATA[Saved Erase Pulses. The register contains the pulse counter value during suspend operations. The pulse counter is a count down counter that starts at the PULSE_CNT value.]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_TIMER</name>
    <description><![CDATA[FSM Timer  ]]></description>
    <addressOffset>0x00002258</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_TIMER</name>
    <description><![CDATA[Current Timer. The register contains the current number of flash clocks left in the current operation. The values from the other registers get transferred into this register and the this register counts down the value to zero.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_MODE</name>
    <description><![CDATA[FSM MODE register ]]></description>
    <addressOffset>0x0000225C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_MODE_RESERVED_31_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>RDV_SUBMODE</name>
    <description><![CDATA[Submode saved during read_verify suspend. These bits contain the submode field saved during the read_verify suspend mode. ]]></description>
    <bitRange>[19:18]</bitRange>
  </field>
  <field>
    <name>PGM_SUBMODE</name>
    <description><![CDATA[Submode saved during program suspend. These bits contain the submode field saved during the program suspend mode. ]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>ERA_SUBMODE</name>
    <description><![CDATA[Submode saved during erase suspend. These bits contain the submode field saved during the erase suspend mode. ]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>SUBMODE</name>
    <description><![CDATA[Current submode of the FSM operation. 00=normal, 01=Redundant column operation, 10=OTP operations, 11=TI OTP operations.]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>SAV_PGM_CMD</name>
    <description><![CDATA[Command saved during program suspend. These bits contain the command field saved during the program suspend mode.]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>SAV_ERA_MODE</name>
    <description><![CDATA[Mode saved during erase suspend. These bits contain the mode field saved during the erase suspend mode.]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>MODE</name>
    <description><![CDATA[Current Flash mode operation.]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>CMD</name>
    <description><![CDATA[Current Flash command operation.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PGM</name>
    <description><![CDATA[FSM Program bits register ]]></description>
    <addressOffset>0x00002260</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_PGM_RESERVED_31_26</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>PGM_BANK</name>
    <description><![CDATA[Saved Bank during Program Suspend. Saves the bank during program suspend operations]]></description>
    <bitRange>[25:23]</bitRange>
  </field>
  <field>
    <name>PGM_ADDR</name>
    <description><![CDATA[Saved Address During Program Suspend. Saves the current address during program suspend operations. ]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ERA</name>
    <description><![CDATA[FSM Erase bits register ]]></description>
    <addressOffset>0x00002264</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_ERA_RESERVED_31_26</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>ERA_BANK</name>
    <description><![CDATA[Saved Bank during Erase Suspend. Saves the bank during erase suspend operations.]]></description>
    <bitRange>[25:23]</bitRange>
  </field>
  <field>
    <name>ERA_ADDR</name>
    <description><![CDATA[Saved Address During Erase Suspend. Saves the current address during erase suspend operations.]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PRG_PUL</name>
    <description><![CDATA[FSM Maximum Programming Pulses ]]></description>
    <addressOffset>0x00002268</addressOffset>
    <access>read-write</access>
    <resetValue>0x00040032</resetValue>
<fields>
  <field>
    <name>FSM_PRG_PUL_RESERVED_31_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>BEG_EC_LEVEL</name>
    <description><![CDATA[[Configured by boot firmware]
Beginning level for VHVCT. This determines the beginning level for VHVCT that is used during erase modes. The pump voltage control registers supply the other values that do not change during FSM operations. The reset value is the same as VHVCT_E in the FVHVCT1 register]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FSM_PRG_PUL_RESERVED_15_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>MAX_PRG_PUL</name>
    <description><![CDATA[[Configured by boot firmware]
Maximum Programming Pulses. This register contains the maximum number of programming pulses allowed at one address. If it takes any more than this amount during a programming operation then the FSM will exit with an error and with the program violation, PGV bit 12, set and the general error bit 4 set of FMSTAT. Setting the OVERRIDE bit 0 in ST_MACHINE will allow more than this maximum value to occur without an error. During pre-conditioning for an erase operation the FSM programs all the bits to zero. If the maximum number of programming pulses is reached for an address, the FSM will continue with the next address and set the PCV bit 11 and the general error bit 4. If the Precondition_stop_enable bit 4 is set in the ST_MACHINE register then the FSM will stop with errors when more than the maximum number of pulses is needed. The OVERRIDE bit will take priority over the Precondition_stop_enable bit 4 and continue doing pulses without setting the error bits. Suspend operations will count a pulse if the program operation began no matter how long the pulse lasted before is was suspended. Frequent suspend or auto-suspend operations could result in max_pulse count error.]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ERA_PUL</name>
    <description><![CDATA[FSM Maximum Erase Pulses  ]]></description>
    <addressOffset>0x0000226C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00040BB8</resetValue>
<fields>
  <field>
    <name>FSM_ERA_PUL_RESERVED_31_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>MAX_EC_LEVEL</name>
    <description><![CDATA[Maximum VHVCT Level. This determines the maximum level for VHVCT that is used during erase modes. The FSM will stop advancing VHVCT once it counts up to the MAX_EC_LEVEL level from the beginning level. The MAX_EC_LEVEL + EC_STEP_HEIGHT must be less than 200h. The reset value is the same as VHVCT_E in the FVHVCT1 register.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FSM_ERA_PUL_RESERVED_15_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>MAX_ERA_PUL</name>
    <description><![CDATA[[Configured by boot firmware]
Maximum Erase Pulses. This register contains the maximum number of erase pulses allowed at one address. If it takes any more than this amount the FSM will exit with an error and with the EV bit 10 and bit 4 set of FMSTAT. Setting the OVERRIDE bit 0 in ST_MACHINE will allow more than this maximum value to occur without an error. Suspend operations will count a pulse if the erase operation began no matter how long the pulse lasted before is was suspended. Frequent suspend or auto-suspend operations could result in max_pulse count error.]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_STEP_SIZE</name>
    <description><![CDATA[FSM EC Step Size ]]></description>
    <addressOffset>0x00002270</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_STEP_SIZE_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>EC_STEP_SIZE</name>
    <description><![CDATA[[Configured by boot firmware]
VHVCT Step Size. This is the number of erase pulses that must be completed for each level before the FSM increments the CUR_EC_LEVEL to the next higher level. Actual erase pulses per level equals (EC_STEP_SIZE +1). The stepping is only needed for the VHVCT voltage.]]></description>
    <bitRange>[24:16]</bitRange>
  </field>
  <field>
    <name>FSM_STEP_SIZE_RESERVED_15_00</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PUL_CNTR</name>
    <description><![CDATA[FSM Pulse Counter  ]]></description>
    <addressOffset>0x00002274</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_PUL_CNTR_RESERVED_31_25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>CUR_EC_LEVEL</name>
    <description><![CDATA[Current VHVCT Level. This is the current VHVCT level used during the erase pulses. It is set to the BEG_EC_LEVEL value at the beginning of every FSM command. ]]></description>
    <bitRange>[24:16]</bitRange>
  </field>
  <field>
    <name>FSM_PUL_CNTR_RESERVED_15_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>PUL_CNTR</name>
    <description><![CDATA[Pulse Counter. This register contains the current number of operation pulses allowed at one address at a time. It is loaded at the start of a program, or erase operation from the FSM_xxx_PUL registers and it counts down to zero.]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_EC_STEP_HEIGHT</name>
    <description><![CDATA[FSM EC Step Height ]]></description>
    <addressOffset>0x00002278</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_EC_STEP_HEIGHT_RESERVED_31_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>EC_STEP_HEIGHT</name>
    <description><![CDATA[Height of each EC step. This is the number of counts that the CUR_EC_LEVEL will increment when going to a new level. Actual count size equals (EC_STEP_HEIGHT + 1). The stepping applies only to the VHVCT voltage. If adding the height to the CUR_EC_LEVEL results in a value higher than the MAX_EC_LEVEL then the CUR_EC_LEVEL will be lowered to the MAX LEVEL well before it is used in the next erase pulse.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
