zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FSM_ST_MACHINE</name>
    <description><![CDATA[FSM_ST_MACHINE ]]></description>
    <addressOffset>0x0000227C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00800500</resetValue>
<fields>
  <field>
    <name>FSM_ST_MACHINE_RESERVED_31_24</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>DO_PRECOND</name>
    <description><![CDATA[Do preconditioning. When this bit is a one, the FSM will precondition the sector or bank before doing an erase operation. When zero, the FSM will just begin with the erase verify and skip the preconditioning.]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>FSM_INT_EN</name>
    <description><![CDATA[FSM event enable. When this bit is one, the FSM_DONE event is enabled. The FSM_DONE event and register bit will set when the FSM finishes its operations after the EXECUTE field in the FSM_EXECUTE register is activated. The FSM_DONE event flag resides in the FEDACSTATUS register. This FSM_DONE flag must be cleared by writing a one to this bit in order for the event signal to stop.]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>ALL_BANKS</name>
    <description><![CDATA[All bank operations. When this bit is one some operations range over every main data space address of every bank. Only some of the commands are supported by the ALL_BANKs bit and the unsupported commands should not have the bit set. The currently supported FSM commands are: Read_verify-Each command can do either Main, OTP, or TI-OTP regions. Only if RV_SEC_EN is zero. Read_verify_resume-same as read verify. Erase_bank-This will sequentially erase all banks (one bank at a time) (future versions may do all banks at once). OTP / TI_OTP areas will not be affected by a bank erase. All FBSE register bits for all banks should be set before starting Erase_Bank or a SLOCK error will result.]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>CMPV_ALLOWED</name>
    <description><![CDATA[Compaction Verify allowed. When one, the FSM can execute compaction verify operations during an erase command. Any mismatch during compaction verify is a sign of a major programming/erase issue. This is usually only used for debugging purposes and may be left zero for other operations. Split gate flash banks can not do compaction operations. This bit should be set to do any compact verify operations. ]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>RANDOM</name>
    <description><![CDATA[Enable Pseudo-Random Pattern Generation. This bit only has effect on Program Sector and Read Verify commands. When set, the built-in PRPG will first be initialized with a seed value stored in the FWPWRITE register. As the state machine increments the address to either program or read the next location, the PRPG will generate the next pattern and write it back to the FWPWRITE register. The new random pattern is written to the flash for Program Sector command or the random pattern is compared with the flash read data in Read Verify command. See page 124 This bit has priority over the INV_DATA bit above.]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>RV_SEC_EN</name>
    <description><![CDATA[Read Verify Sector Enable. When set, the Read Verify command acts on the selected sector. By default, the Read Verify command acts on the selected bank. Flash wrapper selects the sector to act on by decoding FADDR.]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>RV_RES</name>
    <description><![CDATA[Read Verify Resume. When this bit is set to `1' the FMC will resume the Read Verify command operation upon invoking the Read Verify Resume command.]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>RV_INT_EN</name>
    <description><![CDATA[Read Verify Event Enable. When this bit is set to `1' the FMC will suspend the Read Verify command upon detecting a verify mismatch and generate an event. If this bit is zero then the read verify command will set error bits on a mismatch but continue checking additional locations. Mismatches will also increment the FSM_ACC_PP register. The FEDACSTATUS RV_FAIL flag will NOT be set.]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>FSM_ST_MACHINE_RESERVED_15</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>ONE_TIME_GOOD</name>
    <description><![CDATA[One Time Good function. If this bit is a one then the `One Time Good' function is enabled for all program operations. This includes operations inside the erase functions and other functions. When zero, this function is disabled for all modes. When doing the One Time Good function, the FSM will attempt to program a location with data. If a desired zero bit reads back from the flash one time as good then that bit is blocked from writing a zero to the flash array again for this address. When the address changes, all bits are unblocked. This prevents a bit from reading 0 in one programming pulse and then 1 in the next programming pulse. On the second time the bit would get a programming pulse even though it read 0 in an earlier read. If this bit is a zero then the zero bits will be masked for each program verify operation. It is recommended for this bit to be set to 1. ]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>RESTRT_ADDR</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>FSM_ST_MACHINE_RESERVED_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>DO_REDU_COL</name>
    <description><![CDATA[Do Redundant Columns. If one, the FSM will perform operations on the redundant columns when doing sector erasing. When zero the FSM will not perform operations on the redundant columns. This recommend value for this register is zero.]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>DBG_SHORT_ROW</name>
    <description><![CDATA[Debugging Short rows. This field allows easier debugging of some algorithms and is mainly used for simulations and not physical devices. When set to "0101" the FSM sees only about two rows in any sector. Any other value will allow the full range of operations. This register reset to the opposite value of "1010" so that four bits must change to enter this mode. ]]></description>
    <bitRange>[10:7]</bitRange>
  </field>
  <field>
    <name>BNK_ERA_MODE</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>PGM_SEC_COF_EN</name>
    <description><![CDATA[Program Sector Continue on Failure Enable. If this field is zero the program sector command will stop and exit with error bits set if the program operation takes more than the maximum number of programming pulses as specified by the FSM_PGM_PUL register. If one, the FSM will set the same error bits PGV and CSTAT in the FMSTAT register but continue with the next address. The OVERRIDE bit below will take priority over this bit. ]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>PREC_STOP_EN</name>
    <description><![CDATA[Pre-condition Stop Enable. If this field is zero the FSM will continue with the next address if the pre-condition portion of an erase command takes more than the maximum number of program pulses as specified by the FSM_PGM_PUL register. The PCV and CSTAT bits of the FMSTAT register will be set but the FSM will not stop. If the bit is zero, the FSM will set the same error bits and stop the FSM operation. The OVERRIDE bit below will take priority over this bit. ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DIS_TST_EN</name>
    <description><![CDATA[Disturbance Test Enable. When doing a program sector command for the first time after an erase, the FSM expects all addresses to initially read as all ones. If programming a value in any other address causes an address to change then it will not read as all ones on the initial access. When this bit is a one and the FSM finds a disturbance then the DBT and CSTAT bits of the FMSTAT register are set and the FSM stops. If this bit is zero the FSM does not check for this condition.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CMD_EN</name>
    <description><![CDATA[Command Enable. This bit must be one to allow any FSM TEST command to begin. If this bit is zero, any FSM test command is ignored. The test commands are the FSM commands 20h and higher. ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>INV_DATA</name>
    <description><![CDATA[Invert Data for checkerboard and other patterns. When this bit is one and the command is a program_sector command then the FSM will write every sequential row address with the one's complement or inverse of the current data. This makes all odd rows to have inverted data from the even rows. Within a row the internal data is inverted every wide word (the FWPWRITE register will not change). This is useful in making checkerboard patterns in the flash memory. When zero, no inversion occurs. A checkerboard pattern will have each physical bit in the flash surrounded by its opposite value on the top, bottom, left and right. The pattern and the FSM behavior depends on the data width and mux factor. The read_verify command can also use this bit to check the checkerboard pattern programmed by the program_sector command. The RANDOM bit in this register has priority over this bit.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>OVERRIDE</name>
    <description><![CDATA[Override Max Pulse. This bit overrides the maximum pulse registers for FSM_PGM_PUL and FSM_ERA_PUL and allows an unlimited number of operation pulses to happen. This bit also overrides PREC_STOP_EN bits above and will not set errors on those bit's conditions. When the FSM attempts an operation that is greater than the maximum pulse count, the CSTAT bit is set along with the appropriate PGV, PCV, EV or CV bit. This bit is mainly for debugging purposes and should remain zero for normal operations. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_FLES</name>
    <description><![CDATA[FLES Memory Control Bits]]></description>
    <addressOffset>0x00002280</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_FLES_RESERVED_31_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BLK_TIOTP</name>
    <description><![CDATA[Reserved. ]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>BLK_OTP</name>
    <description><![CDATA[FLES/FLEE  memory block OTP. When this bit is a one, the corresponding sector in the FLES OTP memory is neither programmed nor erased during an OTP command. FLEE memories have one combined OTP/TI-OTP and is controlled through bit 0. All other bits are unused.  ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_STICKY</name>
    <description><![CDATA[FSM Sticky bits]]></description>
    <addressOffset>0x00002284</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>OTP_LOCK</name>
    <description><![CDATA[If this bit is a one then writing to the OTPPROTDIS bits in register 3Ch is blocked. Once set to one this OTP_LOCK bit cannot be cleared except through a reset or if the input signal `sticky_bit_override' is a one and the write data is zero. The OTPPROTDIS bits prevents programming or erasing of the OTP and ENGR regions of a bank.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>VOLT_LOCK</name>
    <description><![CDATA[If this bit is a one then writing to the voltage registers in addresses 80h to B0h is blocked. Once set to one this VOLT_LOCK bit cannot be cleared except through a reset or if the input signal `sticky_bit_override' is a one and the write data is zero. The FLOCK register (64h) bits should be set to AAAAh to allow writing to these registers. AA55 will also work but this value will also put the bank selected by BANK (50h) into the software interface mode.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_WR_ENA</name>
    <description><![CDATA[FSM Register Write Enable  ]]></description>
    <addressOffset>0x00002288</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000002</resetValue>
<fields>
  <field>
    <name>FSM_WR_ENA_RESERVED_31_03</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>WR_ENA</name>
    <description><![CDATA[FSM Write Enable. This register must contain "101" in order to write to any other FSM register. If any other value is in this register, the FSM registers cannot be written. This is the first register written when setting up the FSM.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ACC_PP</name>
    <description><![CDATA[FSM Accumulate Program Pulses ]]></description>
    <addressOffset>0x0000228C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_ACC_PP</name>
    <description><![CDATA[The register is cleared at the start of every FSM command and counts the total number of program pulses executed. This register is not cleared when executing a Program resume or Erase resume command. During the read_verify command, this register counts the number of locations that did not match the reference value. Each reference value is one wide word so it can span several addresses.  ]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ACC_EP</name>
    <description><![CDATA[FSM Accumulate Erase Pulses ]]></description>
    <addressOffset>0x00002290</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_ACC_EP_RESERVED_31_16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ACC_EP</name>
    <description><![CDATA[Accumulate Erase Pulses. The register is cleared at the start of every FSM command and counts the total number of erase pulses executed. This register is not cleared when executing an Erase resume command. ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ADDR</name>
    <description><![CDATA[FSM Address ]]></description>
    <addressOffset>0x000022A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_ADDR_RESERVED_31</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>BANK</name>
    <description><![CDATA[Current Bank. This field displays the current bank used by the FSM.]]></description>
    <bitRange>[30:28]</bitRange>
  </field>
  <field>
    <name>CUR_ADDR</name>
    <description><![CDATA[Current Address. This is the current address used by the FSM. It may either be an absolute or a bank relative address. The first address of a bank is zero in a bank relative address. ]]></description>
    <bitRange>[27:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_SECTOR</name>
    <description><![CDATA[Treat this as reserved]]></description>
    <addressOffset>0x000022A4</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFF0000</resetValue>
<fields>
  <field>
    <name>SECT_ERASED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>FSM_SECTOR_EXTENSION</name>
    <description><![CDATA[FLEE or FLES sector extension bits. This field contains the extra bits needed by the FLEE or FLES memory when the these memory contains more than 16 sectors. It is an extension of the SECTOR field in bits 7:4.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SECTOR</name>
    <description><![CDATA[Sector. This is the current sector used by the FSM. It is mainly used by the bank erase command and read_verify commands and should not be used outside of these commands.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>SEC_OUT</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FMC_REV_ID</name>
    <description><![CDATA[FMC Revision Identification]]></description>
    <addressOffset>0x000022A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>MOD_VERSION</name>
    <description><![CDATA[Module Version. This read only field contains the five part version number of the module. Most version numbers come in a four part form like 1.2.3.4. Each part of the number takes 4 bits and the number is modulo 16. Example: 1.12.20.2 becomes "0001_1100_0100_0010" (31:16). Some version numbers contain a fifth letter for some special circumstances. This would be a number like 1.2.3.4.A where the fifth character is a letter. This letter is translated to a binary number modulo 16. A=1, B=2,... Zero means no special digit is used.]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>CONFIG_CRC</name>
    <description><![CDATA[Configuration Magic Number code. This field provides a unique 12 bit number that reflects all the configuration options of the FMC. It reduces about 1000 bits of configuration information provided by the configuration input file, (see page 368), into 12 bits. Two modules with the same configuration options will result in the same number regardless of the module version but any difference in options between the two configurations will produce significantly different CRC numbers. This number is produced when the module is extracted from the database during the device design. You cannot discern configuration options from the CRC number. Text formatting of the configuration input file does not affect this number. ]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_ERR_ADDR</name>
    <description><![CDATA[FSM Error Address ]]></description>
    <addressOffset>0x000022AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_ERR_ADDR</name>
    <description><![CDATA[FSM Error Bank. When any operation fails, the current bank is stored here. Additionally, the bank that sets the FSM_PGM_MAX_PUL register is saved here. The address stored in FSM_ERR_ADDR is relative to the selected bank and the address is aligned to the data width of the flash bank. All banks are seen as starting at zero in a bank relative address. This is true even for banks not aligned by a power of 2. See page 375. This is also a wide word address for most commands which means the lower 4 or 5 bits of the address become zero. This entire register is cleared during the at the start of any new FSM operation.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>FSM_ERR_ADDR_RESERVED_27_24</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>FSM_ERR_BANK</name>
    <description><![CDATA[FSM Error Address. When any operation fails, the current address is stored here. Additionally, the address that sets the FSM_PGM_MAX_PUL register is saved here.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_PGM_MAXPUL</name>
    <description><![CDATA[FSM Maximum Program Pulse ]]></description>
    <addressOffset>0x000022B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_PGM_MAXPUL</name>
    <description><![CDATA[FSM Program Maximum pulses used. This register records the highest number of program pulses used for a particular address during a program or precondition program operation. The address with the maximum pulses is stored in the FSM_ERR_ADDR register. This register is cleared during the Clear_More command.]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>FSM_PGM_MAXPUL_RESERVED_31_12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[19:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_EXECUTE</name>
    <description><![CDATA[FSM Command Execute ]]></description>
    <addressOffset>0x000022B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x000A000A</resetValue>
<fields>
  <field>
    <name>FSM_EXECUTE_RESERVED_31_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>SUSPEND_NOW</name>
    <description><![CDATA[FSM Command Suspend. Writing a 5 to this register will suspend the Program (02), Erase sector (06) or Read_verify(22h) commands. Writes to this register are ignored unless the FSM is busy with one of these commands. This field resets to `1010' when the FSM enters the standby state where it waits for the next command. It will not retain the written value for long. The Bank erase command, program sector command and every command except those three commands above are not suspendable and will ignore the suspend command. A suspend operation will exit the FSM with the proper setup and hold times for the various modes. When the FMC enters the auto-suspend mode this register is set to 5 to suspend the FSM. It will be exactly like this field was written with a 5 by the CPU. ]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>FSM_EXECUTE_RESERVED_15_05</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:5]</bitRange>
  </field>
  <field>
    <name>FSMEXECUTE</name>
    <description><![CDATA[FSM Command Execute. To invoke a FSM command this register must be written an value of 10101. This register is reset back to 01010 by the FSM upon completion of the command operation. Writes to this register are ignored while the FSM is busy. All others registers must be set up before writing to this command. Writing a 15h to this field is the last step to starting an FSM operation. When the FMC restarts the FSM during the auto-suspend sequence, this register is set to 5 to start the FSM. It will be exactly like this field was written with a 5 by the CPU.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
