zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>EEPROM_CONFIG</name>
    <description><![CDATA[EEPROM Emulation configuration ]]></description>
    <addressOffset>0x000022B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00010000</resetValue>
<fields>
  <field>
    <name>EEPROM_CONFIG_RESERVED_31_20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>EWAIT</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>EEPROM_CONFIG_RESERVED_15_09</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>AUTOSUSP_EN</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>AUTOSTART_GRACE</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_SECTOR1</name>
    <description><![CDATA[FSM Sector 1  ]]></description>
    <addressOffset>0x000022C0</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>FSM_SECTOR1</name>
    <description><![CDATA[Sector erased. This field can be written with ones before a bank erase command to block the sector erase from affecting the sector. This field actually has one unique value per bank and whatever bank the FMAC register is pointing to is the field that gets written or read. The FMAC must be set to each bank and then this field written in order to access every SECT_ERASED(bank) field. The FLES memory wrappers have only one SECT_ERASED field for all banks due to the increased number of bits needed for the FLES memory. During a bank erase operation, this register keeps track of which sectors have been erased. The FSM sets the bit to a one when the sector is erased. All SECT_ERASED fields are set during the Clear_More FSM command. These bits go to the flash bank to disable the flash banks from erasing the sectors. Either FSM busy, PMT mode or FLOCK register=AA55 will send these values to the flash banks. Otherwise the sect_erased signals going to the banks are all ones. This field is also usable in SoftWare_INTerFace modes. Standard bank can have up to 16 sectors but the FLEE EEPROM bank can have up to 64 sectors and each sector is always 4 k bytes. If present, the FLEE will always reside in bank 7. FSM_SECTOR2 controls bits 63:32 of the FLEE bank if present. The BSE register can not handle more than 16 sectors in a bank so special provisions apply if the FLEE memory is bigger than 64 k bytes If the FLEE has more than 16 sectors, then all 16 BSE bits must high to do an erase of any sector. Unimplemented sectors are reserved bits. Only those bits that have a corresponding sector can be programmed.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_SECTOR2</name>
    <description><![CDATA[FSM Sector 2 ]]></description>
    <addressOffset>0x000022C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_SECTOR2</name>
    <description><![CDATA[Continuation of FSM Sector 1.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_BSLE0</name>
    <description><![CDATA[FSM Bank Sector Lock Erase 0]]></description>
    <addressOffset>0x000022E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_BSLE0</name>
    <description><![CDATA[This registers description applies only to devices with FLEE main memories and provides additional protection over the FBSE register at 34h. Writing a one to a bit will lock the corresponding sector and prevent any erasing from occurring. Once written it can only be cleared after a reset or when the `sticky_bit_override' signal is high. When this bit is a one, the bank will cause a sector lock error if a sector erase operation is attempted. A bank erase will not cause a sector lock error but it will skip any protected sectors and only erase the unprotected sectors. This register can only be written when the FSM_WR_ENA (288h) is set to '5'.
This register will protect the register from erasing even in software interface mode by setting the ERASEPORT signals on the flash bank.
If there is more than 1 bank in the main array using FLEE then the FMAC BANK(50) field will select the correct overlaying register bits at the same address in a manner similar to the FBSE register.
FLEE memories have up to 64 sectors with 4 Kbytes sectors. This field is up to 64 register bits to support these banks.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_BSLE1</name>
    <description><![CDATA[FSM Bank Sector Lock Erase 1]]></description>
    <addressOffset>0x000022E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_BSL1</name>
    <description><![CDATA[Continuation of FSM Bank Sector Lock Erase 0 and contains bit for sectors 32 to 63 if present. If not available then these bits are reserved.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_BSLP0</name>
    <description><![CDATA[FSM Bank Sector Lock Program 0]]></description>
    <addressOffset>0x000022F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_BSLP0</name>
    <description><![CDATA[This registers description applies only to devices with FLEE main memories and provides additional protection over the FBSE register at 34h. Writing a one to a bit will lock the corresponding sector and prevent any erasing from occurring. Once written it can only be cleared after a reset or when the `sticky_bit_override' signal is high. When this bit is a one, the bank will cause a sector lock error if a sector erase operation is attempted. A bank erase will not cause a sector lock error but it will skip any protected sectors and only erase the unprotected sectors. This register can only be written when the FSM_WR_ENA (288h) is set to '5'.
This register will protect the register from erasing even in software interface mode by setting the ERASEPORT signals on the flash bank.
If there is more than 1 bank in the main array using FLEE then the FMAC BANK(50) field will select the correct overlaying register bits at the same address in a manner similar to the FBSE register.
FLEE memories have up to 64 sectors with 4 Kbytes sectors. This field is up to 64 register bits to support these banks.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FSM_BSLP1</name>
    <description><![CDATA[FSM Bank Sector Lock Program 1]]></description>
    <addressOffset>0x000022F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FSM_BSL1</name>
    <description><![CDATA[Continuation of FSM Bank Sector Lock Program 0 and contains bit for sectors 32 to 63 if present. If not available then these bits are reserved.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_BANK</name>
    <description><![CDATA[Flash configuration Bank ]]></description>
    <addressOffset>0x00002400</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000401</resetValue>
<fields>
  <field>
    <name>EE_BANK_WIDTH</name>
    <description><![CDATA[The Width of the dedicated EEPROM memory. This field is the number of bits in a wide word of a dedicated Flash EEPROM emulation memory. This can be 64]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>EE_NUM_BANK</name>
    <description><![CDATA[The number of dedicated EEPROM banks. This field is the number of dedicated EEPROM bank in the modules and ranges from 0 to 8. Zero mean no EEPROM bank is present. Currently, only zero and one are allowed. The starting address for the EEPROM bank is always shown as zero in these registers. The dedicated EEPROM bank always resides at bank 7 and the data begins at F020_0000h.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>MAIN_BANK_WIDTH</name>
    <description><![CDATA[The Width of the main data space banks. This field is the number of bits in a wide word of the main data space banks. This can be 128]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>MAIN_NUM_BANK</name>
    <description><![CDATA[The number of main data space banks. This field is the number of main data space banks in the modules and ranges from 1 to 8.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_WRAPPER</name>
    <description><![CDATA[Flash Wrapper Configuration ]]></description>
    <addressOffset>0x00002404</addressOffset>
    <access>read-write</access>
    <resetValue>0x50009007</resetValue>
<fields>
  <field>
    <name>FAMILY_TYPE</name>
    <description><![CDATA[Major type of device. This field denotes this major type of device used]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>FCFG_WRAPPER_RESERVED_23_21</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>MEM_MAP</name>
    <description><![CDATA[Memory map type. 0 = Standard 16 MB map; 1 = Older 8 MB map;]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>CPU2</name>
    <description><![CDATA[CPU Type 2. TBD. Currently reads as zeros.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>EE_IN_MAIN</name>
    <description><![CDATA[EEPROM emulation in Main data space. The field describes the way the module handles EEPROM emulations functions in the main data space memory. ( ]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>ROM</name>
    <description><![CDATA[Replace Flash banks with ROMs. If one then the flash bank have been replaced with ROMs. Many other logic functions are also removed especially those that write to the Flash memory like the FSM and software interface.]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>IFLUSH</name>
    <description><![CDATA[CC26=0, Instruction Flush Supported. If this field is one then the CPU is an ARM M3 with IFLUSH capability. This mean it can accept the ECC error signal one cycle late and still flush the instruction from the CPU execution pipeline.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>SIL3</name>
    <description><![CDATA[CC26=0, SIL3 configuration. If this field is one then the module has extra logic to check critical buses.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>ECCA</name>
    <description><![CDATA[ECC has an Address component. If this bit is one then the ECC include address bits 21:3 in the logic in order to verify the data came from the correct location. ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>AUTO_SUSP</name>
    <description><![CDATA[Auto-suspend logic. Auto-suspend will suspend an active FSM operation if the CPU is requesting an access to the same bank as the FSM. After the access the FSM will restart and finish the operation. ]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>UERR</name>
    <description><![CDATA[Uncorrectable Error Type. The module can either find an UERR and freeze the external UERR port from further UERR action or it can issue a UERR pulse for every uncorrectable error the module finds. 00=UERR frozen after 1st occurrence, 01=UERR issued for every occurrence.]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>CPU_TYPE1</name>
    <description><![CDATA[CPU Type. This field reflects the current CPU controlling the FMC. CC26= 0111.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_BNK_TYPE</name>
    <description><![CDATA[Flash Bank Type]]></description>
    <addressOffset>0x00002408</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>B7_TYPE</name>
    <description><![CDATA[same for bank 7 ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B6_TYPE</name>
    <description><![CDATA[same for bank 6 ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B5_TYPE</name>
    <description><![CDATA[same for bank 5 ]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>B4_TYPE</name>
    <description><![CDATA[same for bank 4]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>B3_TYPE</name>
    <description><![CDATA[same for bank 3 ]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>B2_TYPE</name>
    <description><![CDATA[same for bank 2]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>B1_TYPE</name>
    <description><![CDATA[same for bank 1]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>B0_TYPE</name>
    <description><![CDATA[Type of memory in Bank 0. This field is the type of memory in bank 0. 0=FLEP, 1=FLEE, 2=FLES, 3=FLEE/CC26, other=TBD.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B0_START</name>
    <description><![CDATA[Flash Bank 0 Starting Address  ]]></description>
    <addressOffset>0x00002410</addressOffset>
    <access>read-write</access>
    <resetValue>0x02000000</resetValue>
<fields>
  <field>
    <name>B0_MAX_SECTOR</name>
    <description><![CDATA[Number of highest sector in Bank 0. This field is the number of the highest sector in bank 0 and ranges from 0 to 15. This is one less than the total number of sector for bank 0. For a FLEE or FLES bank with more than 16 sectors, this number will be set to "0h" and ignored. The number of sectors for FLES and FLEE is given in FCFG_Bx_SSIZE0 bits 23:16.]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B0_MUX_FACTOR</name>
    <description><![CDATA[Mux Factor of Bank 0 divided by 8. This field is the mux factor of bank 0 and give the number of wide words on a flash row. The number in the field is the mux factor divided by 8. 1-Bank has 08 wide words on a row (not currently used);2-Bank has 16 wide words on a row;4-Bank has 32 wide words on a row]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B0_START_ADDR</name>
    <description><![CDATA[Starting Address of Bank 0. This field is the first absolute address of bank 0. For a FEE memory in bank 7, This value will always be zero. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B1_START</name>
    <description><![CDATA[Flash Bank 1 Starting Address ]]></description>
    <addressOffset>0x00002414</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B1_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0.]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B1_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B1_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B2_START</name>
    <description><![CDATA[Flash Bank 2 Starting Address ]]></description>
    <addressOffset>0x00002418</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B2_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B2_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B2_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B3_START</name>
    <description><![CDATA[Flash Bank 3 Starting Address ]]></description>
    <addressOffset>0x0000241C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B3_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B3_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B4_START</name>
    <description><![CDATA[Flash Bank 4 Starting Address ]]></description>
    <addressOffset>0x00002420</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B4_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B4_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B4_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B5_START</name>
    <description><![CDATA[Flash Bank 5 Starting Address ]]></description>
    <addressOffset>0x00002424</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B5_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B5_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B5_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B6_START</name>
    <description><![CDATA[Flash Bank 6 Starting Address ]]></description>
    <addressOffset>0x00002428</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B6_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B6_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B6_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B7_START</name>
    <description><![CDATA[Flash Bank 7 Starting Address ]]></description>
    <addressOffset>0x0000242C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B7_MAX_SECTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B7_MUX_FACTOR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>B7_START_ADDR</name>
    <description><![CDATA[Same as bank 0. ]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B0_SSIZE0</name>
    <description><![CDATA[Flash Bank 0 Sector Size 0  ]]></description>
    <addressOffset>0x00002430</addressOffset>
    <access>read-write</access>
    <resetValue>0x00200004</resetValue>
<fields>
  <field>
    <name>FCFG_B0_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B0_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 0. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B0_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B0_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 0. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B0_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002434</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B0_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002438</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B0_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000243C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B1_SSIZE0</name>
    <description><![CDATA[Flash Bank 1 Sector Size 0  ]]></description>
    <addressOffset>0x00002440</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B1_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B1_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 1. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B0_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B1_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 1. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B1_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002444</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
