zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>FCFG_B1_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002448</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B1_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000244C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B2_SSIZE0</name>
    <description><![CDATA[Flash Bank 2 Sector Size 0  ]]></description>
    <addressOffset>0x00002450</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B2_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B2_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 2. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B2_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B2_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 2. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B2_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002454</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B2_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002458</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B2_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000245C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B3_SSIZE0</name>
    <description><![CDATA[Flash Bank 3 Sector Size 0  ]]></description>
    <addressOffset>0x00002460</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B3_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B3_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 3. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B3_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B3_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 3. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B3_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002464</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B3_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002468</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B3_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000246C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B4_SSIZE0</name>
    <description><![CDATA[Flash Bank 4 Sector Size 0  ]]></description>
    <addressOffset>0x00002470</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B4_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B4_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 4. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B4_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B4_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 4. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B4_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002474</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B4_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002478</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B4_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000247C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B5_SSIZE0</name>
    <description><![CDATA[Flash Bank 5 Sector Size 0  ]]></description>
    <addressOffset>0x00002480</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B5_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B5_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 5. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B5_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B5_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 5. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B5_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002484</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B5_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002488</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B5_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000248C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B6_SSIZE0</name>
    <description><![CDATA[Flash Bank 6 Sector Size 0  ]]></description>
    <addressOffset>0x00002490</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B6_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B6_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 6. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B6_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B6_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 6. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B6_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002494</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B6_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x00002498</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B6_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x0000249C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B7_SSIZE0</name>
    <description><![CDATA[Flash Bank 7 Sector Size 0  ]]></description>
    <addressOffset>0x000024A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FCFG_B7_SSIZE0_RESERVED_31_28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>B7_NUM_SECTORS</name>
    <description><![CDATA[Number of sectors in Bank 7. Number of Sectors in this bank. Ranges from 0 to 2048]]></description>
    <bitRange>[27:16]</bitRange>
  </field>
  <field>
    <name>FCFG_B7_SSIZE0_RESERVED_15_4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>B7_SECT_SIZE</name>
    <description><![CDATA[Size of sectors in Bank 7. Common sector size for all sectors in the bank in 1 K bytes multiples. 0= 0K bytes, 1= 1K bytes(FLES), 2= 2K bytes, 4=4K bytes (FLEE) and so on.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B7_SSIZE1</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x000024A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B7_SSIZE2</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x000024A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FCFG_B7_SSIZE3</name>
    <description><![CDATA[Not Used in CC26 ]]></description>
    <addressOffset>0x000024AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
