zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>FLASHMEM</name>
<description><![CDATA[Flash memory area]]></description>
<baseAddress>0x00000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00020000</size>
<usage>registers</usage>
</addressBlock>
<registers>
</registers>
</peripheral>
<peripheral>
<name>FLASHMEM_ALIAS</name>
<description><![CDATA[Flash memory area]]></description>
<baseAddress>0xA0000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00020000</size>
<usage>registers</usage>
</addressBlock>
<registers>
</registers>
</peripheral>
<peripheral>
<name>WDT</name>
<description><![CDATA[]]></description>
<baseAddress>0x40080000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>LOAD</name>
    <description><![CDATA[WDT Configuration]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>WDTLOAD</name>
    <description><![CDATA[This register is the 32-bit interval value used by the 32-bit counter. When this register is written, the value is immediately loaded and the counter restarts counting down from the new value. If the WDTLOAD register is loaded with 0x0000.0000, an interrupt is immediately generated.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VALUE</name>
    <description><![CDATA[Watchdog Value]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>WDTVALUE</name>
    <description><![CDATA[ This register contains the current count value of the timer.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTL</name>
    <description><![CDATA[WDT Control]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x80000000</resetValue>
<fields>
  <field>
    <name>WRC</name>
    <description><![CDATA[Write Complete The WRC values are defined as follows:  Value Description 0 A write access to one of the WDT1 registers is in progress.  A write access is not in progress, and WDT1 registers can be
read or written.  ]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[30:3]</bitRange>
  </field>
  <field>
    <name>INTTYPE</name>
    <description><![CDATA[Watchdog Interrupt Type Watchdog Interrupt Type
The INTTYPE values are defined as follows:
  Value Description 0 Watchdog interrupt is a standard interrupt.  1 Watchdog interrupt is a non-maskable interrupt. ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RESEN</name>
    <description><![CDATA[Watchdog Reset Enable The RESEN values are defined as follows: Value Description 0 Disabled.  1 Enable the Watchdog module reset output.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>INTEN</name>
    <description><![CDATA[Watchdog Interrupt Enable The INTEN values are defined as follows: Value Description 0 Interrupt event disabled (once this bit is set, it can only be cleared by a hardware reset).  1 Interrupt event enabled. Once enabled, all writes are ignored.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ICR</name>
    <description><![CDATA[WDT Interrupt Clear (WDTICR),]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>WDTICR</name>
    <description><![CDATA[This register is the interrupt clear register. A write of any value to this register clears the Watchdog interrupt and reloads the 32-bit counter from the WDTLOAD register. Value for a read or reset is indeterminate.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RIS</name>
    <description><![CDATA[WDT Raw Interrupt Status]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>WDTRIS</name>
    <description><![CDATA[This register is the raw interrupt status register. Watchdog interrupt events can be monitored via this register if the controller interrupt is masked.  Watchdog Raw Interrupt Status Value Description 1 A watchdog time-out event has occurred.  0 The watchdog has not timed out.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MIS</name>
    <description><![CDATA[WDT Masked Interrupt Status]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>WDTMIS</name>
    <description><![CDATA[This register is the masked interrupt status register. The value of this register is the logical AND of the raw interrupt bit and the WDT interrupt enable bit.  WDT Masked Interrupt Status Value Description: 1 An unmasked watchdog time-out event has occurred.  0 The watchdog has not timed out or is masked.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEST</name>
    <description><![CDATA[WDT Test  This register provides user-enabled stalling when the microcontroller asserts the CPU halt flag during debug.]]></description>
    <addressOffset>0x00000418</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. ]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>STALL</name>
    <description><![CDATA[Watchdog Stall Enable, Value Description, 1 If the microcontroller is stopped with a debugger, the watchdog timer stops counting. Once the microcontroller is restarted, the watchdog timer resumes counting.  0 The watchdog timer continues counting if the microcontroller is stopped with a debugger.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCK</name>
    <description><![CDATA[WDT Lock (WDTLOCK)  Writing 0x1ACC.E551 to the WDTLOCK register enables write access to all other registers. Writing any other value to the WDTLOCK register re-enables the locked state for register writes to all the other registers. Reading the WDTLOCK register returns the lock status rather than the 32-bit value written. Therefore, when write accesses are disabled, reading the WDTLOCK register returns 0x0000.0001 (when locked; otherwise, the returned value is 0x0000.0000 (unlocked)).]]></description>
    <addressOffset>0x00000C00</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>WDTLOCK</name>
    <description><![CDATA[ Watchdog Lock A write of the value 0x1ACC.E551 unlocks the watchdog registers for write access. A write of any other value reapplies the lock, preventing any register updates.  A read of this register returns the following values: Value Description 0x0000.0001 Locked 0x0000.0000 Unlocked]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID4</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FD0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID4</name>
    <description><![CDATA[WDT Peripheral ID Register [7:0]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID5</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FD4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID5</name>
    <description><![CDATA[WDT Peripheral ID Register [15:0]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID6</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FD8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID6</name>
    <description><![CDATA[WDT Peripheral ID Register [23:16]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID7</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FDC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID7</name>
    <description><![CDATA[WDT Peripheral ID Register [31:24]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID0</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FE0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000005</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID0</name>
    <description><![CDATA[WDT Peripheral ID Register [7:0]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID1</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FE4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000018</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID1</name>
    <description><![CDATA[WDT Peripheral ID Register [15:8]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID2</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FE8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000018</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID2</name>
    <description><![CDATA[WDT Peripheral ID Register [23:16]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID3</name>
    <description><![CDATA[The PERIPHIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FEC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PID1</name>
    <description><![CDATA[WDT Peripheral ID Register [31:24]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELID0</name>
    <description><![CDATA[The PCELIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FF0</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CID0</name>
    <description><![CDATA[WDT PrimeCell ID Register [7:0]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELID1</name>
    <description><![CDATA[The PCELIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FF4</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000F0</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CID1</name>
    <description><![CDATA[WDT PrimeCell ID Register [15:8]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELID2</name>
    <description><![CDATA[The PCELIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FF8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000006</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CID2</name>
    <description><![CDATA[WDT PrimeCell ID Register [23:16]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELID3</name>
    <description><![CDATA[The PCELIDn registers are hard-coded and the fields within the register determine the reset value.]]></description>
    <addressOffset>0x00000FFC</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000B1</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CID3</name>
    <description><![CDATA[WDT PrimeCell ID Register [31:24]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
