zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>SSP0</name>
<description><![CDATA[SSP Component]]></description>
<baseAddress>0x40000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CR0</name>
    <description><![CDATA[Control register 0]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SCR</name>
    <description><![CDATA[Serial clock rate]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SPH</name>
    <description><![CDATA[SSPCLKOUT phase (Motorola SPI frame format only)]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>SPO</name>
    <description><![CDATA[SSPCLKOUT polarity (Motorola SPI frame format only)]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>FRF</name>
    <description><![CDATA[Frame format]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>DSS</name>
    <description><![CDATA[Data Size Select]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CR1</name>
    <description><![CDATA[Control register 1]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>SOD</name>
    <description><![CDATA[Slave-mode output disabled]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>MS</name>
    <description><![CDATA[Master or slave mode select]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SSE</name>
    <description><![CDATA[Synchronous serial port enable]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>LBM</name>
    <description><![CDATA[Loop back mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DR</name>
    <description><![CDATA[Receive FIFO (read) and transmit FIFO data register (write)]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[Transmit/receive data]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SR</name>
    <description><![CDATA[Status register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>BSY</name>
    <description><![CDATA[PrimeCell SSP busy flag]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RFF</name>
    <description><![CDATA[Receive FIFO full]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RNE</name>
    <description><![CDATA[Receive FIFO not empty]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TNF</name>
    <description><![CDATA[Transmit FIFO not full]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TFE</name>
    <description><![CDATA[Transmit FIFO empty]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CPSR</name>
    <description><![CDATA[Clock prescale register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CPSDVSR</name>
    <description><![CDATA[Clock prescale divisor]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IMSC</name>
    <description><![CDATA[Interrupt mask set and clear register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>TXIM</name>
    <description><![CDATA[Transmit FIFO interrupt mask]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RXIM</name>
    <description><![CDATA[Receive FIFO interrupt mask]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RTIM</name>
    <description><![CDATA[Receive timeout interrupt mask]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RORIM</name>
    <description><![CDATA[Receive overrun interrupt mask]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RIS</name>
    <description><![CDATA[Raw interrupt status register]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000008</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>TXRIS</name>
    <description><![CDATA[Raw interrupt state of transmit FIFO interrupt]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RXRIS</name>
    <description><![CDATA[Raw interrupt state of receive FIFO interrupt]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RTRIS</name>
    <description><![CDATA[Raw interrupt state of receive timeout interrupt]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RORRIS</name>
    <description><![CDATA[Raw interrupt state of receive overrun interrupt]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MIS</name>
    <description><![CDATA[Masked interrupt status register]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>TXMIS</name>
    <description><![CDATA[Masked interrupt state of transmit FIFO interrupt]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RXMIS</name>
    <description><![CDATA[Masked interrupt state of receive FIFO interrupt]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RTMIS</name>
    <description><![CDATA[Masked interrupt state of receive timeout interrupt]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RORMIS</name>
    <description><![CDATA[Masked interrupt state of receive overrun interrupt]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ICR</name>
    <description><![CDATA[Interrupt clear register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>RTIC</name>
    <description><![CDATA[Clear the receive timeout interrupt]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RORIC</name>
    <description><![CDATA[Clear the receive overrun interrupt]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DMACR</name>
    <description><![CDATA[DMA control register]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>TXDMAE</name>
    <description><![CDATA[Transmit DMA Enable]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RXDMAE</name>
    <description><![CDATA[Receive DMA Enable]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESERVED1</name>
    <description><![CDATA[SSP Reserved area]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TCR</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ITIP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ITOP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDR</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESERVED2</name>
    <description><![CDATA[SSP Reserved area]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID0</name>
    <description><![CDATA[Peripheral Identification 0]]></description>
    <addressOffset>0x00000FE0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000022</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PARTNUMBER0</name>
    <description><![CDATA[Identifies the peripheral]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID1</name>
    <description><![CDATA[Peripheral Identification 1]]></description>
    <addressOffset>0x00000FE4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000010</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DESIGNER0</name>
    <description><![CDATA[Identifies the designer (ARM)]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>PARTNUMBER1</name>
    <description><![CDATA[Identifies the peripheral]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID2</name>
    <description><![CDATA[Peripheral Identification 2]]></description>
    <addressOffset>0x00000FE8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000024</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>REVISION</name>
    <description><![CDATA[Peripheral revision]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>DESIGNER1</name>
    <description><![CDATA[Identifies the designer (ARM)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID3</name>
    <description><![CDATA[Peripheral Identification 3]]></description>
    <addressOffset>0x00000FEC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CONFIGURATION</name>
    <description><![CDATA[The configuration option of the SSP.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID0</name>
    <description><![CDATA[PrimeCell identification 0]]></description>
    <addressOffset>0x00000FF0</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID1</name>
    <description><![CDATA[PrimeCell identification 1]]></description>
    <addressOffset>0x00000FF4</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000F0</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID2</name>
    <description><![CDATA[PrimeCell identification 2]]></description>
    <addressOffset>0x00000FF8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000005</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID3</name>
    <description><![CDATA[PrimeCell identification 3]]></description>
    <addressOffset>0x00000FFC</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000B1</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
