zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>I2C0</name>
<description><![CDATA[Registers Fields should be considered STATIC unless otherwise noted (as DYNAMIC)]]></description>
<baseAddress>0x40002000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>SOAR</name>
    <description><![CDATA[I2C Slave Own Address
This register consists of seven address bits that identify this I2C device on the I2C bus.]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>OAR</name>
    <description><![CDATA[I2C slave own address
This field specifies bits A6 through A0 of the slave address.]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SSTAT</name>
    <description><![CDATA[I2C Slave Control/Status
This register functions as a control register when written, and a status register when read.]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>FBR</name>
    <description><![CDATA[First byte received
1: The first byte following the slave's own address has been received.
0: The first byte has not been received.
This bit is only valid when the RREQ bit is set and is automatically cleared when data has been read from the I2CSDR register.
Note: This bit is not used for slave transmit operations.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TREQ</name>
    <description><![CDATA[Transmit request
1: The I2C controller has been addressed as a slave transmitter and is using clock stretching to delay the master until data has been written to the I2CSDR register.
0: No outstanding transmit request.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RREQ</name>
    <description><![CDATA[Receive request
1: The I2C controller has outstanding receive data from the I2C master and is using clock stretching to delay the master until data has been read from the I2CSDR register.
0: No outstanding receive data]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SCTRL</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>DA</name>
    <description><![CDATA[Device active
0: Disables the I2C slave operation
1: Enables the I2C slave operation]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SDR</name>
    <description><![CDATA[I2C Slave Data
This register contains the data to be transmitted when in the Slave Transmit state, and the data received when in the Slave Receive state.]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[Data for transfer
This field contains the data for transfer during a slave receive or transmit operation.  When written this register is used to transmit data.  When read, this address returns the last data received.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SIMR</name>
    <description><![CDATA[I2C Slave Interrupt Mask
This register controls whether a raw interrupt is promoted to a controller interrupt.]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>STOPIM</name>
    <description><![CDATA[Stop condition interrupt mask
1: The STOP condition interrupt is sent to the interrupt controller when the STOPRIS bit in the I2CSRIS register is set.
0: The STOPRIS interrupt is supressed and not sent to the interrupt controller.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>STARTIM</name>
    <description><![CDATA[Start condition interrupt mask
1: The START condition interrupt is sent to the interrupt controller when the STARTRIS bit in the I2CSRIS register is set.
0: The STARTRIS interrupt is supressed and not sent to the interrupt controller.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATAIM</name>
    <description><![CDATA[Data interrupt mask
1: The data received or data requested interrupt is sent to the interrupt controller when the DATARIS bit in the I2CSRIS register is set.
0: The DATARIS interrupt is surpressed and not sent to the interrupt controller.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SRIS</name>
    <description><![CDATA[I2C Slave Raw Interrupt Status
This register specifies whether an interrupt is pending.]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>STOPRIS</name>
    <description><![CDATA[Stop condition raw interrupt status
1: A STOP condition interrupt is pending.
0: No interrupt
This bit is cleared by writing a 1 to the STOPIC bit in the I2CSICR register.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>STARTRIS</name>
    <description><![CDATA[Start condition raw interrupt status
1: A START condition interrupt is pending.
0: No interrupt
This bit is cleared by writing a 1 to the STARTIC bit in the I2CSICR register.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATARIS</name>
    <description><![CDATA[Data raw interrupt status
1: A data received or data requested interrupt is pending.
0: No interrupt
This bit is cleared by writing a 1 to the DATAIC bit in the I2CSICR register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMIS</name>
    <description><![CDATA[I2C Slave Masked Interrupt Status
This register specifies whether an interrupt was signaled.]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>STOPMIS</name>
    <description><![CDATA[Stop condition masked interrupt status
1: An unmasked STOP condition interrupt is pending.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing a 1 to the STOPIC bit in the I2CSICR register.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>STARTMIS</name>
    <description><![CDATA[Start condition masked interrupt status
1: An unmasked START condition interrupt is pending.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing a 1 to the STARTIC bit in the I2CSICR register.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATAMIS</name>
    <description><![CDATA[Data masked interrupt status
1: An unmasked data received or data requested interrupt is pending.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing a 1 to the DATAIC bit in the I2CSICR register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SICR</name>
    <description><![CDATA[I2C Slave Interrupt Clear
This register clears the raw interrupt. A read of this register returns no meaningful data.]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>STOPIC</name>
    <description><![CDATA[Stop condition interrupt clear
Writing 1 to this bit clears the STOPRIS bit in the I2CSRIS register and the STOPMIS bit in the I2CSMIS register.
A read of this register returns no meaningful data.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>STARTIC</name>
    <description><![CDATA[Start condition interrupt vlear
Writing 1 to this bit clears the STARTRIS bit in the I2CSRIS register and the STARTMIS bit in the I2CSMIS register.
A read of this register returns no meaningful data.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATAIC</name>
    <description><![CDATA[Data interrupt clear
Writing 1 to this bit clears the DATARIS bit in the I2CSRIS register and the DATAMIS bit in the I2CSMIS register.
A read of this register returns no meaningful data.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MSA</name>
    <description><![CDATA[This register consists of eight bits: seven address bits (A6-A0), and a Receive/Send bit, which
determines if the next operation is a Receive (High), or Transmit (Low).]]></description>
    <addressOffset>0x00000800</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SA</name>
    <description><![CDATA[I2C slave address]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>RS</name>
    <description><![CDATA[Receive and send
The R/S bit specifies if the next operation is a receive (high) or transmit (low).
0: Transmit
1: Receive]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MSTAT</name>
    <description><![CDATA[I2C Master Control/Status
This register accesses status bits when read and control bits when written. When read, the status register indicates the state of the I2C bus controller. When written, the control register configures the I2C controller
operation.
The START bit generates the START or REPEATED START condition. The STOP bit determines if the cycle stops at the end of the data cycle or continues on to a repeated START condition. To generate a single transmit cycle, the I2C Master Slave Address (I2CMSA) register is written with the desired address, the R/S bit is cleared, and this register is written with ACK=X (0 or 1), STOP=1, START=1, and
RUN=1 to perform the operation and stop. When the operation is completed (or aborted due an error), an interrupt becomes active and the data may be read from the I2CMDR register. When the I2C module operates in Master receiver mode, the ACK bit is normally set, causing the I2C bus controller to transmit an acknowledge automatically after each byte. This bit must be cleared when the I2C bus controller
requires no further data to be transmitted from the slave transmitter.]]></description>
    <addressOffset>0x00000804</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000020</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>BUSBSY</name>
    <description><![CDATA[Bus busy
0: The I2C bus is idle.
1: The I2C bus is busy.
The bit changes based on the START and STOP conditions.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>IDLE</name>
    <description><![CDATA[I2C idle
0: The I2C controller is not idle.
1: The I2C controller is idle.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>ARBLST</name>
    <description><![CDATA[Arbitration lost
0: The I2C controller won arbitration.
1: The I2C controller lost arbitration.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DATACK</name>
    <description><![CDATA[Acknowledge data
0: The transmited data was acknowledged.
1: The transmited data was not acknowledged.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ADRACK</name>
    <description><![CDATA[Acknowledge address
0: The transmited address was acknowledged.
1: The transmited address was not acknowledged.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>ERROR</name>
    <description><![CDATA[Error
0: No error was detected on the last operation.
1: An error occurred on the last operation.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[I2C busy
0: The controller is idle.
1: The controller is busy.
When the BUSY bit is set, the other status bits are not valid.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCTRL</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000804</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>ACK</name>
    <description><![CDATA[Data acknowledge enable
0: The received data byte is not acknowledged automatically by the master.
1: The received data byte is acknowledged automatically by the master.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>STOP</name>
    <description><![CDATA[Generate STOP
0: The controller does not generate the STOP condition.
1: The controller generates the STOP condition.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>START</name>
    <description><![CDATA[Generate START
0: The controller does not generate the START condition.
1: The controller generates the START condition.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RUN</name>
    <description><![CDATA[I2C master enable
0: The master is disabled.
1: The master is enabled to transmit or receive data.
When the BUSY bit is set, the other status bits are not valid.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDR</name>
    <description><![CDATA[I2C Master Data
This register contains the data to be transmitted when in the Master Transmit state and the data received when in the Master Receive state.]]></description>
    <addressOffset>0x00000808</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[When read: last RX Data is returned
When Written: Data is transferred during TX  transaction]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MTPR</name>
    <description><![CDATA[I2C Master Timer Period
This register specifies the period of the SCL clock.]]></description>
    <addressOffset>0x0000080C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TPR_7</name>
    <description><![CDATA[Must be written to '0' to set the TPR field]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TPR</name>
    <description><![CDATA[SCL clock period
This field specifies the period of the SCL clock.
SCL_PRD = 2 * (1+TPR)*(SCL_LP + SCL_HP)*CLK_PRD
where:
SCL_PRD is the SCL line period (I2C clock).
TPR is the timer period register value (range of 1 to 255)
SCL_LP is the SCL low period (fixed at 6).
SCL_HP is the SCL high period (fixed at 4).
CLK_PRD is the system clock period in ns.]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MIMR</name>
    <description><![CDATA[I2C Master Interrupt Mask
This register controls whether a raw interrupt is promoted to a controller interrupt.]]></description>
    <addressOffset>0x00000810</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>IM</name>
    <description><![CDATA[Interrupt mask
1: The master interrupt is sent to the interrupt controller when the RIS bit in the I2CMRIS register is set.
0: The RIS interrupt is suppressed and not sent to the interrupt controller.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MRIS</name>
    <description><![CDATA[I2C Master Raw Interrupt Status
This register specifies whether an interrupt is pending.]]></description>
    <addressOffset>0x00000814</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RIS</name>
    <description><![CDATA[Raw interrupt status
1: A master interrupt is pending.
0: No interrupt
This bit is cleared by writing 1 to the IC bit in the I2CMICR register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MMIS</name>
    <description><![CDATA[I2C Master Masked Interrupt Status
This register specifies whether an interrupt was signaled.]]></description>
    <addressOffset>0x00000818</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>MIS</name>
    <description><![CDATA[Masked interrupt status
1: An unmasked master interrupt is pending.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the IC bit in the I2CMICR register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MICR</name>
    <description><![CDATA[I2C Master Interrupt Clear
This register clears the raw and masked interrupts.]]></description>
    <addressOffset>0x0000081C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>IC</name>
    <description><![CDATA[Interrupt clear
Writing 1 to this bit clears the RIS bit in the I2CMRIS register and the MIS bit in the I2CMMIS register.
Reading this register returns no meaningful data.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
