zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MCR</name>
    <description><![CDATA[I2C Master Configuration
This register configures the mode (Master or Slave) and sets the interface for test mode loopback.]]></description>
    <addressOffset>0x00000820</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_RW</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>SFE</name>
    <description><![CDATA[I2C slave function enable
1: Slave mode is enabled.
0: Slave mode is disabled.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>MFE</name>
    <description><![CDATA[I2C master function enable
1: Master mode is enabled.
0: Master mode is disabled.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>LPBK</name>
    <description><![CDATA[I2C loopback
1: The controller in a test mode loopback configuration.
0: Normal operation]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>SEMAPHORE</name>
<description><![CDATA[MCU SEMAPHORE component]]></description>
<baseAddress>0x40084000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>SEMA0</name>
    <description><![CDATA[MCU SEMAPHORE 0]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken
Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA1</name>
    <description><![CDATA[MCU SEMAPHORE 1]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken
Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA2</name>
    <description><![CDATA[MCU SEMAPHORE 2]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken
Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA3</name>
    <description><![CDATA[MCU SEMAPHORE 3]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA4</name>
    <description><![CDATA[MCU SEMAPHORE 4]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA5</name>
    <description><![CDATA[MCU SEMAPHORE 5]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA6</name>
    <description><![CDATA[MCU SEMAPHORE 6]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA7</name>
    <description><![CDATA[MCU SEMAPHORE 7]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA8</name>
    <description><![CDATA[MCU SEMAPHORE 8]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA9</name>
    <description><![CDATA[MCU SEMAPHORE 9]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA10</name>
    <description><![CDATA[MCU SEMAPHORE 10]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA11</name>
    <description><![CDATA[MCU SEMAPHORE 11]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA12</name>
    <description><![CDATA[MCU SEMAPHORE 12]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA13</name>
    <description><![CDATA[MCU SEMAPHORE 13]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA14</name>
    <description><![CDATA[MCU SEMAPHORE 14]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA15</name>
    <description><![CDATA[MCU SEMAPHORE 15]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA16</name>
    <description><![CDATA[MCU SEMAPHORE 16]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA17</name>
    <description><![CDATA[MCU SEMAPHORE 17]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA18</name>
    <description><![CDATA[MCU SEMAPHORE 18]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA19</name>
    <description><![CDATA[MCU SEMAPHORE 19]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA20</name>
    <description><![CDATA[MCU SEMAPHORE 20]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA21</name>
    <description><![CDATA[MCU SEMAPHORE 21]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA22</name>
    <description><![CDATA[MCU SEMAPHORE 22]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA23</name>
    <description><![CDATA[MCU SEMAPHORE 23]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA24</name>
    <description><![CDATA[MCU SEMAPHORE 24]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA25</name>
    <description><![CDATA[MCU SEMAPHORE 25]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA26</name>
    <description><![CDATA[MCU SEMAPHORE 26]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA27</name>
    <description><![CDATA[MCU SEMAPHORE 27]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA28</name>
    <description><![CDATA[MCU SEMAPHORE 28]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA29</name>
    <description><![CDATA[MCU SEMAPHORE 29]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA30</name>
    <description><![CDATA[MCU SEMAPHORE 30]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEMA31</name>
    <description><![CDATA[MCU SEMAPHORE 31]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS0</name>
    <description><![CDATA[MCU SEMAPHORE 0 ALIAS]]></description>
    <addressOffset>0x00000800</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

