zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS1</name>
    <description><![CDATA[MCU SEMAPHORE 1 ALIAS]]></description>
    <addressOffset>0x00000804</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS2</name>
    <description><![CDATA[MCU SEMAPHORE 2 ALIAS]]></description>
    <addressOffset>0x00000808</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS3</name>
    <description><![CDATA[MCU SEMAPHORE 3 ALIAS]]></description>
    <addressOffset>0x0000080C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS4</name>
    <description><![CDATA[MCU SEMAPHORE 4 ALIAS]]></description>
    <addressOffset>0x00000810</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS5</name>
    <description><![CDATA[MCU SEMAPHORE 5 ALIAS]]></description>
    <addressOffset>0x00000814</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS6</name>
    <description><![CDATA[MCU SEMAPHORE 6 ALIAS]]></description>
    <addressOffset>0x00000818</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS7</name>
    <description><![CDATA[MCU SEMAPHORE 7 ALIAS]]></description>
    <addressOffset>0x0000081C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS8</name>
    <description><![CDATA[MCU SEMAPHORE 8 ALIAS]]></description>
    <addressOffset>0x00000820</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS9</name>
    <description><![CDATA[MCU SEMAPHORE 9 ALIAS]]></description>
    <addressOffset>0x00000824</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

