zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS10</name>
    <description><![CDATA[MCU SEMAPHORE 10 ALIAS]]></description>
    <addressOffset>0x00000828</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS11</name>
    <description><![CDATA[MCU SEMAPHORE 11 ALIAS]]></description>
    <addressOffset>0x0000082C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS12</name>
    <description><![CDATA[MCU SEMAPHORE 12 ALIAS]]></description>
    <addressOffset>0x00000830</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS13</name>
    <description><![CDATA[MCU SEMAPHORE 13 ALIAS]]></description>
    <addressOffset>0x00000834</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS14</name>
    <description><![CDATA[MCU SEMAPHORE 14 ALIAS]]></description>
    <addressOffset>0x00000838</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS15</name>
    <description><![CDATA[MCU SEMAPHORE 15 ALIAS]]></description>
    <addressOffset>0x0000083C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS16</name>
    <description><![CDATA[MCU SEMAPHORE 16 ALIAS]]></description>
    <addressOffset>0x00000840</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS17</name>
    <description><![CDATA[MCU SEMAPHORE 17 ALIAS]]></description>
    <addressOffset>0x00000844</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS18</name>
    <description><![CDATA[MCU SEMAPHORE 18 ALIAS]]></description>
    <addressOffset>0x00000848</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

