zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS19</name>
    <description><![CDATA[MCU SEMAPHORE 19 ALIAS]]></description>
    <addressOffset>0x0000084C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS20</name>
    <description><![CDATA[MCU SEMAPHORE 20 ALIAS]]></description>
    <addressOffset>0x00000850</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS21</name>
    <description><![CDATA[MCU SEMAPHORE 21 ALIAS]]></description>
    <addressOffset>0x00000854</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS22</name>
    <description><![CDATA[MCU SEMAPHORE 22 ALIAS]]></description>
    <addressOffset>0x00000858</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS23</name>
    <description><![CDATA[MCU SEMAPHORE 23 ALIAS]]></description>
    <addressOffset>0x0000085C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS24</name>
    <description><![CDATA[MCU SEMAPHORE 24 ALIAS]]></description>
    <addressOffset>0x00000860</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS25</name>
    <description><![CDATA[MCU SEMAPHORE 25 ALIAS]]></description>
    <addressOffset>0x00000864</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS26</name>
    <description><![CDATA[MCU SEMAPHORE 26 ALIAS]]></description>
    <addressOffset>0x00000868</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS27</name>
    <description><![CDATA[MCU SEMAPHORE 27 ALIAS]]></description>
    <addressOffset>0x0000086C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

