zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS28</name>
    <description><![CDATA[MCU SEMAPHORE 28 ALIAS]]></description>
    <addressOffset>0x00000870</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS29</name>
    <description><![CDATA[MCU SEMAPHORE 29 ALIAS]]></description>
    <addressOffset>0x00000874</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS30</name>
    <description><![CDATA[MCU SEMAPHORE 30 ALIAS]]></description>
    <addressOffset>0x00000878</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALIAS31</name>
    <description><![CDATA[MCU SEMAPHORE 31 ALIAS]]></description>
    <addressOffset>0x0000087C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Not used]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status when reading:
1: Semaphore is available
0: Semaphore is taken

Used for semaphore debugging. A read operation will not change register value. Register writing is not possible. ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>RF24_RAT</name>
<description><![CDATA[Component for rat register bank]]></description>
<baseAddress>0x40043000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000100</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>RATCFG</name>
    <description><![CDATA[Radio Timer Configuration]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>FRACRAT</name>
    <description><![CDATA[Fractional Radio Timer.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TIMEN</name>
    <description><![CDATA[Timer enable.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCOUNT</name>
    <description><![CDATA[Radio Timer Counter Value]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>COUNT</name>
    <description><![CDATA[Counter value. This is only writable when the timer counter has been disabled.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATADJ</name>
    <description><![CDATA[Radio Timer Adjust Register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ADJ</name>
    <description><![CDATA[Value to add to the timer at the next tick. The adjustment value is applied only once. Adjustments can only be performed while the timer is enabled.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATARMSET</name>
    <description><![CDATA[Capture Arm Register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ARM</name>
    <description><![CDATA[Arm Channel]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATARMCLR</name>
    <description><![CDATA[Capture Arm Clear Register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ARM</name>
    <description><![CDATA[Arm Channel]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATEVT</name>
    <description><![CDATA[Output Event Selector]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>OEVT7</name>
    <description><![CDATA[Output Event 7 Selector (ch id)]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>OEVT6</name>
    <description><![CDATA[Output Event 6 Selector (ch id)]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>OEVT5</name>
    <description><![CDATA[Output Event 5 Selector (ch id)]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>OEVT4</name>
    <description><![CDATA[Output Event 4 Selector (ch id)]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>OEVT3</name>
    <description><![CDATA[Output Event 3 Selector (ch id)]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>OEVT2</name>
    <description><![CDATA[Output Event 2 Selector (ch id)]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>OEVT1</name>
    <description><![CDATA[Output Event 1 Selector (ch id)]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>OEVT0</name>
    <description><![CDATA[Output Event 0 Selector (ch id)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATOUT</name>
    <description><![CDATA[Output Mode Configuration]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>OUT7</name>
    <description><![CDATA[Current state of output 7]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>OMODE7</name>
    <description><![CDATA[Output 7 mode (see OMODE0)]]></description>
    <bitRange>[30:28]</bitRange>
  </field>
  <field>
    <name>OUT6</name>
    <description><![CDATA[Current state of output 6]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>OMODE6</name>
    <description><![CDATA[Output 6 mode (see OMODE0)]]></description>
    <bitRange>[26:24]</bitRange>
  </field>
  <field>
    <name>OUT5</name>
    <description><![CDATA[Current state of output 5]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>OMODE5</name>
    <description><![CDATA[Output 5 mode (see OMODE0)]]></description>
    <bitRange>[22:20]</bitRange>
  </field>
  <field>
    <name>OUT4</name>
    <description><![CDATA[Current state of output 4]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>OMODE4</name>
    <description><![CDATA[Output 4 mode (see OMODE0)]]></description>
    <bitRange>[18:16]</bitRange>
  </field>
  <field>
    <name>OUT3</name>
    <description><![CDATA[Current state of output 3]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>OMODE3</name>
    <description><![CDATA[Output 3 mode (see OMODE0)]]></description>
    <bitRange>[14:12]</bitRange>
  </field>
  <field>
    <name>OUT2</name>
    <description><![CDATA[Current state of output 2]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>OMODE2</name>
    <description><![CDATA[Output 2 mode (see OMODE0)]]></description>
    <bitRange>[10:8]</bitRange>
  </field>
  <field>
    <name>OUT1</name>
    <description><![CDATA[Current state of output 1]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>OMODE1</name>
    <description><![CDATA[Output 1 mode (see OMODE0)]]></description>
    <bitRange>[6:4]</bitRange>
  </field>
  <field>
    <name>OUT0</name>
    <description><![CDATA[Current state of output 0]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>OMODE0</name>
    <description><![CDATA[Output 0 mode]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCOMP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RATCOMP</name>
    <description><![CDATA[Signed RAT-Compensate value]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH0CFG</name>
    <description><![CDATA[Timer Channel 0 Configuration]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH0SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH0INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH0MODE</name>
    <description><![CDATA[Channel mode. A mode change will automatically disarm the channel.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH1CFG</name>
    <description><![CDATA[Timer Channel 1 Configuration]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH1SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH1INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH1MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH2CFG</name>
    <description><![CDATA[Timer Channel 2 Configuration]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH2SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH2INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH2MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH3CFG</name>
    <description><![CDATA[Timer Channel 3 Configuration]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH3SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH3INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH3MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH4CFG</name>
    <description><![CDATA[Timer Channel 4 Configuration]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH4SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH4INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH4MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH5CFG</name>
    <description><![CDATA[Timer Channel 5 Configuration]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH5SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH5INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH5MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH6CFG</name>
    <description><![CDATA[Timer Channel 6 Configuration]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH6SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH6INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH6MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH7CFG</name>
    <description><![CDATA[Timer Channel 7 Configuration]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CH7SRC</name>
    <description><![CDATA[Identifier of the source used for capture]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>CH7INP</name>
    <description><![CDATA[Input mode]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CH7MODE</name>
    <description><![CDATA[Channel mode]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH0VAL</name>
    <description><![CDATA[Timer Channel 0 Capture/Compare Register]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH1VAL</name>
    <description><![CDATA[Timer Channel 1 Capture/Compare Register]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH2VAL</name>
    <description><![CDATA[Timer Channel 2 Capture/Compare Register]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH3VAL</name>
    <description><![CDATA[Timer Channel 3 Capture/Compare Register]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH4VAL</name>
    <description><![CDATA[Timer Channel 4 Capture/Compare Register]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH5VAL</name>
    <description><![CDATA[Timer Channel 5 Capture/Compare Register]]></description>
    <addressOffset>0x00000094</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH6VAL</name>
    <description><![CDATA[Timer Channel 6 Capture/Compare Register]]></description>
    <addressOffset>0x00000098</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RATCH7VAL</name>
    <description><![CDATA[Timer Channel 7 Capture/Compare Register]]></description>
    <addressOffset>0x0000009C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>VAL</name>
    <description><![CDATA[Capture/Compare value. Only writable when the channel is configured for compare mode. In compare mode; a write to this register will auto-arm the channel.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
