zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>RF24_TRC</name>
<description><![CDATA[Component for rfctrc register bank]]></description>
<baseAddress>0x40047000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000040</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>TRCCFG</name>
    <description><![CDATA[Tracer Configuration]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PRESCAL</name>
    <description><![CDATA[Data rate prescaler]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>TSCLR</name>
    <description><![CDATA[Writing  1 to this bit clears the TX timer]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TSEN</name>
    <description><![CDATA[Enables the Timestamp]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>CH3EN</name>
    <description><![CDATA[Enables CH3 traces]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CH2EN</name>
    <description><![CDATA[Enables CH2 traces]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>CH1EN</name>
    <description><![CDATA[Enables CH1 traces]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH1CMD</name>
    <description><![CDATA[Channel 1 Command Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH1PKTHDR</name>
    <description><![CDATA[Header Byte. Reverts back to 0 when ready to transmit. A Write starts a transmission sequence.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>CH1PARCNT</name>
    <description><![CDATA[Number of parameters to transmit. Reverts back to 0 when ready to transmit. A Write starts a transmission sequence.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH2CMD</name>
    <description><![CDATA[Channel 2 Command Register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH2PKTHDR</name>
    <description><![CDATA[Header Byte. Reverts back to 0 when ready to transmit. A Write starts a transmission sequence.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>CH2PARCNT</name>
    <description><![CDATA[Number of parameters to transmit. Reverts back to 0 when ready to transmit. A Write starts a transmission sequence.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH3CMD</name>
    <description><![CDATA[Channel 3 Command Register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH3PKTHDR</name>
    <description><![CDATA[Header Byte. Reverts back to 0 when ready to transmit. A Write starts a transmission sequence.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>CH3PARCNT</name>
    <description><![CDATA[Number of parameters to transmit. Reverts back to 0 when ready to transmit. A Write starts a transmission sequence.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH1PAR01</name>
    <description><![CDATA[Channel 1 Parameter 0/1 Register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CH1PAR1</name>
    <description><![CDATA[Parameter 1 for Channel 1]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH1PAR0</name>
    <description><![CDATA[Parameter 0 for Channel 1]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH2PAR01</name>
    <description><![CDATA[Channel 2 Parameter 0/1 Register]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CH2PAR1</name>
    <description><![CDATA[Parameter 1 for Channel 2]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH2PAR0</name>
    <description><![CDATA[Parameter 0 for Channel 2]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH3PAR01</name>
    <description><![CDATA[Channel 3 Parameter 0/1 Register]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CH3PAR1</name>
    <description><![CDATA[Parameter 1 for Channel 3]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH3PAR0</name>
    <description><![CDATA[Parameter 0 for Channel 3]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH1PAR23</name>
    <description><![CDATA[Channel 1 Parameter 2/3 Register]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CH1PAR3</name>
    <description><![CDATA[Parameter 3 for Channel 1]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH1PAR2</name>
    <description><![CDATA[Parameter 2 for Channel 1]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH2PAR23</name>
    <description><![CDATA[Channel 2 Parameter 2/3 Register]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CH2PAR3</name>
    <description><![CDATA[Parameter 3 for Channel 2]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH2PAR2</name>
    <description><![CDATA[Parameter 2 for Channel 2]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRCCH3PAR23</name>
    <description><![CDATA[Channel 3 Parameter 2/3 Register]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CH3PAR3</name>
    <description><![CDATA[Parameter 3 for Channel 3]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CH3PAR2</name>
    <description><![CDATA[Parameter 2 for Channel 3]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
