zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>RF24_PHA</name>
<description><![CDATA[Component for pha register bank]]></description>
<baseAddress>0x40042000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>PHAPOLY0</name>
    <description><![CDATA[LFSR 0 Polynomial Definition]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>POLY0</name>
    <description><![CDATA[LFSR 0 polynomial taps]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAPOLY1</name>
    <description><![CDATA[LFSR 1 Polynomial Definition]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>POLY1</name>
    <description><![CDATA[LFSR 1 polynomial taps]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHACFG</name>
    <description><![CDATA[Packet Handler Accelerator Config Register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>MODE1</name>
    <description><![CDATA[Dual LFSR operating mode]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>MODE0</name>
    <description><![CDATA[LFSR 0 operating mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHASTA</name>
    <description><![CDATA[Packet Handler Accelerator Status]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[Status busy flags.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0VAL</name>
    <description><![CDATA[LFSR 0 Current Value]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>LFSR0VAL</name>
    <description><![CDATA[LFSR 0 value]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1VAL</name>
    <description><![CDATA[LFSR 1 Current Value]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>LFSR1VAL</name>
    <description><![CDATA[LFSR 1 value]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0VALBR</name>
    <description><![CDATA[LFSR 0 Current Value]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>LFSR0VAL</name>
    <description><![CDATA[LFSR 0 value; bit reversed order]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1VALBR</name>
    <description><![CDATA[LFSR 1 Current Value]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>LFSR1VAL</name>
    <description><![CDATA[LFSR 1 value; bit reversed order]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAOUT0</name>
    <description><![CDATA[LFSR 0 Output]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>OUT0</name>
    <description><![CDATA[Output value of LFSR0]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAOUT0BR</name>
    <description><![CDATA[LFSR 0 Output]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>OUT0</name>
    <description><![CDATA[Output value of LFSR0 in bit reversed order]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAHAMENCIN</name>
    <description><![CDATA[PHA Hamming Encoder Input]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>HAMENCIN</name>
    <description><![CDATA[Data to be Hamming encoded]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAHAMENCOUT</name>
    <description><![CDATA[PHA Hamming Encoder Output]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>HAMENCOUT</name>
    <description><![CDATA[When read; the Hamming encoded value of HAMENCIN is returned]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAHAMDECIN</name>
    <description><![CDATA[PHA Hamming Decoder Input]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>HAMDECIN</name>
    <description><![CDATA[Data to be Hamming decoded]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHAHAMDECOUT</name>
    <description><![CDATA[PHA Hamming Decoder Output]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>HAMMERR1</name>
    <description><![CDATA[Uncorrected errors when decoding PHAHAMDECIN[15:8]]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>HAMMERR0</name>
    <description><![CDATA[Uncorrected errors when decoding PHAHAMDECIN[7:0]]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>HAMDECOUT</name>
    <description><![CDATA[When read; the decoded value of the HAMDECIN is returned]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL1</name>
    <description><![CDATA[LFSR 0 1-bit Input]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL2</name>
    <description><![CDATA[LFSR 0 2-bit Input]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL3</name>
    <description><![CDATA[LFSR 0 3-bit Input]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL4</name>
    <description><![CDATA[LFSR 0 4-bit Input]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL5</name>
    <description><![CDATA[LFSR 0 5-bit Input]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL6</name>
    <description><![CDATA[LFSR 0 6-bit Input]]></description>
    <addressOffset>0x00000114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL7</name>
    <description><![CDATA[LFSR 0 7-bit Input]]></description>
    <addressOffset>0x00000118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL8</name>
    <description><![CDATA[LFSR 0 8-bit Input]]></description>
    <addressOffset>0x0000011C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL9</name>
    <description><![CDATA[LFSR 0 9-bit Input]]></description>
    <addressOffset>0x00000120</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL10</name>
    <description><![CDATA[LFSR 0 10-bit Input]]></description>
    <addressOffset>0x00000124</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL11</name>
    <description><![CDATA[LFSR 0 11-bit Input]]></description>
    <addressOffset>0x00000128</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL12</name>
    <description><![CDATA[LFSR 0 12-bit Input]]></description>
    <addressOffset>0x0000012C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL13</name>
    <description><![CDATA[LFSR 0 13-bit Input]]></description>
    <addressOffset>0x00000130</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL14</name>
    <description><![CDATA[LFSR 0 14-bit Input]]></description>
    <addressOffset>0x00000134</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[13:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL15</name>
    <description><![CDATA[LFSR 0 15-bit Input]]></description>
    <addressOffset>0x00000138</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[14:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL16</name>
    <description><![CDATA[LFSR 0 16-bit Input]]></description>
    <addressOffset>0x0000013C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL17</name>
    <description><![CDATA[LFSR 0 17-bit Input]]></description>
    <addressOffset>0x00000140</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED17</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[16:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL18</name>
    <description><![CDATA[LFSR 0 18-bit Input]]></description>
    <addressOffset>0x00000144</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[17:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL19</name>
    <description><![CDATA[LFSR 0 19-bit Input]]></description>
    <addressOffset>0x00000148</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED19</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[18:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL20</name>
    <description><![CDATA[LFSR 0 20-bit Input]]></description>
    <addressOffset>0x0000014C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[19:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL21</name>
    <description><![CDATA[LFSR 0 21-bit Input]]></description>
    <addressOffset>0x00000150</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED21</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:21]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[20:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL22</name>
    <description><![CDATA[LFSR 0 22-bit Input]]></description>
    <addressOffset>0x00000154</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED22</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[21:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL23</name>
    <description><![CDATA[LFSR 0 23-bit Input]]></description>
    <addressOffset>0x00000158</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED23</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL24</name>
    <description><![CDATA[LFSR 0 24-bit Input]]></description>
    <addressOffset>0x0000015C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED24</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL25</name>
    <description><![CDATA[LFSR 0 25-bit Input]]></description>
    <addressOffset>0x00000160</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED25</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[24:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL26</name>
    <description><![CDATA[LFSR 0 26-bit Input]]></description>
    <addressOffset>0x00000164</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED26</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[25:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL27</name>
    <description><![CDATA[LFSR 0 27-bit Input]]></description>
    <addressOffset>0x00000168</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED27</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[26:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL28</name>
    <description><![CDATA[LFSR 0 28-bit Input]]></description>
    <addressOffset>0x0000016C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED28</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[27:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL29</name>
    <description><![CDATA[LFSR 0 29-bit Input]]></description>
    <addressOffset>0x00000170</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[28:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL30</name>
    <description><![CDATA[LFSR 0 30-bit Input]]></description>
    <addressOffset>0x00000174</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED30</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[29:0]</bitRange>
  </field>
</fields>
  </register>
