zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>PHALFSR0INL31</name>
    <description><![CDATA[LFSR 0 31-bit Input]]></description>
    <addressOffset>0x00000178</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED31</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[30:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INL32</name>
    <description><![CDATA[LFSR 0 32-bit Input]]></description>
    <addressOffset>0x0000017C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LFSR0IN</name>
    <description><![CDATA[LFSR 0 input value LSB first]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM1</name>
    <description><![CDATA[LFSR 0 1-bit Input]]></description>
    <addressOffset>0x00000180</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM2</name>
    <description><![CDATA[LFSR 0 2-bit Input]]></description>
    <addressOffset>0x00000184</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM3</name>
    <description><![CDATA[LFSR 0 3-bit Input]]></description>
    <addressOffset>0x00000188</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM4</name>
    <description><![CDATA[LFSR 0 4-bit Input]]></description>
    <addressOffset>0x0000018C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM5</name>
    <description><![CDATA[LFSR 0 5-bit Input]]></description>
    <addressOffset>0x00000190</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM6</name>
    <description><![CDATA[LFSR 0 6-bit Input]]></description>
    <addressOffset>0x00000194</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM7</name>
    <description><![CDATA[LFSR 0 7-bit Input]]></description>
    <addressOffset>0x00000198</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM8</name>
    <description><![CDATA[LFSR 0 8-bit Input]]></description>
    <addressOffset>0x0000019C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM9</name>
    <description><![CDATA[LFSR 0 9-bit Input]]></description>
    <addressOffset>0x000001A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM10</name>
    <description><![CDATA[LFSR 0 10-bit Input]]></description>
    <addressOffset>0x000001A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM11</name>
    <description><![CDATA[LFSR 0 11-bit Input]]></description>
    <addressOffset>0x000001A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM12</name>
    <description><![CDATA[LFSR 0 12-bit Input]]></description>
    <addressOffset>0x000001AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM13</name>
    <description><![CDATA[LFSR 0 13-bit Input]]></description>
    <addressOffset>0x000001B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM14</name>
    <description><![CDATA[LFSR 0 14-bit Input]]></description>
    <addressOffset>0x000001B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[13:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM15</name>
    <description><![CDATA[LFSR 0 15-bit Input]]></description>
    <addressOffset>0x000001B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[14:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM16</name>
    <description><![CDATA[LFSR 0 16-bit Input]]></description>
    <addressOffset>0x000001BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM17</name>
    <description><![CDATA[LFSR 0 17-bit Input]]></description>
    <addressOffset>0x000001C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED17</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[16:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM18</name>
    <description><![CDATA[LFSR 0 18-bit Input]]></description>
    <addressOffset>0x000001C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[17:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM19</name>
    <description><![CDATA[LFSR 0 19-bit Input]]></description>
    <addressOffset>0x000001C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED19</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[18:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM20</name>
    <description><![CDATA[LFSR 0 20-bit Input]]></description>
    <addressOffset>0x000001CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[19:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM21</name>
    <description><![CDATA[LFSR 0 21-bit Input]]></description>
    <addressOffset>0x000001D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED21</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:21]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[20:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM22</name>
    <description><![CDATA[LFSR 0 22-bit Input]]></description>
    <addressOffset>0x000001D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED22</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[21:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM23</name>
    <description><![CDATA[LFSR 0 23-bit Input]]></description>
    <addressOffset>0x000001D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED23</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM24</name>
    <description><![CDATA[LFSR 0 24-bit Input]]></description>
    <addressOffset>0x000001DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED24</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM25</name>
    <description><![CDATA[LFSR 0 25-bit Input]]></description>
    <addressOffset>0x000001E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED25</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[24:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM26</name>
    <description><![CDATA[LFSR 0 26-bit Input]]></description>
    <addressOffset>0x000001E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED26</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[25:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM27</name>
    <description><![CDATA[LFSR 0 27-bit Input]]></description>
    <addressOffset>0x000001E8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED27</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[26:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM28</name>
    <description><![CDATA[LFSR 0 28-bit Input]]></description>
    <addressOffset>0x000001EC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED28</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[27:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM29</name>
    <description><![CDATA[LFSR 0 29-bit Input]]></description>
    <addressOffset>0x000001F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[28:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM30</name>
    <description><![CDATA[LFSR 0 30-bit Input]]></description>
    <addressOffset>0x000001F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED30</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[29:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM31</name>
    <description><![CDATA[LFSR 0 31-bit Input]]></description>
    <addressOffset>0x000001F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED31</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[30:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR0INM32</name>
    <description><![CDATA[LFSR 0 32-bit Input]]></description>
    <addressOffset>0x000001FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LFSR0INR</name>
    <description><![CDATA[LFSR 0 input value MSB first]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL1</name>
    <description><![CDATA[LFSR 1 1-bit Input]]></description>
    <addressOffset>0x00000200</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL2</name>
    <description><![CDATA[LFSR 1 2-bit Input]]></description>
    <addressOffset>0x00000204</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL3</name>
    <description><![CDATA[LFSR 1 3-bit Input]]></description>
    <addressOffset>0x00000208</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL4</name>
    <description><![CDATA[LFSR 1 4-bit Input]]></description>
    <addressOffset>0x0000020C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL5</name>
    <description><![CDATA[LFSR 1 5-bit Input]]></description>
    <addressOffset>0x00000210</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL6</name>
    <description><![CDATA[LFSR 1 6-bit Input]]></description>
    <addressOffset>0x00000214</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL7</name>
    <description><![CDATA[LFSR 1 7-bit Input]]></description>
    <addressOffset>0x00000218</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL8</name>
    <description><![CDATA[LFSR 1 8-bit Input]]></description>
    <addressOffset>0x0000021C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL9</name>
    <description><![CDATA[LFSR 1 9-bit Input]]></description>
    <addressOffset>0x00000220</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL10</name>
    <description><![CDATA[LFSR 1 10-bit Input]]></description>
    <addressOffset>0x00000224</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
