zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>PHALFSR1INL11</name>
    <description><![CDATA[LFSR 1 11-bit Input]]></description>
    <addressOffset>0x00000228</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL12</name>
    <description><![CDATA[LFSR 1 12-bit Input]]></description>
    <addressOffset>0x0000022C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL13</name>
    <description><![CDATA[LFSR 1 13-bit Input]]></description>
    <addressOffset>0x00000230</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL14</name>
    <description><![CDATA[LFSR 1 14-bit Input]]></description>
    <addressOffset>0x00000234</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[13:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL15</name>
    <description><![CDATA[LFSR 1 15-bit Input]]></description>
    <addressOffset>0x00000238</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[14:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL16</name>
    <description><![CDATA[LFSR 1 16-bit Input]]></description>
    <addressOffset>0x0000023C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL17</name>
    <description><![CDATA[LFSR 1 17-bit Input]]></description>
    <addressOffset>0x00000240</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED17</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[16:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL18</name>
    <description><![CDATA[LFSR 1 18-bit Input]]></description>
    <addressOffset>0x00000244</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[17:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL19</name>
    <description><![CDATA[LFSR 1 19-bit Input]]></description>
    <addressOffset>0x00000248</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED19</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[18:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL20</name>
    <description><![CDATA[LFSR 1 20-bit Input]]></description>
    <addressOffset>0x0000024C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[19:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL21</name>
    <description><![CDATA[LFSR 1 21-bit Input]]></description>
    <addressOffset>0x00000250</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED21</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:21]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[20:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL22</name>
    <description><![CDATA[LFSR 1 22-bit Input]]></description>
    <addressOffset>0x00000254</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED22</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[21:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL23</name>
    <description><![CDATA[LFSR 1 23-bit Input]]></description>
    <addressOffset>0x00000258</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED23</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL24</name>
    <description><![CDATA[LFSR 1 24-bit Input]]></description>
    <addressOffset>0x0000025C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED24</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL25</name>
    <description><![CDATA[LFSR 1 25-bit Input]]></description>
    <addressOffset>0x00000260</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED25</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[24:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL26</name>
    <description><![CDATA[LFSR 1 26-bit Input]]></description>
    <addressOffset>0x00000264</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED26</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[25:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL27</name>
    <description><![CDATA[LFSR 1 27-bit Input]]></description>
    <addressOffset>0x00000268</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED27</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[26:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL28</name>
    <description><![CDATA[LFSR 1 28-bit Input]]></description>
    <addressOffset>0x0000026C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED28</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[27:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL29</name>
    <description><![CDATA[LFSR 1 29-bit Input]]></description>
    <addressOffset>0x00000270</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[28:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL30</name>
    <description><![CDATA[LFSR 1 30-bit Input]]></description>
    <addressOffset>0x00000274</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED30</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[29:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL31</name>
    <description><![CDATA[LFSR 1 31-bit Input]]></description>
    <addressOffset>0x00000278</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED31</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[30:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INL32</name>
    <description><![CDATA[LFSR 1 32-bit Input]]></description>
    <addressOffset>0x0000027C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LFSR1IN</name>
    <description><![CDATA[LFSR 1 input value LSB first]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM1</name>
    <description><![CDATA[LFSR 1 1-bit Input]]></description>
    <addressOffset>0x00000280</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM2</name>
    <description><![CDATA[LFSR 1 2-bit Input]]></description>
    <addressOffset>0x00000284</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM3</name>
    <description><![CDATA[LFSR 1 3-bit Input]]></description>
    <addressOffset>0x00000288</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM4</name>
    <description><![CDATA[LFSR 1 4-bit Input]]></description>
    <addressOffset>0x0000028C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM5</name>
    <description><![CDATA[LFSR 1 5-bit Input]]></description>
    <addressOffset>0x00000290</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM6</name>
    <description><![CDATA[LFSR 1 6-bit Input]]></description>
    <addressOffset>0x00000294</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM7</name>
    <description><![CDATA[LFSR 1 7-bit Input]]></description>
    <addressOffset>0x00000298</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM8</name>
    <description><![CDATA[LFSR 1 8-bit Input]]></description>
    <addressOffset>0x0000029C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM9</name>
    <description><![CDATA[LFSR 1 9-bit Input]]></description>
    <addressOffset>0x000002A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM10</name>
    <description><![CDATA[LFSR 1 10-bit Input]]></description>
    <addressOffset>0x000002A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM11</name>
    <description><![CDATA[LFSR 1 11-bit Input]]></description>
    <addressOffset>0x000002A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM12</name>
    <description><![CDATA[LFSR 1 12-bit Input]]></description>
    <addressOffset>0x000002AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM13</name>
    <description><![CDATA[LFSR 1 13-bit Input]]></description>
    <addressOffset>0x000002B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM14</name>
    <description><![CDATA[LFSR 1 14-bit Input]]></description>
    <addressOffset>0x000002B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[13:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM15</name>
    <description><![CDATA[LFSR 1 15-bit Input]]></description>
    <addressOffset>0x000002B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[14:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM16</name>
    <description><![CDATA[LFSR 1 16-bit Input]]></description>
    <addressOffset>0x000002BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM17</name>
    <description><![CDATA[LFSR 1 17-bit Input]]></description>
    <addressOffset>0x000002C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED17</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[16:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM18</name>
    <description><![CDATA[LFSR 1 18-bit Input]]></description>
    <addressOffset>0x000002C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[17:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM19</name>
    <description><![CDATA[LFSR 1 19-bit Input]]></description>
    <addressOffset>0x000002C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED19</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[18:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM20</name>
    <description><![CDATA[LFSR 1 20-bit Input]]></description>
    <addressOffset>0x000002CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[19:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM21</name>
    <description><![CDATA[LFSR 1 21-bit Input]]></description>
    <addressOffset>0x000002D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED21</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:21]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[20:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM22</name>
    <description><![CDATA[LFSR 1 22-bit Input]]></description>
    <addressOffset>0x000002D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED22</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[21:0]</bitRange>
  </field>
</fields>
  </register>
