zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>PHALFSR1INM23</name>
    <description><![CDATA[LFSR 1 23-bit Input]]></description>
    <addressOffset>0x000002D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED23</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[22:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM24</name>
    <description><![CDATA[LFSR 1 24-bit Input]]></description>
    <addressOffset>0x000002DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED24</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM25</name>
    <description><![CDATA[LFSR 1 25-bit Input]]></description>
    <addressOffset>0x000002E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED25</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[24:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM26</name>
    <description><![CDATA[LFSR 1 26-bit Input]]></description>
    <addressOffset>0x000002E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED26</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[25:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM27</name>
    <description><![CDATA[LFSR 1 27-bit Input]]></description>
    <addressOffset>0x000002E8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED27</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[26:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM28</name>
    <description><![CDATA[LFSR 1 28-bit Input]]></description>
    <addressOffset>0x000002EC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED28</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[27:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM29</name>
    <description><![CDATA[LFSR 1 29-bit Input]]></description>
    <addressOffset>0x000002F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[28:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM30</name>
    <description><![CDATA[LFSR 1 30-bit Input]]></description>
    <addressOffset>0x000002F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED30</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[29:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM31</name>
    <description><![CDATA[LFSR 1 31-bit Input]]></description>
    <addressOffset>0x000002F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED31</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[30:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PHALFSR1INM32</name>
    <description><![CDATA[LFSR 1 32-bit Input]]></description>
    <addressOffset>0x000002FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>LFSR1INR</name>
    <description><![CDATA[LFSR 1 input value MSB first]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>RF24_DBELL</name>
<description><![CDATA[Component for rdbell register bank]]></description>
<baseAddress>0x40041000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000040</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CMDR</name>
    <description><![CDATA[Doorbell Command Register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CMD</name>
    <description><![CDATA[Command register. Raises IRQ to Radio CPU upon write.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CMDSTA</name>
    <description><![CDATA[Doorbell Command Status Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Status of the last command used]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFHWIFG</name>
    <description><![CDATA[Interrupt Flags From RF HW Modules]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>RATCH7</name>
    <description><![CDATA[Radio timer channel 7 interrupt flag]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>RATCH6</name>
    <description><![CDATA[Radio timer channel 6 interrupt flag]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>RATCH5</name>
    <description><![CDATA[Radio timer channel 5 interrupt flag]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>RATCH4</name>
    <description><![CDATA[Radio timer channel 4 interrupt flag]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RATCH3</name>
    <description><![CDATA[Radio timer channel 3 interrupt flag]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>RATCH2</name>
    <description><![CDATA[Radio timer channel 2 interrupt flag]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>RATCH1</name>
    <description><![CDATA[Radio timer channel 1 interrupt flag]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RATCH0</name>
    <description><![CDATA[Radio timer channel 0 interrupt flag]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>RFESOFT2</name>
    <description><![CDATA[RFE soft defined interrupt 2 flag]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>RFESOFT1</name>
    <description><![CDATA[RFE soft defined interrupt 1 flag]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>RFESOFT0</name>
    <description><![CDATA[RFE soft defined interrupt 0 flag]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>RFEDONE</name>
    <description><![CDATA[RFE done interrupt flag]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TRCTK</name>
    <description><![CDATA[Debug tracer system tick interrupt flag]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>MDMSOFT</name>
    <description><![CDATA[Modem soft defined interrupt flag]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>MDMOUT</name>
    <description><![CDATA[Modem FIFO output interrupt flag]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MDMIN</name>
    <description><![CDATA[Modem FIFO input interrupt flag]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>MDMDONE</name>
    <description><![CDATA[Modem done interrupt flag]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>FSCA</name>
    <description><![CDATA[FSCA interrupt flag]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFHWIEN</name>
    <description><![CDATA[Interrupt Enable For Interrupts From RF HW Modules]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>RATCH7</name>
    <description><![CDATA[Radio timer channel 7 interrupt enable]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>RATCH6</name>
    <description><![CDATA[Radio timer channel 6 interrupt enable]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>RATCH5</name>
    <description><![CDATA[Radio timer channel 5 interrupt enable]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>RATCH4</name>
    <description><![CDATA[Radio timer channel 4 interrupt enable]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RATCH3</name>
    <description><![CDATA[Radio timer channel 3 interrupt enable]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>RATCH2</name>
    <description><![CDATA[Radio timer channel 2 interrupt enable]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>RATCH1</name>
    <description><![CDATA[Radio timer channel 1 interrupt enable]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>RATCH0</name>
    <description><![CDATA[Radio timer channel 0 interrupt enable]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>RFESOFT2</name>
    <description><![CDATA[RFE soft defined interrupt 2 enable]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>RFESOFT1</name>
    <description><![CDATA[RFE soft defined interrupt 1 enable]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>RFESOFT0</name>
    <description><![CDATA[RFE soft defined interrupt 0 enable]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>RFEDONE</name>
    <description><![CDATA[RFE done interrupt enable]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TRCTK</name>
    <description><![CDATA[Debug tracer system tick interrupt enable]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>MDMSOFT</name>
    <description><![CDATA[Modem soft defined interrupt enable]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>MDMOUT</name>
    <description><![CDATA[Modem FIFO output interrupt enable]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MDMIN</name>
    <description><![CDATA[Modem FIFO input interrupt enable]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>MDMDONE</name>
    <description><![CDATA[Modem done interrupt enable]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>FSCA</name>
    <description><![CDATA[FSCA interrupt enable]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCPEIFG</name>
    <description><![CDATA[Interrupt Flags For CPE Generated Interrupts]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>IRQ31</name>
    <description><![CDATA[CPE generated interrupt 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IRQ30</name>
    <description><![CDATA[CPE generated interrupt 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IRQ29</name>
    <description><![CDATA[CPE generated interrupt 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>IRQ28</name>
    <description><![CDATA[CPE generated interrupt 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>IRQ27</name>
    <description><![CDATA[CPE generated interrupt 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>IRQ26</name>
    <description><![CDATA[CPE generated interrupt 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>IRQ25</name>
    <description><![CDATA[CPE generated interrupt 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>IRQ24</name>
    <description><![CDATA[CPE generated interrupt 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>IRQ23</name>
    <description><![CDATA[CPE generated interrupt 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IRQ22</name>
    <description><![CDATA[CPE generated interrupt 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>IRQ21</name>
    <description><![CDATA[CPE generated interrupt 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>IRQ20</name>
    <description><![CDATA[CPE generated interrupt 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>IRQ19</name>
    <description><![CDATA[CPE generated interrupt 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>IRQ18</name>
    <description><![CDATA[CPE generated interrupt 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>IRQ17</name>
    <description><![CDATA[CPE generated interrupt 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>IRQ16</name>
    <description><![CDATA[CPE generated interrupt 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>IRQ15</name>
    <description><![CDATA[CPE generated interrupt 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IRQ14</name>
    <description><![CDATA[CPE generated interrupt 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>IRQ13</name>
    <description><![CDATA[CPE generated interrupt 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>IRQ12</name>
    <description><![CDATA[CPE generated interrupt 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>IRQ11</name>
    <description><![CDATA[CPE generated interrupt 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>IRQ10</name>
    <description><![CDATA[CPE generated interrupt 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>IRQ9</name>
    <description><![CDATA[CPE generated interrupt 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>IRQ8</name>
    <description><![CDATA[CPE generated interrupt 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>IRQ7</name>
    <description><![CDATA[CPE generated interrupt 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IRQ6</name>
    <description><![CDATA[CPE generated interrupt 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>IRQ5</name>
    <description><![CDATA[CPE generated interrupt 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>IRQ4</name>
    <description><![CDATA[CPE generated interrupt 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>IRQ3</name>
    <description><![CDATA[CPE generated interrupt 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>IRQ2</name>
    <description><![CDATA[CPE generated interrupt 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>IRQ1</name>
    <description><![CDATA[CPE generated interrupt 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>IRQ0</name>
    <description><![CDATA[CPE generated interrupt 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCPEIEN</name>
    <description><![CDATA[Interrupt Enable For CPE Generated Interrupts]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFFFFFF</resetValue>
<fields>
  <field>
    <name>IRQ31</name>
    <description><![CDATA[CPE generated interrupt 31 enable]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IRQ30</name>
    <description><![CDATA[CPE generated interrupt 30 enable]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IRQ29</name>
    <description><![CDATA[CPE generated interrupt 29 enable]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>IRQ28</name>
    <description><![CDATA[CPE generated interrupt 28 enable]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>IRQ27</name>
    <description><![CDATA[CPE generated interrupt 27 enable]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>IRQ26</name>
    <description><![CDATA[CPE generated interrupt 26 enable]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>IRQ25</name>
    <description><![CDATA[CPE generated interrupt 25 enable]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>IRQ24</name>
    <description><![CDATA[CPE generated interrupt 24 enable]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>IRQ23</name>
    <description><![CDATA[CPE generated interrupt 23 enable]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IRQ22</name>
    <description><![CDATA[CPE generated interrupt 22 enable]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>IRQ21</name>
    <description><![CDATA[CPE generated interrupt 21 enable]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>IRQ20</name>
    <description><![CDATA[CPE generated interrupt 20 enable]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>IRQ19</name>
    <description><![CDATA[CPE generated interrupt 19 enable]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>IRQ18</name>
    <description><![CDATA[CPE generated interrupt 18 enable]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>IRQ17</name>
    <description><![CDATA[CPE generated interrupt 17 enable]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>IRQ16</name>
    <description><![CDATA[CPE generated interrupt 16 enable]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>IRQ15</name>
    <description><![CDATA[CPE generated interrupt 15 enable]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IRQ14</name>
    <description><![CDATA[CPE generated interrupt 14 enable]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>IRQ13</name>
    <description><![CDATA[CPE generated interrupt 13 enable]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>IRQ12</name>
    <description><![CDATA[CPE generated interrupt 12 enable]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>IRQ11</name>
    <description><![CDATA[CPE generated interrupt 11 enable]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>IRQ10</name>
    <description><![CDATA[CPE generated interrupt 10 enable]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>IRQ9</name>
    <description><![CDATA[CPE generated interrupt 9 enable]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>IRQ8</name>
    <description><![CDATA[CPE generated interrupt 8 enable]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>IRQ7</name>
    <description><![CDATA[CPE generated interrupt 7 enable]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IRQ6</name>
    <description><![CDATA[CPE generated interrupt 6 enable]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>IRQ5</name>
    <description><![CDATA[CPE generated interrupt 5 enable]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>IRQ4</name>
    <description><![CDATA[CPE generated interrupt 4 enable]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>IRQ3</name>
    <description><![CDATA[CPE generated interrupt 3 enable]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>IRQ2</name>
    <description><![CDATA[CPE generated interrupt 2 enable]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>IRQ1</name>
    <description><![CDATA[CPE generated interrupt 1 enable]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>IRQ0</name>
    <description><![CDATA[CPE generated interrupt 0 enable]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
