zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>RFCPEISL</name>
    <description><![CDATA[Interrupt Vector Selection For CPE Generated Interrupts]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFF0000</resetValue>
<fields>
  <field>
    <name>IRQ31</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IRQ30</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IRQ29</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>IRQ28</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>IRQ27</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>IRQ26</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>IRQ25</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>IRQ24</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>IRQ23</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IRQ22</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>IRQ21</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>IRQ20</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>IRQ19</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>IRQ18</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>IRQ17</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>IRQ16</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>IRQ15</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IRQ14</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>IRQ13</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>IRQ12</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>IRQ11</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>IRQ10</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>IRQ9</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>IRQ8</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>IRQ7</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IRQ6</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>IRQ5</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>IRQ4</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>IRQ3</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>IRQ2</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>IRQ1</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>IRQ0</name>
    <description><![CDATA[Interrupt vector select for CPE generated interrupt 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFACKIFG</name>
    <description><![CDATA[Doorbell Command Acknowledgement Interrupt Flag]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ACKFLAG</name>
    <description><![CDATA[Interrupt flag for Command ACK]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYSGPOCTRL</name>
    <description><![CDATA[RF Core General Purpose Output Control]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>GPOCTRL3</name>
    <description><![CDATA[GPO control bit 3. Selects which signal to output on the GPO line.]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>GPOCTRL2</name>
    <description><![CDATA[GPO control bit 2. Selects which signal to output on the GPO line.]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>GPOCTRL1</name>
    <description><![CDATA[GPO control bit 1. Selects which signal to output on the GPO line.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>GPOCTRL0</name>
    <description><![CDATA[GPO control bit 0. Selects which signal to output on the GPO line.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCIDLESTATUS</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>IDLE</name>
    <description><![CDATA[The RF Core is IDLE and can be switched off]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
