zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>RF24_S2R</name>
<description><![CDATA[Component for s2r register bank]]></description>
<baseAddress>0x40048000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000010</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>S2RCFG</name>
    <description><![CDATA[Sample2RAM Config Register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>TRIGGER</name>
    <description><![CDATA[Trigger a new sample capture (or arm it if the trigger mode is trigger on event)]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TRIGGERMODE</name>
    <description><![CDATA[Trigger mode]]></description>
    <bitRange>[4:3]</bitRange>
  </field>
  <field>
    <name>SELECT</name>
    <description><![CDATA[Select sample source]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>ENABLED</name>
    <description><![CDATA[Sample2RAM module enable]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>S2RSTART</name>
    <description><![CDATA[Sample2RAM Start Address Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>START</name>
    <description><![CDATA[Memory start address for where to dump the samples. A custom; unified 32-bit word oriented memory map is used; MCERAM at 0-511; RFERAM at 512-1023; CPERAM at 1024-2047.]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>S2RSTOP</name>
    <description><![CDATA[Sample2RAM Stop Address Register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>STOP</name>
    <description><![CDATA[Memory stop address for where to dump the samples. A custom; unified 32-bit word oriented memory map is used; MCERAM at 0-511; RFERAM at 512-1023; CPERAM at 1024-2047.]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>S2RON</name>
    <description><![CDATA[Sample2RAM Status Register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x07FF0000</resetValue>
<fields>
  <field>
    <name>RESERVED27</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>ADDRCNT</name>
    <description><![CDATA[Current address counter value]]></description>
    <bitRange>[26:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[15:1]</bitRange>
  </field>
  <field>
    <name>RUNNING</name>
    <description><![CDATA[S2R running status]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>RF24_PWR</name>
<description><![CDATA[Component for rfcpwm register bank]]></description>
<baseAddress>0x40040000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000004</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>PWMCLKENABLE</name>
    <description><![CDATA[RF Core Clock Enable]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>RFCTRC</name>
    <description><![CDATA[Enable clk to RFCTRC]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>FSCA</name>
    <description><![CDATA[Enable clk to FSCA]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PHA</name>
    <description><![CDATA[Enable clk to PHA]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RAT</name>
    <description><![CDATA[Enable clk to RAT]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RFERAM</name>
    <description><![CDATA[Enable clk to RFERAM]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RFE</name>
    <description><![CDATA[Enable clk to RFE]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>MDMRAM</name>
    <description><![CDATA[Enable clk to MDMRAM]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MDM</name>
    <description><![CDATA[Enable clk to MDM]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CPERAM</name>
    <description><![CDATA[Enable clk to CPERAM]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CPE</name>
    <description><![CDATA[Enable hclk into CPE and CPEROM]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[Enable interconnect; DBELL; and sclk for CPE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>RF24_MDM</name>
<description><![CDATA[Component for mdm register bank]]></description>
<baseAddress>0x40045000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>MDMENABLE</name>
    <description><![CDATA[Modem Enable Register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>VITACC</name>
    <description><![CDATA[Enables the Viterbi Accelator]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>ADCDIG</name>
    <description><![CDATA[Enables the ADC Digital interface]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SMI</name>
    <description><![CDATA[Enables the Serial Modem Interface]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DEMODULATOR</name>
    <description><![CDATA[Enables the Demodulator]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MODULATOR</name>
    <description><![CDATA[Enables the Modulator]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TIMEBASE</name>
    <description><![CDATA[Enables the Modem Timebase]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TXRXFIFO</name>
    <description><![CDATA[Enables the TX/RX FIFO]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TOPSM</name>
    <description><![CDATA[Enables the TOPsm (MCE)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMINIT</name>
    <description><![CDATA[Modem Initialize Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>VITACC</name>
    <description><![CDATA[Synch reset Viterbi Accelator]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>ADCDIG</name>
    <description><![CDATA[Synch reset ADC Digital interface]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SMI</name>
    <description><![CDATA[Synch reset Serial Modem Interface]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DEMODULATOR</name>
    <description><![CDATA[Synch reset Demodulator]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MODULATOR</name>
    <description><![CDATA[Synch reset Modulator]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TIMEBASE</name>
    <description><![CDATA[Synch reset Modem Timebase]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TXRXFIFO</name>
    <description><![CDATA[Synch reset TX/RX FIFO]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TOPSM</name>
    <description><![CDATA[Synch reset TOPsm (MCE)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMPDREQ</name>
    <description><![CDATA[Modem Power Down Request Register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>TOPSMPDREQ</name>
    <description><![CDATA[Requests power-down for TOPsm core]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMENABLE0</name>
    <description><![CDATA[Demodulator Enable Register 0]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>FE23</name>
    <description><![CDATA[Enables the FEC 2/3 module]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>FE13</name>
    <description><![CDATA[Enables the FEC 1/3 module]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>FELP</name>
    <description><![CDATA[Enables the FrontEnd Low Pass filter]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>THRD</name>
    <description><![CDATA[Enables the threshold decision module]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>FRAC</name>
    <description><![CDATA[Enables the fractional resampler]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>FIDC</name>
    <description><![CDATA[Enables the fine DC estimator]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CHFI</name>
    <description><![CDATA[Enables the channel filter]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>BDEC</name>
    <description><![CDATA[Enables the cascaded dec-by-2 stages]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>IQMC</name>
    <description><![CDATA[Enables the IQ complex multiplier]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>MGE2</name>
    <description><![CDATA[Enables the magnitude estimator engine #2]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>MGE1</name>
    <description><![CDATA[Enables the magnitude estimator engine #1]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>CODC</name>
    <description><![CDATA[Enables the coarse DC estimator]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CMI4</name>
    <description><![CDATA[Enables the 1/4 complex mixer]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CMIX</name>
    <description><![CDATA[Enables the N/1024 complex mixer]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>HILB</name>
    <description><![CDATA[Enables the Hilbert filter]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMENABLE1</name>
    <description><![CDATA[Demodulator Enable Register 1]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VITE</name>
    <description><![CDATA[Enables the Viterbi module]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>MLSE</name>
    <description><![CDATA[Enables the MLSE module]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>SOFD</name>
    <description><![CDATA[Enables the soft decision module]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>SWQU</name>
    <description><![CDATA[Enables the sync word qualifier]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>MAFC</name>
    <description><![CDATA[Enables the manual frequencycompensation]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>MAFI</name>
    <description><![CDATA[Enables the mathced filter]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>FIFE</name>
    <description><![CDATA[Enables the fine frequency offset estimator]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PDIF</name>
    <description><![CDATA[Enables the phase differentiation]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>CA2P</name>
    <description><![CDATA[Enables the cart 2 polar conversion]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>FECP</name>
    <description><![CDATA[Enables the fecp module]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>FEC5</name>
    <description><![CDATA[Enables the fec5 module]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>C1BE</name>
    <description><![CDATA[Enables the 1b correlation engine]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LQIE</name>
    <description><![CDATA[Enables the LQI engine]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>F4BA</name>
    <description><![CDATA[Enables the clock-domain crossing fifo]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>STIM</name>
    <description><![CDATA[Enables the symbol timing tracker]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DSBU</name>
    <description><![CDATA[Enables the dynamic sample buffer]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMINIT0</name>
    <description><![CDATA[Demodulator Initialize Register 0]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>FE23</name>
    <description><![CDATA[Synch reset FEC 2/3 module]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>FE13</name>
    <description><![CDATA[Synch reset FEC 1/3 module]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>FELP</name>
    <description><![CDATA[Synch reset FrontEnd Low Pass filter]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>THRD</name>
    <description><![CDATA[Synch reset threshold decision module]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>FRAC</name>
    <description><![CDATA[Synch reset fractional resampler]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>FIDC</name>
    <description><![CDATA[Synch reset fine DC estimator]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CHFI</name>
    <description><![CDATA[Synch reset channel filter]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>BDEC</name>
    <description><![CDATA[Synch reset cascaded dec-by-2 stages]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>IQMC</name>
    <description><![CDATA[Synch reset IQ complex multiplier]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>MGE2</name>
    <description><![CDATA[Synch reset magnitude estimator engine #2]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>MGE1</name>
    <description><![CDATA[Synch reset magnitude estimator engine #1]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>CODC</name>
    <description><![CDATA[Synch reset coarse DC estimator]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CMI4</name>
    <description><![CDATA[Synch reset 1/4 complex mixer]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CMIX</name>
    <description><![CDATA[Synch reset N/1024 complex mixer]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>HILB</name>
    <description><![CDATA[Synch reset Hilbert filter]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMINIT1</name>
    <description><![CDATA[Demodulator Initialize Register 1]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VITE</name>
    <description><![CDATA[Synch reset Viterbi Module]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>MLSE</name>
    <description><![CDATA[Synch reset MLSE module]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>SOFD</name>
    <description><![CDATA[Synch reset soft decision module]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>SWQU</name>
    <description><![CDATA[Synch reset sync word qualifyer]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>MAFC</name>
    <description><![CDATA[Synch reset manual frequency compensation]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>MAFI</name>
    <description><![CDATA[Synch reset mathced filter]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>FIFE</name>
    <description><![CDATA[Synch reset fine frequency offset estimator]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PDIF</name>
    <description><![CDATA[Synch reset phase differentiation]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>CA2P</name>
    <description><![CDATA[Synch reset cart 2 polar conversion]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>FECP</name>
    <description><![CDATA[Synch reset fecp module]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>FEC5</name>
    <description><![CDATA[Synch reset fec5 module]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>C1BE</name>
    <description><![CDATA[Synch reset 1b correlation engine]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>LQIE</name>
    <description><![CDATA[Synch reset LQI engine]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>F4BA</name>
    <description><![CDATA[Synch reset clock-domain crossing fifo]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>STIM</name>
    <description><![CDATA[Synch reset symbol timing tracker]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DSBU</name>
    <description><![CDATA[Synch reset dynamic sample buffer]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCESTROBES0</name>
    <description><![CDATA[Modem Command Engine (MCE) Strobe Register 0]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>VITACCSTART</name>
    <description><![CDATA[Viterbi Accelerator Start]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>MLSETERM</name>
    <description><![CDATA[Terminate MLSE unit]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>EVENT3</name>
    <description><![CDATA[FW defined RAT event and IRQ]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>EVENT2</name>
    <description><![CDATA[FW defined RAT event and IRQ]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>EVENT1</name>
    <description><![CDATA[FW defined RAT event and IRQ]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>EVENT0</name>
    <description><![CDATA[FW defined RAT event and IRQ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>MCETIMBALIGN</name>
    <description><![CDATA[Align the 1baud to the next 4baud event]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>DSBURESTART</name>
    <description><![CDATA[Restart DSBU]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CMDDONE</name>
    <description><![CDATA[Signal command done to CPE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
