zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MCESTROBES1</name>
    <description><![CDATA[Modem Command Engine (MCE) Strobe Register 1]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>C1BEPEAKABCMD</name>
    <description><![CDATA[Restart peak A and B search]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>C1BEPEAKCCMD</name>
    <description><![CDATA[Restart peak C search]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>C1BEPEAKBCMD</name>
    <description><![CDATA[Restart peak B search]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>C1BEPEAKACMD</name>
    <description><![CDATA[Restart peak A search]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>C1BEADVANCECMD</name>
    <description><![CDATA[Speed up correlator autocopy]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>C1BESTALLCMD</name>
    <description><![CDATA[Slow down correlator autocopy]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>C1BEROTCMD</name>
    <description><![CDATA[Correlator rotate command]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>C1BECOPYCMD</name>
    <description><![CDATA[Copy shift reg A to shift reg B]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENT0</name>
    <description><![CDATA[MCE Event Flag Register 0]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENT</name>
    <description><![CDATA[Event flags for timer; timebase and fifo events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENT1</name>
    <description><![CDATA[MCE Event Flag Register 1]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENT</name>
    <description><![CDATA[Event flags for modulator events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENT2</name>
    <description><![CDATA[MCE Event Flag Register 2]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENT</name>
    <description><![CDATA[Event flags for demodulator events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENTMSK0</name>
    <description><![CDATA[MCE Event Mask Register 0]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTMSK</name>
    <description><![CDATA[Event mask for timer; timebase and fifo events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENTMSK1</name>
    <description><![CDATA[MCE Event Mask Register 1]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTMSK</name>
    <description><![CDATA[Event mask for modulator events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENTMSK2</name>
    <description><![CDATA[MCE Event Mask Register 2]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTMSK</name>
    <description><![CDATA[Event mask for demodulator events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENTCLR0</name>
    <description><![CDATA[MCE Event Clear Register 0]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTCLR</name>
    <description><![CDATA[Clear event flag for timer; timebase and fifo events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENTCLR1</name>
    <description><![CDATA[MCE Event Clear Register 1]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTCLR</name>
    <description><![CDATA[Clear event flag for modulator events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEEVENTCLR2</name>
    <description><![CDATA[MCE Event Clear Register 2]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTCLR</name>
    <description><![CDATA[Clear event flag for demodulator events]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCEPROGRAMSRC</name>
    <description><![CDATA[MCE Program Source Configuration]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>ROMBANK</name>
    <description><![CDATA[MCE ROM configuration]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>RAMROM</name>
    <description><![CDATA[Map MCE RAM as ROM]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMAPI</name>
    <description><![CDATA[Modem API Command Register]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PROTOCOLID</name>
    <description><![CDATA[Protocol ID]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>MDMCMD</name>
    <description><![CDATA[Modem command]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMCMDPAR0</name>
    <description><![CDATA[Modem Command Parameter 0]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR0</name>
    <description><![CDATA[Parameter 0]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMCMDPAR1</name>
    <description><![CDATA[Modem Command Parameter 1]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR1</name>
    <description><![CDATA[Parameter 1]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMCMDPAR2</name>
    <description><![CDATA[Modem Command Parameter 2]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR</name>
    <description><![CDATA[Parameter 2]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMRFCHANNEL</name>
    <description><![CDATA[Modem RF Channel Register]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[RF channel in MHz (i.e. 2432)]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMSTATUS</name>
    <description><![CDATA[Modem Command Status Register]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[Diverse status; error; report bits]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMFIFOWR</name>
    <description><![CDATA[Modem FIFO Write Register]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAYLOADIN</name>
    <description><![CDATA[FIFO write port. The actual port size is configurable.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMFIFORD</name>
    <description><![CDATA[Modem FIFO Read Register]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAYLOADOUT</name>
    <description><![CDATA[FIFO read port. The actual port size is configurable.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMFIFOWRCTRL</name>
    <description><![CDATA[Modem FIFO Write Configuration]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>FIFOWRPORT</name>
    <description><![CDATA[FIFO write port mapping]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>WORDSZWR</name>
    <description><![CDATA[Actual bits in every word write access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMFIFORDCTRL</name>
    <description><![CDATA[Modem FIFO Read Configuration]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>FIFORDPORT</name>
    <description><![CDATA[FIFO read port mapping]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>WORDSZRD</name>
    <description><![CDATA[Actual bits in every word read access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMFIFOCFG</name>
    <description><![CDATA[Modem FIFO Configuration for Watermark Thresholds]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>AFULLTHR</name>
    <description><![CDATA[Almost full threshold value in bits. This threshold affects the 'almostfull' and 'txready' status bits in MDMFIFOSTA. The FIFO can hold up to 64 bits.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>AEMPTYTHR</name>
    <description><![CDATA[Almost empty threshold in bits. This threshold affects the 'almostempty' and 'rxvalid' status bits in MDMFIFOSTA. The FIFO can hold up to 64 bits.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMFIFOSTA</name>
    <description><![CDATA[Modem FIFO Status Flags]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>OVERFLOW</name>
    <description><![CDATA[FIFO overflow error. If this flag is asserted the modem FIFO must be re-initialized to clear it. Note that re-initializing will flush the FIFO.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>ALMOSTFULL</name>
    <description><![CDATA[FIFO is almost full. Asserts when the FIFO fill level is above the almost full threshold.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ALMOSTEMPTY</name>
    <description><![CDATA[FIFO is almost empty. Asserts when the FIFO fill level is below the almost empty threshold.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>UNDERFLOW</name>
    <description><![CDATA[FIFO underflow error. If this flag is asserted the modem FIFO must be re-initialized to clear it.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RXVALID</name>
    <description><![CDATA[A full data word is valid and can be read in MDMRXFIFO register read port.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TXREADY</name>
    <description><![CDATA[The MDMTXFIFO register write port is ready to receive a data word.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CPEFWEVENT</name>
    <description><![CDATA[CPE-to-MCE Firmware Triggered Events]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>EVENT3</name>
    <description><![CDATA[Generic FW CPE-driven event to MCE]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>EVENT2</name>
    <description><![CDATA[Generic FW CPE-driven event to MCE]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EVENT1</name>
    <description><![CDATA[Generic FW CPE-driven event to MCE]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EVENT0</name>
    <description><![CDATA[Generic FW CPE-driven event to MCE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFESEND</name>
    <description><![CDATA[MCE-to-RFE Send Command Register]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MCECMD</name>
    <description><![CDATA[Command to send to RFE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFERCEV</name>
    <description><![CDATA[RFE-to-MCE Receive Command Register]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RFECMD</name>
    <description><![CDATA[Command received from RFE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMICONF</name>
    <description><![CDATA[Serial Modem Interface Configuration]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>SMIENABLE</name>
    <description><![CDATA[Enables the SMI interface]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>PRESCALER</name>
    <description><![CDATA[Configures the SMI rate]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>MLENGTH</name>
    <description><![CDATA[Configures the Message Length]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMIDLOUTG</name>
    <description><![CDATA[Serial Modem Interface Data Output Register]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DL</name>
    <description><![CDATA[Outgoing data link message]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMICLOUTG</name>
    <description><![CDATA[Serial Modem Interface Control Output Register]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CL</name>
    <description><![CDATA[Outgoing command link message]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMIDLINC</name>
    <description><![CDATA[Serial Modem Interface Data Input Register]]></description>
    <addressOffset>0x00000094</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DL</name>
    <description><![CDATA[Incoming data link message]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMICLINC</name>
    <description><![CDATA[Serial Modem Interface Control Input Register]]></description>
    <addressOffset>0x00000098</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CL</name>
    <description><![CDATA[Incoming command link message]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMISTA</name>
    <description><![CDATA[Serial Modem Interface Status Register]]></description>
    <addressOffset>0x0000009C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>INCCLERROR</name>
    <description><![CDATA[Incoming command link has errors]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>INCDLERROR</name>
    <description><![CDATA[Incoming data link has errors]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCDIGCONF</name>
    <description><![CDATA[ADC Digital Interface Configuration]]></description>
    <addressOffset>0x000000A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>QBRANCHEN</name>
    <description><![CDATA[Enables Q component data branch in ADCDIG]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>IBRANCHEN</name>
    <description><![CDATA[Enables I component data branch in ADCDIG]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODPRECTRL</name>
    <description><![CDATA[Modulator Preamble Control]]></description>
    <addressOffset>0x000000A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>REPS</name>
    <description><![CDATA[Number of preamble repetitions]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>SIZE</name>
    <description><![CDATA[Preamble size in bits]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
