zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MODSYMMAP0</name>
    <description><![CDATA[Modulator Symbol Mapping Register 0]]></description>
    <addressOffset>0x000000A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SYM3</name>
    <description><![CDATA[Decimal value for bits '11']]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>SYM2</name>
    <description><![CDATA[Decimal value for bits '01']]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>SYM1</name>
    <description><![CDATA[Decimal value for bit '1']]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>SYM0</name>
    <description><![CDATA[Decimal value for bit '0']]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODSYMMAP1</name>
    <description><![CDATA[Modulator Symbol Mapping Register 1]]></description>
    <addressOffset>0x000000AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SYM7</name>
    <description><![CDATA[Decimal value for bits '111']]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>SYM6</name>
    <description><![CDATA[Decimal value for bits '110']]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>SYM5</name>
    <description><![CDATA[Decimal value for bits '101']]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>SYM4</name>
    <description><![CDATA[Decimal value for bits '100']]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODSOFTTX</name>
    <description><![CDATA[Modulator Soft Symbol Transmit]]></description>
    <addressOffset>0x000000B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>SOFTSYMBOL</name>
    <description><![CDATA[Soft symbol {-7..+7} used when MODCTRL.softtx is enabled]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMBAUD</name>
    <description><![CDATA[Modem Baud Rate Control]]></description>
    <addressOffset>0x000000B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RATEWORD</name>
    <description><![CDATA[Rate word (bits [20:5])]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMBAUDPRE</name>
    <description><![CDATA[Modem Baud Rate Prescaler Control]]></description>
    <addressOffset>0x000000B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>EXTRATEWORD</name>
    <description><![CDATA[Extended Rate Word (5 LSBs [4:0])]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>ALIGNVALUE</name>
    <description><![CDATA[Align value for timebase after sync]]></description>
    <bitRange>[6:4]</bitRange>
  </field>
  <field>
    <name>PRESCALER</name>
    <description><![CDATA[Prescaler value; range 1 to 15]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODMAIN</name>
    <description><![CDATA[Modulator Main Config Register]]></description>
    <addressOffset>0x000000BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SPREADFACTOR</name>
    <description><![CDATA[Modem spreading factor]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>FECSELECT</name>
    <description><![CDATA[Forward Error Correction Selection]]></description>
    <bitRange>[5:2]</bitRange>
  </field>
  <field>
    <name>MODLEVELS</name>
    <description><![CDATA[Number of modulation levels]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMISC0</name>
    <description><![CDATA[Demodulator Config Register 0]]></description>
    <addressOffset>0x000000C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>CMI4FMIXSIGN</name>
    <description><![CDATA[Demodulator front-end complex Fs/4 mixer setting]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>HILBREMOVEREAL</name>
    <description><![CDATA[Demodulator front-end Hilbert filter setting]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>HILBEN</name>
    <description><![CDATA[Demodulator front-end Hilbert filter control]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CMIXN</name>
    <description><![CDATA[Signed factor of mixer phasor; Fmix=Fs/1024*n]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMISC1</name>
    <description><![CDATA[Demodulator Config Register 1]]></description>
    <addressOffset>0x000000C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>MGE2SRCSEL</name>
    <description><![CDATA[Source select second magnitude estimator]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CHFIBW</name>
    <description><![CDATA[Select BW of demodulator channel filter]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMISC2</name>
    <description><![CDATA[Demodulator Config Register 2]]></description>
    <addressOffset>0x000000C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>LQIPERIOD</name>
    <description><![CDATA[LQI measurement period]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>MLSERUN</name>
    <description><![CDATA[Enable MLSE desicions]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>MAFCGAIN</name>
    <description><![CDATA[Set gain in MAFC. Multiplies symbols with 2^N before symbol recovery stage]]></description>
    <bitRange>[12:11]</bitRange>
  </field>
  <field>
    <name>STIMESTONLY</name>
    <description><![CDATA[Only perform symbol timing error estimate in STIM; without doing timing correction]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>STIMTEAPERIOD</name>
    <description><![CDATA[Symbol timing error accumulator period (8 to 256 symbols) in STIM]]></description>
    <bitRange>[9:7]</bitRange>
  </field>
  <field>
    <name>STIMTEAGAIN</name>
    <description><![CDATA[Symbol timing error accumulator gain in STIM]]></description>
    <bitRange>[6:4]</bitRange>
  </field>
  <field>
    <name>PDIFLINPREDEN</name>
    <description><![CDATA[Enable linear predictor in PDIF at CORDIC output]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PDIFDESPECKLEREN</name>
    <description><![CDATA[Enable despeckler in PDIF at CORDIC output]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PDIFIQCONJEN</name>
    <description><![CDATA[IQ conjugate in PDIF]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PDIFLIMITRANGE</name>
    <description><![CDATA[Limit range on maximal PDIF]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMISC3</name>
    <description><![CDATA[Demodulator Config Register 3]]></description>
    <addressOffset>0x000000CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>BDE1NUMSTAGES</name>
    <description><![CDATA[00 : DIV1  : Decimate by 1 (no decimation)]]></description>
    <bitRange>[6:5]</bitRange>
  </field>
  <field>
    <name>PDIFDECIM</name>
    <description><![CDATA[Additional decimation in PDIF]]></description>
    <bitRange>[4:3]</bitRange>
  </field>
  <field>
    <name>BDECNUMSTAGES</name>
    <description><![CDATA[Baseband decimation filter setting]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMIQMC0</name>
    <description><![CDATA[Demodulator I/Q Mismatch Compensation Register]]></description>
    <addressOffset>0x000000D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>GAINFACTOR</name>
    <description><![CDATA[Gain Factor (128 = 1.0 gain)]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>PHASEFACTOR</name>
    <description><![CDATA[Phase Factor [-128;127] = [-0.5;0.496]]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMDSBU</name>
    <description><![CDATA[Dynamic Sample Buffer Config Register]]></description>
    <addressOffset>0x000000D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DSBUAVGLENGTH</name>
    <description><![CDATA[Length for moving average of the newest DSBU samples]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>DSBUDELAY</name>
    <description><![CDATA[Output delay from sample buffer; as offset between write and read pointers]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCODC0</name>
    <description><![CDATA[Demodulator Coarse DC Offset Estimator Register 0]]></description>
    <addressOffset>0x000000D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>ESTSEL</name>
    <description><![CDATA[Select which estimator to show as readable output]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>COMPSEL</name>
    <description><![CDATA[Select estimator to use for coarse DC offset compensation]]></description>
    <bitRange>[10:9]</bitRange>
  </field>
  <field>
    <name>IIRUSEINITIAL</name>
    <description><![CDATA[When enabled; a configurable value is loaded to initialize IIR filter when CODC estimator is re-initialized.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>IIRGAIN</name>
    <description><![CDATA[Adjust first-order IIR filter adaptation which controls filter bandwidth]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>IIREN</name>
    <description><![CDATA[Enable first-order IIR filter inside CODC]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ACCCONTMODE</name>
    <description><![CDATA[Accumulator mode]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ACCPERIOD</name>
    <description><![CDATA[Integration period for accumulator estimator]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>ACCEN</name>
    <description><![CDATA[Enable accumulator based estimator inside CODC]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIDC0</name>
    <description><![CDATA[Demodulator Fine DC Offset Estimator Register 0]]></description>
    <addressOffset>0x000000DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>COMPSEL</name>
    <description><![CDATA[Select estimator to use for fine DC offset compensation]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>ACCPERIOD</name>
    <description><![CDATA[Integration period for accumulator estimator]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>ACCCONTMODE</name>
    <description><![CDATA[Accumulator mode]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ACCEN</name>
    <description><![CDATA[Enable accumulator based estimator inside FIDC]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFEXB0</name>
    <description><![CDATA[Demodulator Front-End Crossbar Register 0]]></description>
    <addressOffset>0x000000E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>OUT2PASSTHROUGH</name>
    <description><![CDATA[Let crossbar main input passthrough as XBAR output #2]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>OUT2SRCSEL</name>
    <description><![CDATA[Source select for XBAR output #2]]></description>
    <bitRange>[12:11]</bitRange>
  </field>
  <field>
    <name>OUT1PASSTHROUGH</name>
    <description><![CDATA[Let crossbar main input passthrough as XBAR output #1]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>OUT1SRCSEL</name>
    <description><![CDATA[Source select for XBAR output #1]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>B4SRCSEL</name>
    <description><![CDATA[Source select for CODC (XBAR block #4)]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>B3SRCSEL</name>
    <description><![CDATA[Source select for CMI4 (XBAR block #3)]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>B2SRCSEL</name>
    <description><![CDATA[Source select for CMIX (XBAR block #2)]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>B1SRCSEL</name>
    <description><![CDATA[Source select for HILB (XBAR block #1)]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMDSXB0</name>
    <description><![CDATA[Demodulator Decode Stage Crossbar Register 0]]></description>
    <addressOffset>0x000000E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>OUT2PASSTHROUGH</name>
    <description><![CDATA[Ouput 2 is directly input]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>OUT1PASSTHROUGH</name>
    <description><![CDATA[Ouput 1 is directly input]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>OUTSRCSEL2</name>
    <description><![CDATA[Source select XBAR output; branch 1 (baud branch)]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>OUTSRCSEL1</name>
    <description><![CDATA[Source select for XBAR output; branch 2 (flushed branch)]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>B3SRCSEL</name>
    <description><![CDATA[Source select for C1BE (XBAR block #3)]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>B2SRCSEL</name>
    <description><![CDATA[Source select for MAFI (XBAR block #2)]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>B1SRCSEL</name>
    <description><![CDATA[Source select for FIFE (XBAR block #1)]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMD2XB0</name>
    <description><![CDATA[Demodulator Decode Stage Second Crossbar Register 0]]></description>
    <addressOffset>0x000000E8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>OUT2PASSTHROUGH</name>
    <description><![CDATA[Ouput 2 is directly INPUT]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>OUT1PASSTHROUGH</name>
    <description><![CDATA[Ouput 1 is directly INPUT]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>OUTSRCSEL2</name>
    <description><![CDATA[Source select XBAR output; branch 1 (towards MLSE)]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>OUTSRCSEL1</name>
    <description><![CDATA[Source select for XBAR output; branch 2 (towards SOFD)]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>B2SRCSEL</name>
    <description><![CDATA[Source select for STIM (XBAR block #2)]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>B1SRCSEL</name>
    <description><![CDATA[Source select for MAFC (XBAR block #1)]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIFE0</name>
    <description><![CDATA[Demodulator Fine Frequency Offset Estimator Register 0]]></description>
    <addressOffset>0x000000EC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>FINEFOESEL</name>
    <description><![CDATA[Select which estimator to show as readable output]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>FOCFFSEL</name>
    <description><![CDATA[Select which estimate source to be used in feed-forward compensation point]]></description>
    <bitRange>[10:9]</bitRange>
  </field>
  <field>
    <name>ACCCNTMODE</name>
    <description><![CDATA[Accumulator mode]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>ACCPERIOD</name>
    <description><![CDATA[Integration period for accumulator]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>ACCEN</name>
    <description><![CDATA[Enable accumulator based frequency offset estimator inside FIFE]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>IIRUSEINITIAL</name>
    <description><![CDATA[When enabled; a configurable value is loaded to initialize IIR filter when FIFE estimator is re-initialized.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>IIRGAIN</name>
    <description><![CDATA[Adjust first-order IIR filter adaptation which controls filter bandwidth]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>IIREN</name>
    <description><![CDATA[Enable first-order IIR filter based freq offset estimator inside CODC]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMAFI0</name>
    <description><![CDATA[Demodulator Matched Filter Register 0]]></description>
    <addressOffset>0x000000F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>C1C7</name>
    <description><![CDATA[Filter coefficient c1 (and c7)]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>C0C8</name>
    <description><![CDATA[Filter coefficient c0 (and c8)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMAFI1</name>
    <description><![CDATA[Demodulator Matched Filter Register 1]]></description>
    <addressOffset>0x000000F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>C3C5</name>
    <description><![CDATA[Filter coefficient c3 (and c5)]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>C2C6</name>
    <description><![CDATA[Filter coefficient c2 (and c6)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMAFI2</name>
    <description><![CDATA[Demodulator Matched Filter Register 2]]></description>
    <addressOffset>0x000000F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>C4</name>
    <description><![CDATA[Filter coefficient c4. The matched filter will have unity gain when the sum of all coefficients c0 to c8 equals 512.]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMAFI3</name>
    <description><![CDATA[Demodulator Matched Filter Register 3]]></description>
    <addressOffset>0x000000FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>K</name>
    <description><![CDATA[Output level adjustment. Adjusting LSB of k will adjust LSB of matched filter output accordingly.]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
