zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>DEMC1BE0</name>
    <description><![CDATA[Demodulator Correlator 1-bit Engine Register 0]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MASKB</name>
    <description><![CDATA[Mask for correlator B to select the correlator length to use. The number specifies number of nibbles (i.e. 4-bit block; which typically corresponds to one symbol) of the correlator holding the oldest samples that will be ignored in computations.]]></description>
    <bitRange>[15:11]</bitRange>
  </field>
  <field>
    <name>MASKA</name>
    <description><![CDATA[Mask for correlator A to select the correlator length to use. The number specifies number of nibbles (i.e. 4-bit block; which typically corresponds to one symbol) of the correlator holding the oldest samples that will be ignored in computations.]]></description>
    <bitRange>[10:6]</bitRange>
  </field>
  <field>
    <name>CASCCONF</name>
    <description><![CDATA[Correlator cascade configuration]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>COPYCONF</name>
    <description><![CDATA[Control auto copy of contents from corr A to corr B]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMC1BE1</name>
    <description><![CDATA[Demodulator Correlator 1-bit Engine Register 1]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>THRESHOLDB</name>
    <description><![CDATA[Correlation threshold value for correlator B]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>THRESHOLDA</name>
    <description><![CDATA[Correlation threshold value for correlator A]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMC1BE2</name>
    <description><![CDATA[Demodulator Correlator 1-bit Engine Register 2]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>PEAKCONF</name>
    <description><![CDATA[Configuration to control peak event generation]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>THRESHOLDC</name>
    <description><![CDATA[Correlation threshold value for correlator C (corr C is corr A+B combined)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMSYNC0</name>
    <description><![CDATA[Modem Sync Word Register 0]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SWA15C0</name>
    <description><![CDATA[Sync word A bits 15:0. Sync words shorter than 32 bits must be stored as most signicant bits of sync word A. The sync word is expected to be transmitted/received in lsb to msb order.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMSYNC1</name>
    <description><![CDATA[Modem Sync Word Register 1]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SWA31C16</name>
    <description><![CDATA[Sync word A bits 31:16. Sync words shorter than 32 bits must be stored as most significant bits of sync word A. The sync word is expected to be transmitted/received in lsb to msb order.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMSYNC2</name>
    <description><![CDATA[Modem Sync Word Register 2]]></description>
    <addressOffset>0x00000114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SWB15C0</name>
    <description><![CDATA[Sync word B bits 15:0. Sync words shorter than 32 bits must be stored as most significant bits of sync word B. The sync word is expected to be transmitted/received in lsb to msb order.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MDMSYNC3</name>
    <description><![CDATA[Modem Sync Word Register 3]]></description>
    <addressOffset>0x00000118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SWB31C16</name>
    <description><![CDATA[Sync word B bits 31:16. Sync words shorter than 32 bits must be stored as most significant bits of sync word B. The sync word is expected to be transmitted/received in lsb to msb order.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSWQU0</name>
    <description><![CDATA[Demodulator Sync Word Qualifier Register 0]]></description>
    <addressOffset>0x0000011C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>AUTOMAFC</name>
    <description><![CDATA[Let sync word qualifier automatically control the manual frequency offset compensation (MAFC) block when it is running]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RUN</name>
    <description><![CDATA[Start/stop sync word qualifier]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>REFLEN</name>
    <description><![CDATA[Bit length of sync word qualifier reference vector; constituted by (reflen + 1) most significant bits of sync word A and/or B.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODCTRL</name>
    <description><![CDATA[Dynamic Modem Control Signals from MCE]]></description>
    <addressOffset>0x00000120</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>EARLYLATE</name>
    <description><![CDATA[Set the C1BE in special early/late mode]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SOFTPDIFFMODE</name>
    <description><![CDATA[Enable Soft PDIFF mode for RX]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>SOFTTXENABLE</name>
    <description><![CDATA[Enable SOFT TX mode]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>FECENABLE</name>
    <description><![CDATA[Global FEC modes enable]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>FEC5TERMINATE</name>
    <description><![CDATA[Goes into termination mode in 5Mbps TX FEC]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TONEINSERT</name>
    <description><![CDATA[Inserts a tone]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PREAMBLEINSERT</name>
    <description><![CDATA[Inserts preamble]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODPREAMBLE</name>
    <description><![CDATA[Dynamic Modulator Preamble Register]]></description>
    <addressOffset>0x00000124</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>WORD</name>
    <description><![CDATA[16 bit preamble word]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFRAC0</name>
    <description><![CDATA[Demodulator Fractional Resampler Register 0]]></description>
    <addressOffset>0x00000128</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>P15C0</name>
    <description><![CDATA[Downsampler P[15:0]]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFRAC1</name>
    <description><![CDATA[Demodulator Fractional Resampler Register 1]]></description>
    <addressOffset>0x0000012C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>P27C16</name>
    <description><![CDATA[Downsampler P[27:16]]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFRAC2</name>
    <description><![CDATA[Demodulator Fractional Resampler Register 2]]></description>
    <addressOffset>0x00000130</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>Q15C0</name>
    <description><![CDATA[Downsampler Q[15:0]]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFRAC3</name>
    <description><![CDATA[Demodulator Fractional Resampler Register 3]]></description>
    <addressOffset>0x00000134</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>Q27C16</name>
    <description><![CDATA[Downsampler Q[27:16]]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCODC1</name>
    <description><![CDATA[Demodulator Coarse DC Offset Estimator Register 1]]></description>
    <addressOffset>0x00000138</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>COMPIVAL</name>
    <description><![CDATA[Compensation value; I branch]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCODC2</name>
    <description><![CDATA[Demodulator Coarse DC Offset Estimator Register 2]]></description>
    <addressOffset>0x0000013C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>COMPQVAL</name>
    <description><![CDATA[Compensation value; Q branch]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIDC1</name>
    <description><![CDATA[Demodulator Fine DC Offset Estimator Register 1]]></description>
    <addressOffset>0x00000140</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>COMPIVAL</name>
    <description><![CDATA[Compensation value for I path]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIDC2</name>
    <description><![CDATA[Demodulator Fine DC Offset Estimator Register 2]]></description>
    <addressOffset>0x00000144</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>COMPQVAL</name>
    <description><![CDATA[Compensation value for Q path]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIFE1</name>
    <description><![CDATA[Demodulator Fine Frequency Offset Estimator Register 1]]></description>
    <addressOffset>0x00000148</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>FOCFBREGVAL</name>
    <description><![CDATA[Value for feed-back compensation point (signed)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMTHRD0</name>
    <description><![CDATA[Demodulator Soft Decision Threshold Register 0]]></description>
    <addressOffset>0x0000014C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>THR2</name>
    <description><![CDATA[Threshold 2 (between +3 and +5 symbols)]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>THR1</name>
    <description><![CDATA[Threshold 1 (between +1 and +3 symbols)]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMTHRD1</name>
    <description><![CDATA[Demodulator Soft Decision Threshold Register 0]]></description>
    <addressOffset>0x00000150</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>THR3</name>
    <description><![CDATA[Threshold 3 (between +5 and +7 symbols)]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMAFC0</name>
    <description><![CDATA[Demodulator Manual Frequency Compensation Register 0]]></description>
    <addressOffset>0x00000154</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>COMPVAL</name>
    <description><![CDATA[Value for manual compensation (signed)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMAFI4</name>
    <description><![CDATA[Demodulator Matched Filter Register 4]]></description>
    <addressOffset>0x00000158</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TERM_VAL</name>
    <description><![CDATA[Input value to terminate matched filter with; writing triggers termination]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSWIMBAL</name>
    <description><![CDATA[Demodulator Sync Word DC Imbalance Register]]></description>
    <addressOffset>0x0000015C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>IMBALB</name>
    <description><![CDATA[DC imbalance in sync word B; applied via SWQU upon C1BE correlator A peak event]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>IMBALA</name>
    <description><![CDATA[DC imbalance in sync word A; applied via SWQU upon C1BE correlator B peak event]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSOFTPDIFF</name>
    <description><![CDATA[Demodulator Soft PDIFF Value Register]]></description>
    <addressOffset>0x00000160</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SOFTPDIFF</name>
    <description><![CDATA[Replaces PDIFF output when in Soft PDIFF Mode]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMDEBUG</name>
    <description><![CDATA[Demodulator Debug Register]]></description>
    <addressOffset>0x00000164</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>DECSTAGEDEBUG</name>
    <description><![CDATA[Dectage Selection]]></description>
    <bitRange>[8:5]</bitRange>
  </field>
  <field>
    <name>FRONTENDDEBUG</name>
    <description><![CDATA[Frontend Selection]]></description>
    <bitRange>[4:1]</bitRange>
  </field>
  <field>
    <name>LOOPBACKMODE</name>
    <description><![CDATA[Enables loopback mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITCTRL</name>
    <description><![CDATA[Viterbi Control Register]]></description>
    <addressOffset>0x00000168</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>READEPTH</name>
    <description><![CDATA[Depth of the REA algorithm]]></description>
    <bitRange>[9:6]</bitRange>
  </field>
  <field>
    <name>APMRDBACKSEL</name>
    <description><![CDATA[Selects the APM to read back]]></description>
    <bitRange>[5:2]</bitRange>
  </field>
  <field>
    <name>ACSITERATIONS</name>
    <description><![CDATA[Number of iterations per ACS element]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SOFTMETRICS</name>
    <description><![CDATA[Enable Soft Metrics]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITCOMPUTE</name>
    <description><![CDATA[Viterbi Compute Register]]></description>
    <addressOffset>0x0000016C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>COMPUTE</name>
    <description><![CDATA[Initiates a compute cycle]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMRDBACK</name>
    <description><![CDATA[Viterbi APM Readback Register]]></description>
    <addressOffset>0x00000170</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[APM for element i (selected in VITCTRL)]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITSTATE</name>
    <description><![CDATA[Viterbi State Register]]></description>
    <addressOffset>0x00000174</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[Current Winning State]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRMETRIC10</name>
    <description><![CDATA[Viterbi Branch Metric 1 and 0 Register]]></description>
    <addressOffset>0x00000178</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MET1</name>
    <description><![CDATA[Branch Metric 1]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>MET0</name>
    <description><![CDATA[Branch Metric 0]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRMETRIC32</name>
    <description><![CDATA[Viterbi Branch Metric 3 and 2 Register]]></description>
    <addressOffset>0x0000017C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MET3</name>
    <description><![CDATA[Branch Metric 3]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>MET2</name>
    <description><![CDATA[Branch Metric 2]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRMETRIC54</name>
    <description><![CDATA[Viterbi Branch Metric 5 and 4 Register]]></description>
    <addressOffset>0x00000180</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MET5</name>
    <description><![CDATA[Branch Metric 5]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>MET4</name>
    <description><![CDATA[Branch Metric 4]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
