zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>VITBRMETRIC76</name>
    <description><![CDATA[Viterbi Branch Metric 7 and 6 Register]]></description>
    <addressOffset>0x00000184</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MET7</name>
    <description><![CDATA[Branch Metric 7]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>MET6</name>
    <description><![CDATA[Branch Metric 6]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL0</name>
    <description><![CDATA[Viterbi Branch Select Register 0]]></description>
    <addressOffset>0x00000188</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 0; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 0; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 0; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 0; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL0</name>
    <description><![CDATA[Viterbi APM Select Register 0]]></description>
    <addressOffset>0x0000018C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 0; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 0; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 0; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 0; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL1</name>
    <description><![CDATA[Viterbi Branch Select Register 1]]></description>
    <addressOffset>0x00000190</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 1; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 1; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 1; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 1; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL1</name>
    <description><![CDATA[Viterbi APM Select Register 1]]></description>
    <addressOffset>0x00000194</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 1; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 1; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 1; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 1; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL2</name>
    <description><![CDATA[Viterbi Branch Select Register 2]]></description>
    <addressOffset>0x00000198</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 2; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 2; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 2; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 2; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL2</name>
    <description><![CDATA[Viterbi APM Select Register 2]]></description>
    <addressOffset>0x0000019C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 2; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 2; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 2; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 2; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL3</name>
    <description><![CDATA[Viterbi Branch Select Register 3]]></description>
    <addressOffset>0x000001A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 3; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 3; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 3; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 3; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL3</name>
    <description><![CDATA[Viterbi APM Select Register 3]]></description>
    <addressOffset>0x000001A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 3; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 3; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 3; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 3; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL4</name>
    <description><![CDATA[Viterbi Branch Select Register 4]]></description>
    <addressOffset>0x000001A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 4; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 4; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 4; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 4; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL4</name>
    <description><![CDATA[Viterbi APM Select Register 4]]></description>
    <addressOffset>0x000001AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 4; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 4; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 4; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 4; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL5</name>
    <description><![CDATA[Viterbi Branch Select Register 5]]></description>
    <addressOffset>0x000001B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 5; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 5; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 5; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 5; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL5</name>
    <description><![CDATA[Viterbi APM Select Register 5]]></description>
    <addressOffset>0x000001B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 5; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 5; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 5; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 5; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL6</name>
    <description><![CDATA[Viterbi Branch Select Register 6]]></description>
    <addressOffset>0x000001B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 6; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 6; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 6; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 6; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL6</name>
    <description><![CDATA[Viterbi APM Select Register 6]]></description>
    <addressOffset>0x000001BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 6; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 6; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 6; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 6; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITBRSEL7</name>
    <description><![CDATA[Viterbi Branch Select Register 7]]></description>
    <addressOffset>0x000001C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BR3MUX</name>
    <description><![CDATA[ACS Element 7; Branch Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>BR2MUX</name>
    <description><![CDATA[ACS Element 7; Branch Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>BR1MUX</name>
    <description><![CDATA[ACS Element 7; Branch Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>BR0MUX</name>
    <description><![CDATA[ACS Element 7; Branch Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITAPMSEL7</name>
    <description><![CDATA[Viterbi APM Select Register 7]]></description>
    <addressOffset>0x000001C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>APM3MUX</name>
    <description><![CDATA[ACS Element 7; Accumulated Path Metric Mux 3]]></description>
    <bitRange>[11:9]</bitRange>
  </field>
  <field>
    <name>APM2MUX</name>
    <description><![CDATA[ACS Element 7; Accumulated Path Metric Mux 2]]></description>
    <bitRange>[8:6]</bitRange>
  </field>
  <field>
    <name>APM1MUX</name>
    <description><![CDATA[ACS Element 7; Accumulated Path Metric Mux 1]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>APM0MUX</name>
    <description><![CDATA[ACS Element 7; Accumulated Path Metric Mux 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCMULTA</name>
    <description><![CDATA[Local Serial Multiplier Factor A Input Register]]></description>
    <addressOffset>0x000001C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>AVALUE</name>
    <description><![CDATA[16-bit A factor]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCMULTB</name>
    <description><![CDATA[Local Serial Multiplier Factor B Input Register]]></description>
    <addressOffset>0x000001CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>BVALUE</name>
    <description><![CDATA[16-bit B factor]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCMULTC0</name>
    <description><![CDATA[Local Serial Multiplier Product Output Register]]></description>
    <addressOffset>0x000001D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>C15C0</name>
    <description><![CDATA[C = B*A; bits [15:0]]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCMULTC1</name>
    <description><![CDATA[Local Serial Multiplier Product Output Register]]></description>
    <addressOffset>0x000001D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>C31C16</name>
    <description><![CDATA[C = B*A; bits [31:16]]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TIMCTRL</name>
    <description><![CDATA[Modem Timer and Counter Control Register]]></description>
    <addressOffset>0x000001D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>CAPTURESOURCE</name>
    <description><![CDATA[Selects bit number from event bus for a counter capture. Event number in range 0 to 63.]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>ENABLECAPTURE</name>
    <description><![CDATA[Enable counter capture on event]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>COUNTERSOURCE</name>
    <description><![CDATA[Select event source for counter]]></description>
    <bitRange>[6:5]</bitRange>
  </field>
  <field>
    <name>CLEARCOUNTER</name>
    <description><![CDATA[Reset counter when set to 1]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ENABLECOUNTER</name>
    <description><![CDATA[Enable counter when set to 1]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TIMERSOURCE</name>
    <description><![CDATA[Select timer tick source for timer]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>ENABLETIMER</name>
    <description><![CDATA[Enable timer. Note internal timer value is not readable from the MCE. If this is needed the counter should be used instead of the timer.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TIMINC</name>
    <description><![CDATA[Modem Counter Increment Configuration]]></description>
    <addressOffset>0x000001DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>INCUNIT</name>
    <description><![CDATA[Counter = Counter + (IncUnit + 1)]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TIMPERIOD</name>
    <description><![CDATA[Modem Timer/Counter Period Configuration]]></description>
    <addressOffset>0x000001E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PERIOD</name>
    <description><![CDATA[Configurable 16 bit period that can be used for either the timer or the counter. In timer context; when timer value reach the timer period (i.e. it expires) a TIMER_IRQ event will occur; and the timer will restart from zero (until the timer is manually disabled). In counter context; a COUNTER_IRQ event will occur when the counter is equal to or higher than the period value.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TIMCOUNTER</name>
    <description><![CDATA[Modem Counter Value]]></description>
    <addressOffset>0x000001E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[16 bit counter value that can be read by the MCE.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TIMCAPT</name>
    <description><![CDATA[Modem Counter Capture Value]]></description>
    <addressOffset>0x000001E8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[Captured value of counter]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
