zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>TIMEBASE</name>
    <description><![CDATA[Modem Timebase Control Register]]></description>
    <addressOffset>0x000001EC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>FLUSH</name>
    <description><![CDATA[Controls flush mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>COUNT1IN</name>
    <description><![CDATA[Local Count Ones Input Register]]></description>
    <addressOffset>0x000001F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Input data; which we shall find the number of 1's in]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>COUNT1RES</name>
    <description><![CDATA[Local Count Ones Result Register]]></description>
    <addressOffset>0x000001F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>COUNT</name>
    <description><![CDATA[Number of 1's in the COUNT1IN register]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BRMACC0</name>
    <description><![CDATA[Local Branch Metric Accelerator Register 0]]></description>
    <addressOffset>0x000001F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SYM1ST</name>
    <description><![CDATA[Symbol 1st (first; left one)]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SYM2ND</name>
    <description><![CDATA[Symbol 2nd (last; right one)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BRMACC1</name>
    <description><![CDATA[Local Branch Metric Accelerator Module Register 1]]></description>
    <addressOffset>0x000001FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>METRIC01</name>
    <description><![CDATA[Metric to 00 (-1 -1) symbol]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>METRIC00</name>
    <description><![CDATA[Metric to 01 (-1 +1) symbol]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BRMACC2</name>
    <description><![CDATA[Local Branch Metric Accelerator Module Register 2]]></description>
    <addressOffset>0x00000200</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>METRIC11</name>
    <description><![CDATA[Metric to 10 (+1 -1) symbol]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>METRIC10</name>
    <description><![CDATA[Metric to 11 (+1 +1) symbol]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITACCCTRL</name>
    <description><![CDATA[Viterbi Accelerator Control Register]]></description>
    <addressOffset>0x00000204</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>POLYNOM1</name>
    <description><![CDATA[Polynom 1]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>POLYNOM0</name>
    <description><![CDATA[Polynom 0]]></description>
    <bitRange>[8:2]</bitRange>
  </field>
  <field>
    <name>CODELENGTH</name>
    <description><![CDATA[Code Length K=5/6/7]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VITACCRDBIT</name>
    <description><![CDATA[Viterbi Accelerator Read Register]]></description>
    <addressOffset>0x00000208</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RXBIT</name>
    <description><![CDATA[Decoded bit]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCETRCSEND</name>
    <description><![CDATA[MCE Tracer Send Trigger Register]]></description>
    <addressOffset>0x0000020C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEND</name>
    <description><![CDATA[Sends a command to the tracer]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCETRCBUSY</name>
    <description><![CDATA[MCE Tracer Status Register]]></description>
    <addressOffset>0x00000210</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[Checks if the tracer is busy]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCETRCCMD</name>
    <description><![CDATA[MCE Tracer Command Register]]></description>
    <addressOffset>0x00000214</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>PARCNT</name>
    <description><![CDATA[Num of parameters]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>PKTHDR</name>
    <description><![CDATA[Packet Header]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCETRCPAR0</name>
    <description><![CDATA[MCE Tracer Command Parameter Register 0]]></description>
    <addressOffset>0x00000218</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR0</name>
    <description><![CDATA[Parameter 0]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCETRCPAR1</name>
    <description><![CDATA[MCE Tracer Command Parameter Register 1]]></description>
    <addressOffset>0x0000021C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR1</name>
    <description><![CDATA[Parameter 1]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RDCAPT0</name>
    <description><![CDATA[Modem Readback Capture Register]]></description>
    <addressOffset>0x00000220</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DEMDSBU1</name>
    <description><![CDATA[Capture DEMDSBU1 RC register]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>DEMC1BEX</name>
    <description><![CDATA[Capture DEMC1BEx RC registers (x = 3;4;5)]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>DEMSOFD0</name>
    <description><![CDATA[Capture DEMSOFD0 RC register]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>DEMLQIE0</name>
    <description><![CDATA[Capture DEMLQIE0 RC register]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>DEMSTIM1</name>
    <description><![CDATA[Capture DEMSTIM1 RC register]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>DEMSTIM0</name>
    <description><![CDATA[Capture DEMSTIM0 RC register]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>DEMFIFE2</name>
    <description><![CDATA[Capture DEMFIFE2 RC register]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>DEMPDIF0</name>
    <description><![CDATA[Capture DEMPDIF0 RC register]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>DEMCA2P0</name>
    <description><![CDATA[Capture DEMCA2P0 RC register]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DEMFIDC4</name>
    <description><![CDATA[Capture DEMFIDC4 RC register]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>DEMFIDC3</name>
    <description><![CDATA[Capture DEMFIDC3 RC register]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DEMMGEX2</name>
    <description><![CDATA[Capture DEMMGEX2 RC register]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DEMMGEX1</name>
    <description><![CDATA[Capture DEMMGEX1 RC register]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>DEMDSBU0</name>
    <description><![CDATA[Capture DEMDSBU0 RC register]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DEMCODC4</name>
    <description><![CDATA[Capture DEMCODC4 RC register]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DEMCODC3</name>
    <description><![CDATA[Capture DEMCODC3 RC register]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCODC3</name>
    <description><![CDATA[Demodulator Coarse DC Estimator Register 3]]></description>
    <addressOffset>0x00000224</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ESTOUTI</name>
    <description><![CDATA[Readback value; I channel]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCODC4</name>
    <description><![CDATA[Demodulator Coarse DC Estimator Register 4]]></description>
    <addressOffset>0x00000228</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ESTOUTQ</name>
    <description><![CDATA[Readback value; Q channel]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMGEX1</name>
    <description><![CDATA[Demodulator Magnitude Estimator #1]]></description>
    <addressOffset>0x0000022C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>MGE1ESTOUT</name>
    <description><![CDATA[Magnitude estimate from estimator 1]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMGEX2</name>
    <description><![CDATA[Demodulator Magnitude Estimator #2]]></description>
    <addressOffset>0x00000230</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>MGE2ESTOUT</name>
    <description><![CDATA[Magnitude estimate from estimator 2]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIDC3</name>
    <description><![CDATA[Demodulator Fine DC Estimator Register 3]]></description>
    <addressOffset>0x00000234</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ESTOUTI</name>
    <description><![CDATA[Fine DC estimate I channel]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIDC4</name>
    <description><![CDATA[Demodulator Fine DC Estimator Register 4]]></description>
    <addressOffset>0x00000238</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ESTOUTQ</name>
    <description><![CDATA[Fine DC estimate Q channel]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCA2P0</name>
    <description><![CDATA[Demodulator Cartesian To Polar Register 0]]></description>
    <addressOffset>0x0000023C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>PHASE</name>
    <description><![CDATA[Phase of current sample]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMPDIF0</name>
    <description><![CDATA[Demodulator Phase Differentiator Register 0]]></description>
    <addressOffset>0x00000240</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PDIFF</name>
    <description><![CDATA[Instfreq of current samples]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMC1BE3</name>
    <description><![CDATA[Demodulator Correlator 1-bit Engine Register 3]]></description>
    <addressOffset>0x00000244</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CORRVALUEA</name>
    <description><![CDATA[Correlation calue correlator A]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMC1BE4</name>
    <description><![CDATA[Demodulator Correlator 1-bit Engine Register 4]]></description>
    <addressOffset>0x00000248</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CORRVALUEB</name>
    <description><![CDATA[Correlation value correlator B]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMC1BE5</name>
    <description><![CDATA[Demodulator Correlator 1-bit Engine Register 5]]></description>
    <addressOffset>0x0000024C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CORRVALUEC</name>
    <description><![CDATA[Correlation value combined correlator]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFIFE2</name>
    <description><![CDATA[Demodulator Fine Frequency Offset Estimator Register 2]]></description>
    <addressOffset>0x00000250</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>FINEFOCEST</name>
    <description><![CDATA[Frequency offset estimate fine foc]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMDSBU0</name>
    <description><![CDATA[Demodulator Dynamic Sample Buffer Register 0]]></description>
    <addressOffset>0x00000254</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>WRPOUT</name>
    <description><![CDATA[Current write pointer of DSBU]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>RDPOUT</name>
    <description><![CDATA[Current read pointer of DSBU]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMDSBU1</name>
    <description><![CDATA[Demodulator Dynamic Sample Buffer Register 1]]></description>
    <addressOffset>0x00000258</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>AVGVAL</name>
    <description><![CDATA[Current sum of samples between write and read pointers]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSTIM0</name>
    <description><![CDATA[Demodulator Symbol Timing Register 0]]></description>
    <addressOffset>0x0000025C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>EVENTS</name>
    <description><![CDATA[Number of stall/advance events occured]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSTIM1</name>
    <description><![CDATA[Demodulator Symbol Timing Register 1]]></description>
    <addressOffset>0x00000260</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>GARDNERERROR</name>
    <description><![CDATA[Timing error]]></description>
    <bitRange>[13:4]</bitRange>
  </field>
  <field>
    <name>DELTA</name>
    <description><![CDATA[Current fractional delay]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSWQU1</name>
    <description><![CDATA[Demodulator Sync Word Qualifier Register 1]]></description>
    <addressOffset>0x00000264</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SYNCED</name>
    <description><![CDATA[1:SW has passed qualification]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMLQIE0</name>
    <description><![CDATA[Demodulator LQI Engine Register 0]]></description>
    <addressOffset>0x00000268</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>LQI</name>
    <description><![CDATA[Link Quaility Indication value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMSOFD0</name>
    <description><![CDATA[Demodulator Soft Decision Register 0]]></description>
    <addressOffset>0x0000026C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SOFTSYMBOL</name>
    <description><![CDATA[Soft symbol value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RDCAPT1</name>
    <description><![CDATA[Modem Readback Capture Register 2]]></description>
    <addressOffset>0x00000270</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DEMMLSEBIT</name>
    <description><![CDATA[Capture DEMMLSEBIT RC register]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DEMTHRD4</name>
    <description><![CDATA[Capture DEMTHRD4 RC register]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>DEMBDEC0</name>
    <description><![CDATA[Capture DEMBDEC0 RC register]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DEMBDEC1</name>
    <description><![CDATA[Capture DEMBDEC1 RC register]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DEMCHFI0</name>
    <description><![CDATA[Capture DEMCHFI0 RC register]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>DEMCHFI1</name>
    <description><![CDATA[Capture DEMCHFI1 RC register]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DEMFRAC4</name>
    <description><![CDATA[Capture DEMFRAC4 RC register]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DEMFRAC5</name>
    <description><![CDATA[Capture DEMFRAC5 RC register]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
