zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>DEMTHRD4</name>
    <description><![CDATA[Demodulator Soft Decision Threshold Register 4]]></description>
    <addressOffset>0x00000274</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>DECISION</name>
    <description><![CDATA[Multilevel decision]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMMLSEBIT</name>
    <description><![CDATA[Demodulator Maximum Likelihood Sequence Estimation Register]]></description>
    <addressOffset>0x00000278</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>MLSEBIT</name>
    <description><![CDATA[MLSE decoded output bit]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMBDEC0</name>
    <description><![CDATA[I signal after the BDEC module]]></description>
    <addressOffset>0x0000027C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>IVAL</name>
    <description><![CDATA[13-bit I value]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMBDEC1</name>
    <description><![CDATA[Q signal after the BDEC module]]></description>
    <addressOffset>0x00000280</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>QVAL</name>
    <description><![CDATA[13-bit Q value]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCHFI0</name>
    <description><![CDATA[I signal after the CHFI module]]></description>
    <addressOffset>0x00000284</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>IVAL</name>
    <description><![CDATA[13-bit I value]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMCHFI1</name>
    <description><![CDATA[Q signal after the CHFI module]]></description>
    <addressOffset>0x00000288</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>QVAL</name>
    <description><![CDATA[13-bit Q value]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFRAC4</name>
    <description><![CDATA[I signal after the FRAC module]]></description>
    <addressOffset>0x0000028C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>IVAL</name>
    <description><![CDATA[13-bit I value]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEMFRAC5</name>
    <description><![CDATA[Q signal after the FRAC module]]></description>
    <addressOffset>0x00000290</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>QVAL</name>
    <description><![CDATA[13-bit Q value]]></description>
    <bitRange>[12:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>RF24_FSCA</name>
<description><![CDATA[Component for fsca register bank]]></description>
<baseAddress>0x40044000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000200</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>SYNTHREG00</name>
    <description><![CDATA[Basic synth programmability]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x60000000</resetValue>
<fields>
  <field>
    <name>SYNTHTXRXZ</name>
    <description><![CDATA[1(0) for Transmit(Receive) mode.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>HSDCLOCKMASTERENABLE</name>
    <description><![CDATA[Master control to enable clocks coming in from HSD]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>RETIMERCLRZMASTER</name>
    <description><![CDATA[Master control for retimer_clrz]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[28:7]</bitRange>
  </field>
  <field>
    <name>IS32KHZXTAL</name>
    <description><![CDATA[1 (0) for 32KHz crystal (48MHz Xtal)]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>IS24MHZXTAL</name>
    <description><![CDATA[1 (0) for 24MHz xtal (48MHz)]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>SYNTHTUNEPHASE</name>
    <description><![CDATA[LSB is synthesizer's resetz. Refer to synthesizer-software interface protocol.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGPREDIV</name>
    <description><![CDATA[Various divider ratios for pre-divider]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PLLPREDIVRATIO</name>
    <description><![CDATA[Fxtal_PLL = 48MHz/REFINT = Divider ratio in PLL mode]]></description>
    <bitRange>[31:26]</bitRange>
  </field>
  <field>
    <name>FINECALIBPREDIVRATIO</name>
    <description><![CDATA[Xtalid2 = 48MHz/F_fine_Calib = Divider ratio during fine calibration mode to get better kdco estimation]]></description>
    <bitRange>[25:15]</bitRange>
  </field>
  <field>
    <name>MIDCALIBPREDIVRATIO</name>
    <description><![CDATA[FREF/REFCLK for mid sar <9u>For fast lock mode]]></description>
    <bitRange>[14:6]</bitRange>
  </field>
  <field>
    <name>DEFAULTCALIBPREDIVRATIO</name>
    <description><![CDATA[Xtalid for all calibration states; except Mid and fine. = 48MHz/F_calib . Sw. prog.]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGPLLMVALUE</name>
    <description><![CDATA[M value during PLL operation]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FREFDITHEREN</name>
    <description><![CDATA[1 Enables FREF dither using SD]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED28</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[30:28]</bitRange>
  </field>
  <field>
    <name>PLLMVALUE</name>
    <description><![CDATA[Fout/REFCLK <17.11u>]]></description>
    <bitRange>[27:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGOTHERMVALUE</name>
    <description><![CDATA[M value during other than PLL operation]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>MIDMVALUE</name>
    <description><![CDATA[Fout/REFCLK for mid sar <15u>]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DEFAULTMVALUE</name>
    <description><![CDATA[M_Coarse = Fout/F_calib. Sw prog.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGFINECALMVALUE</name>
    <description><![CDATA[Legacy Values for FLL]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>FINECALMVALUE</name>
    <description><![CDATA[M value during fine bank calibration]]></description>
    <bitRange>[17:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGFORCEDCO</name>
    <description><![CDATA[External user force for DCO banks]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED30</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>TSTDCOFINEREG</name>
    <description><![CDATA[DCO's fine code to be forced in test mode]]></description>
    <bitRange>[29:22]</bitRange>
  </field>
  <field>
    <name>TSTDCOSDREG</name>
    <description><![CDATA[DCO's SD code to be forced in test mode]]></description>
    <bitRange>[21:14]</bitRange>
  </field>
  <field>
    <name>TSTDCOMIDREG</name>
    <description><![CDATA[DCO's mid code to be forced in test mode]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>TSTDCOCOARSEREG</name>
    <description><![CDATA[DCO's coarse code to be forced in test mode]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>TSTFORCECMFCODES</name>
    <description><![CDATA[111/110/100/000. 'cmf'. Make appropriate bit 1 to force DCO's coarse/mid/fine wo SD.]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>TSTFORCESDCODE</name>
    <description><![CDATA[1 to force 8-bit code at input of DCO's SDM]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGSDCONTROL</name>
    <description><![CDATA[SD configuration]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x08000000</resetValue>
<fields>
  <field>
    <name>SDMDLYDOUBLEEN</name>
    <description><![CDATA[1 doubles delay through sdm_dly_mat module. 0 is default single delay equal to bit 29 (sdm_dly_2or1z)]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>SDMDLYMATDIS</name>
    <description><![CDATA[1 to disable(reset) delay matching block that compensates for delay through SDM.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>SDMDITHERMODE</name>
    <description><![CDATA[How much dither to add on input in SDM.]]></description>
    <bitRange>[28:27]</bitRange>
  </field>
  <field>
    <name>SDMORDER1OR2Z</name>
    <description><![CDATA[1 to make SDM 1st order instead of default (0) 2nd order.]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>SDMDEMDIS</name>
    <description><![CDATA[1 to disable the SDM Dynamic Element Matching logic.]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>MPXCANDIS</name>
    <description><![CDATA[1 to disable mpx cancellation logic in Synth loop in TX mode.]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>SDMDIS</name>
    <description><![CDATA[1 to disable SDM (contribute 0 fine LSBs).]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>TSTDCOSDMOPREG</name>
    <description><![CDATA[DCO's SD code to be forced in test mode and would take this value when synthreg05[0] is '1']]></description>
    <bitRange>[22:20]</bitRange>
  </field>
  <field>
    <name>TSTFORCESDMOP</name>
    <description><![CDATA[1' selects tst_dco_sdm_op_reg instead of SDM 3-bit output]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>RETENTIONMODEEN</name>
    <description><![CDATA[1 to enable synth retention mode - the INL LUT is kept without being reset even if a tune sequence is executed.]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>SDMDLYMODE</name>
    <description><![CDATA[Selects delay through integer portion of fine bits to match that with SD engine. 0=1-delay; 1=2-delay; 2=3-delay and 3=4-delay]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGDTSTCTRL</name>
    <description><![CDATA[Digital configuration register 1]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00400000</resetValue>
<fields>
  <field>
    <name>DTSTCLKSEL</name>
    <description><![CDATA[Refer to DTST table]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>DTSTDATASEL</name>
    <description><![CDATA[Refer to DTST table]]></description>
    <bitRange>[28:25]</bitRange>
  </field>
  <field>
    <name>RFCOREDTSTEN</name>
    <description><![CDATA[Refer to DTST table]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>DTSTREADEN</name>
    <description><![CDATA[Refer to DTST table]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>READDTSTBYSW</name>
    <description><![CDATA[1 to read synth dtst data output ports through software register (synthoutreg10).]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[21:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGDIGCFG2</name>
    <description><![CDATA[Digital configuration register 2]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FINEBOTCODEDURINGCALIB</name>
    <description><![CDATA[Fine code value during bottom calibration state. Should be more than 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>FINETOPCODEDURINGCALIB</name>
    <description><![CDATA[Fine code value during top calibration state]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGTDCTHRESH</name>
    <description><![CDATA[TDC programmability]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00003010</resetValue>
<fields>
  <field>
    <name>MEMKTINV</name>
    <description><![CDATA[1/Kt = 1/tdc_calib_avg <0.9u>. Compensate TDC gain]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EDGESELTDCTH2</name>
    <description><![CDATA[Fractional value computed from the TDC data is compared against this value to select the REFCLK sampled on positive or negative edge of DCO clock. If the fractional value is less than edgesel_tdc_th1 or greater than edgesel_tdc_th2 ; it means that the REF (...)]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>EDGESELTDCTH1</name>
    <description><![CDATA[Fractional value computed from the TDC data is compared against this value to select the REFCLK sampled on positive or negative edge of DCO clock. If the fractional value is less than edgesel_tdc_th1 or greater than edgesel_tdc_th2 ; it means that the REF (...)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGLOOPCOEFF</name>
    <description><![CDATA[PLL loop parameters]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PLLCOEFFDYNCHANGE</name>
    <description><![CDATA[This bit has to be toggled if the coefficients has to be changed on-the-fly]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IIRFILTBW</name>
    <description><![CDATA[BW for IIR filter. 00; 01; 10; 11 give K=2; 4; 8 and 16]]></description>
    <bitRange>[30:29]</bitRange>
  </field>
  <field>
    <name>IIRFILTERORDER</name>
    <description><![CDATA[1' is 2nd order; '0' is 1st order. Should go with iir_en]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>IIRFILTEN</name>
    <description><![CDATA[Enables IIR filter along with regular filter]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>ALPHAHIGHPREC</name>
    <description><![CDATA[1' sets the format for pll_alpha as <8.4u> else <12u>.To be used in case of very small alpha values where f3db is very small as compared to REFINT frequency]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>PLLBETA</name>
    <description><![CDATA[2*pi* f3db/KDCO <14u>]]></description>
    <bitRange>[25:12]</bitRange>
  </field>
  <field>
    <name>PLLALPHA</name>
    <description><![CDATA[pi^2 * f3db^2 * TREF /(KDCO*DF^2); where DF is the damping factor <12u> or <8.4u>]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGPLLCONTROL</name>
    <description><![CDATA[PLL control register 1]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000302</resetValue>
<fields>
  <field>
    <name>RESERVED24</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>DELAYRETIMERINP</name>
    <description><![CDATA[Delays generation of REFCLK_RETIMED_CLK by:]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>RECENTERDISABLE</name>
    <description><![CDATA[Recentering is diabled then intrrupt won't be given]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>RECENTERTHRESHHOLD</name>
    <description><![CDATA[If phase error is greater than this threshold for 128 consequtive times; recentering would happen. Current implementation sends out intrrupt to CM0 for further action and keep continuing in the PLL mode]]></description>
    <bitRange>[19:14]</bitRange>
  </field>
  <field>
    <name>PLLHWFINECALIBEN</name>
    <description><![CDATA[Frequencey is calculated from PLL HW instead of old fb_cntr hw. '0' selects the old hw]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>CKVD64LATENCYFORMPXCAN</name>
    <description><![CDATA[Latency of ckvd64 clock to delay can signal to match add path]]></description>
    <bitRange>[12:10]</bitRange>
  </field>
  <field>
    <name>CKVD16LATENCYFORMPXCAN</name>
    <description><![CDATA[Latency of ckvd16 clock to delay can signal to match add path]]></description>
    <bitRange>[9:7]</bitRange>
  </field>
  <field>
    <name>REFCLKLATCHEDGESEL</name>
    <description><![CDATA[0 The retimed refclk from the analog is latched with the positive edge of DCOBY8 clock in the digigal 1: negative edge is used.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TDCSATENABLE</name>
    <description><![CDATA[1 enables the saturation of fractional value based on the TDC data to 1]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>TDCCALIBAVERAGE</name>
    <description><![CDATA[Sets the number of calibration cycles for the TDC]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
