zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>SYNTHREGFSMCONTROL</name>
    <description><![CDATA[FSM control register 1]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x1C000000</resetValue>
<fields>
  <field>
    <name>RESERVED31</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>DYNAMICCLOCKSWITCH</name>
    <description><![CDATA[1' enables dynamic switch from/to 32Khz clock to FREF clock: Set this before changing pll_fll_z dynamically]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>PLLFREEZE</name>
    <description><![CDATA[1: Freezes the PLL loop.Phase error is calculated but not applied.]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>RETIMERFREEZE</name>
    <description><![CDATA[1 : Freezes retimer code while generating phase error]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>FINECODEFREEZE</name>
    <description><![CDATA[1 : Freezes fine code that is applied to DCO fine bank; without SD]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>TDCFREEZE</name>
    <description><![CDATA[1 : Freezes fine code that is applied to DCO fine bank; without SD]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>PLLRESET</name>
    <description><![CDATA[1: Resets the accumulators in the PLL]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED23</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>SKIPCALIBSTENABLE</name>
    <description><![CDATA[1: Skips the initial calibration state and directly proceeds to PLL/FLL state depending on 'pll_fll_z'.Coarse and the mod code has to be forced to valid values using 'tst_dco_force_c_m_f_codes']]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>RESERVED19</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[21:19]</bitRange>
  </field>
  <field>
    <name>MIDSARINITVAL</name>
    <description><![CDATA[Statrting value of SAR algo for MID bank calibration]]></description>
    <bitRange>[18:13]</bitRange>
  </field>
  <field>
    <name>COARSEPRECALVAL</name>
    <description><![CDATA[Precal value for coarse bank while skiping calibration]]></description>
    <bitRange>[12:9]</bitRange>
  </field>
  <field>
    <name>MIDPRECALVAL</name>
    <description><![CDATA[Precal value for mid bank while skiping calibration]]></description>
    <bitRange>[8:3]</bitRange>
  </field>
  <field>
    <name>COARSECALSKIPEN</name>
    <description><![CDATA[Skips coarse and goes to mid]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>MIDCALSKIPEN</name>
    <description><![CDATA[Skips mid calibration and goes to tdc]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TDCCALSKIPEN</name>
    <description><![CDATA[Skips TDC calibration and goes to fine calibration; Precal value should be given on kt_inv_]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGPETHRESH</name>
    <description><![CDATA[Phase error threshold]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x1F044C1F</resetValue>
<fields>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>PHASEERRORLOCKTHRESHCNT</name>
    <description><![CDATA[Phase error threshhold]]></description>
    <bitRange>[28:24]</bitRange>
  </field>
  <field>
    <name>PHASEERRORLOCKTHRESH</name>
    <description><![CDATA[Declare lock for PLL if phase error is less than this threshold for consecutive 'phase_error_lock_thresh_cnt' <2.6>]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>PHASEERRORDISCARDENABLE</name>
    <description><![CDATA[1 to enable this feature]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>PHASEERRORDISCARDCNT</name>
    <description><![CDATA[Do not update the PLL loop if abs(phase_error) is greater than 'phase_error_discard_th'. Update loop if this happens for consecutive 'phase_error_discard_cnt' of REFCLK cycles.]]></description>
    <bitRange>[13:10]</bitRange>
  </field>
  <field>
    <name>PHASEERRORDISCARDTH</name>
    <description><![CDATA[Do not update the loop if the absolute value of the phase error is greater than this threshold <4.6u>]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGPLLCONTROL2</name>
    <description><![CDATA[PLL control register 2]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000030</resetValue>
<fields>
  <field>
    <name>PLLOPENLOOPMODE1PTMOD</name>
    <description><![CDATA[Enable open loop pll]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[30:16]</bitRange>
  </field>
  <field>
    <name>XTALIDFRAC</name>
    <description><![CDATA[Fractional part of PLL M value; when fref dither is ON]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>POMIDSEL</name>
    <description><![CDATA[Port to ANA for DCO. 1 should enable mid bank]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>POFINESEL</name>
    <description><![CDATA[Port to ANA for DCO. 1 should enable fine bank]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>POTAILRESTRIM</name>
    <description><![CDATA[Trim bits for tail resistance inside DCO. Port to ANA for DCO]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFCFG</name>
    <description><![CDATA[Modulator interpolating shaping filter configuration]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>TXFOFF</name>
    <description><![CDATA[Tx frequency offset]]></description>
    <bitRange>[19:8]</bitRange>
  </field>
  <field>
    <name>USESHAPED154</name>
    <description><![CDATA[Use shaped IEEE 802.15.4 modulation. Only valid if USEZU is active.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>USEZU</name>
    <description><![CDATA[Use ZigBee modulator unit]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SHAPEGAIN</name>
    <description><![CDATA[Multiplies the shape by a gain factor. 1/2/4/8.]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>INIT</name>
    <description><![CDATA[Synchronous (re-)initialization of MODISF module. This has no effect if module is not enabled.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>MODULEEN</name>
    <description><![CDATA[Synchronous enable of MODISF module]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFSHAPE0</name>
    <description><![CDATA[Modulation shape register 0]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SHAPE3</name>
    <description><![CDATA[Shape element 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SHAPE2</name>
    <description><![CDATA[Shape element 2]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>SHAPE1</name>
    <description><![CDATA[Shape element 1]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SHAPE0</name>
    <description><![CDATA[Shape element 0]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFSHAPE1</name>
    <description><![CDATA[Modulation shape register 1]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SHAPE7</name>
    <description><![CDATA[Shape element 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SHAPE6</name>
    <description><![CDATA[Shape element 6]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>SHAPE5</name>
    <description><![CDATA[Shape element 5]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SHAPE4</name>
    <description><![CDATA[Shape element 4]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFSHAPE2</name>
    <description><![CDATA[Modulation shape register 2]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SHAPE11</name>
    <description><![CDATA[Shape element 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SHAPE10</name>
    <description><![CDATA[Shape element 10]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>SHAPE9</name>
    <description><![CDATA[Shape element 9]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SHAPE8</name>
    <description><![CDATA[Shape element 8]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFSHAPE3</name>
    <description><![CDATA[Modulation shape register 3]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SHAPE15</name>
    <description><![CDATA[Shape element 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SHAPE14</name>
    <description><![CDATA[Shape element 14]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>SHAPE13</name>
    <description><![CDATA[Shape element 13]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SHAPE12</name>
    <description><![CDATA[Shape element 12]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFSHAPE4</name>
    <description><![CDATA[Modulation shape register 4]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SHAPE19</name>
    <description><![CDATA[Shape element 19]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SHAPE18</name>
    <description><![CDATA[Shape element 18]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>SHAPE17</name>
    <description><![CDATA[Shape element 17]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SHAPE16</name>
    <description><![CDATA[Shape element 16]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MODISFSHAPE5</name>
    <description><![CDATA[Modulation shape register 5]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SHAPE23</name>
    <description><![CDATA[Shape element 23]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SHAPE22</name>
    <description><![CDATA[Shape element 22]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>SHAPE21</name>
    <description><![CDATA[Shape element 21]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>SHAPE20</name>
    <description><![CDATA[Shape element 20]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGDTXGAIN</name>
    <description><![CDATA[Synthesizer addition path gain]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ADDPATHGAIN</name>
    <description><![CDATA[Addition path gain. DTX_RESoultion/KDCO_GAIN; by firmware]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGANADIV</name>
    <description><![CDATA[Synthesizer analog divider control]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00012067</resetValue>
<fields>
  <field>
    <name>COARSECAP</name>
    <description><![CDATA[Optional re-centering capacitance for VCO (2 bits).  Each bit can lower VCO by 100MHz. Off by default]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>ENKICKSTART</name>
    <description><![CDATA[Enable kick start feature in VCO. Should be low by default.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[28:18]</bitRange>
  </field>
  <field>
    <name>RETIMERISO</name>
    <description><![CDATA[Retimer_ISO]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>CTRLNMIREF</name>
    <description><![CDATA[Trim code for NMOS in the divider]]></description>
    <bitRange>[16:14]</bitRange>
  </field>
  <field>
    <name>CTRLPMIREF</name>
    <description><![CDATA[Trim code for PMOS in the divider]]></description>
    <bitRange>[13:11]</bitRange>
  </field>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[10:7]</bitRange>
  </field>
  <field>
    <name>ENADC</name>
    <description><![CDATA[Enable divider that generates ADC clock]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>ENSYNTH</name>
    <description><![CDATA[Enable divider that generates synth clock]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>ENTXPH180</name>
    <description><![CDATA[Enable divider that generates in phase TX clock]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ENTXPH0</name>
    <description><![CDATA[Enable divider that generates out of phase TX clock]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ENRXQ</name>
    <description><![CDATA[Enable divider that generates in phase RX clock]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>ENRXI</name>
    <description><![CDATA[Enable divider that generates out of phase RX clock]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DIVBUFENABLE</name>
    <description><![CDATA[Enables divider]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGPLLCONTROL3</name>
    <description><![CDATA[PLL control register 3]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGFSMCONTROL2</name>
    <description><![CDATA[FSM control register 2]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>FINESTARTCODE</name>
    <description><![CDATA[Starting code of fine bank. Used as a starting point for all calibration and at the start of PLL state]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGFSMCONTROL3</name>
    <description><![CDATA[FSM control register 2]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHREGANACFGSPARE</name>
    <description><![CDATA[Analog config spare register]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHSTATUS0</name>
    <description><![CDATA[Synthesizer debug output]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>FBCNT</name>
    <description><![CDATA[Fb_cnt. For debug.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHSTATUS1</name>
    <description><![CDATA[Synth tune status]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>TUNESTATUS</name>
    <description><![CDATA[Lower 3-bits shows tune status of the synth during calibration. Used to interact with firmware and part of firmware routines. (Can cause interrupt from FSCA to CPU.)]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHSTATUS2</name>
    <description><![CDATA[DCO frequency span]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FDCOSPAN</name>
    <description><![CDATA[Lower 19-bits gives DCO span at the end of fine bank calibration. Fdco_Span/1KHz. Used by firmware to compute and write m words; slopes etc.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNTHSTATUS3</name>
    <description><![CDATA[Synth output data]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DTSTREAD</name>
    <description><![CDATA[For debug. Some Ens.]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>TDCCALIBAVG</name>
    <description><![CDATA[Average of inverter delay calculated by HW at the end of the TDC calibration. Used by firmware.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DDICTRL</name>
    <description><![CDATA[DDI Interface Control]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DDIRESTART</name>
    <description><![CDATA[Resets the DDI Master to IDLE state]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DDISAFEPARK</name>
    <description><![CDATA[Parks the bus to a Safe State]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DDISTATUS</name>
    <description><![CDATA[DDI Interface Status]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA['1' when Trasaction is active]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI1CTRL</name>
    <description><![CDATA[ADI Interface 1 Control]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>WRS</name>
    <description><![CDATA[Transaction size]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>WEN</name>
    <description><![CDATA[Read enable configuration.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI1CLK</name>
    <description><![CDATA[ADI Interface 1 Clock]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CLK</name>
    <description><![CDATA[Generates a clock transaction]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI1CLRREQ</name>
    <description><![CDATA[ADI Interface 1 Clear Request]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ0</name>
    <description><![CDATA[Clears the REQ toggler to]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI1ADDWDATA</name>
    <description><![CDATA[ADI Interface 1 Address and Write Data]]></description>
    <addressOffset>0x00000114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[ADI1 Address to analog registers in range 0..127]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>WDATA</name>
    <description><![CDATA[ADI1 Write Data]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
