zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>ADI1RD</name>
    <description><![CDATA[ADI Interface 1 Read Data]]></description>
    <addressOffset>0x00000118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>ACK</name>
    <description><![CDATA[Self-Timed Operation Done/Read data valid]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RDATA</name>
    <description><![CDATA[ADI0 Read Data]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIVCTRL</name>
    <description><![CDATA[Serial Divider Control Register]]></description>
    <addressOffset>0x0000011C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[Divider HW is busy]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIVIDEND</name>
    <description><![CDATA[Serial Divider]]></description>
    <addressOffset>0x00000120</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DIVIDEND</name>
    <description><![CDATA[Dividend input (write only; reads 0)]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIVISOR</name>
    <description><![CDATA[Serial Divider]]></description>
    <addressOffset>0x00000124</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DIVISOR</name>
    <description><![CDATA[Divisor input]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>QUOTIENT</name>
    <description><![CDATA[Serial Divider]]></description>
    <addressOffset>0x00000128</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>QUOTIENT</name>
    <description><![CDATA[Quotient output. Quotient = Dividend / Divisor]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>RF24_RFE</name>
<description><![CDATA[Component for rfe register bank]]></description>
<baseAddress>0x40046000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000100</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>RFEENABLE</name>
    <description><![CDATA[RF Engine Enable Register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>ACC1</name>
    <description><![CDATA[Enables magnitude accumulator 1]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ACC0</name>
    <description><![CDATA[Enables magnitude accumulator 0]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>LOC_TIM</name>
    <description><![CDATA[Enables the Local timer]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TOPSM</name>
    <description><![CDATA[Enables the TOPsm]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEINIT</name>
    <description><![CDATA[RF Engine Initialization Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>ACC1</name>
    <description><![CDATA[Synch reset accumulator 1]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>ACC0</name>
    <description><![CDATA[Sunch reset accumulator 0]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>LOC_TIM</name>
    <description><![CDATA[Synch reset Local timer]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TOPSM</name>
    <description><![CDATA[Synch reset TOPsm]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEPDREQ</name>
    <description><![CDATA[RF Engine Power-down Register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>TOPSMPDREQ</name>
    <description><![CDATA[Requests power down for TOPsm core]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFESTROBES0</name>
    <description><![CDATA[RF Engine (RFE) Strobe Register 0]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>EVENT2</name>
    <description><![CDATA[FW event 2]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>EVENT1</name>
    <description><![CDATA[FW event 1]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EVENT0</name>
    <description><![CDATA[FW event 0]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CMDDONE</name>
    <description><![CDATA[Signal command done to CPE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEEVENT0</name>
    <description><![CDATA[RFE Event Flag Register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENT</name>
    <description><![CDATA[Event flags for timer; counter; accumulators and command handling]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEEVENTMSK0</name>
    <description><![CDATA[RFE Event Mask Register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTMSK</name>
    <description><![CDATA[Event mask for timer; counter; accumulators and command handling]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEEVENTCLR0</name>
    <description><![CDATA[RFE Event Clear Register]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTCLR</name>
    <description><![CDATA[Clear event flag for timer; counter; accumulators and command handling]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEPROGRAMSRC</name>
    <description><![CDATA[RFE Program Source Configuration]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>ROMBANK</name>
    <description><![CDATA[RFE ROM configuration]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>RAMROM</name>
    <description><![CDATA[Map RFE RAM as ROM]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEAPI</name>
    <description><![CDATA[RFE API Command Register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>RFECMD</name>
    <description><![CDATA[RFE Command]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFECMDPAR0</name>
    <description><![CDATA[RFE Command Parameter 0]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR0</name>
    <description><![CDATA[Parameter 0]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFECMDPAR1</name>
    <description><![CDATA[RFE Command Parameter 1]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR1</name>
    <description><![CDATA[Parameter 1]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFEMSGBOX</name>
    <description><![CDATA[RFE Command Status and Message Box Register]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MSG</name>
    <description><![CDATA[Diverse status; error; report bits from RFE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFECPEIRQ</name>
    <description><![CDATA[CPE Interrupt Register]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>CMDSTACHG</name>
    <description><![CDATA[The CMDSTA has changed]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>MSGBOX</name>
    <description><![CDATA[There is something in the MSGBOX]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFECPEIRQMSK</name>
    <description><![CDATA[CPE Interrupt Mask Register]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>CMDSTACHGMSK</name>
    <description><![CDATA['1' to allow RFE_CMDSTACHG IRQ to CPE]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>MSGBOXMSK</name>
    <description><![CDATA['1' to allow MSGBOX IRQ to CPE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCESEND</name>
    <description><![CDATA[RFE-to-MCE Send Command Register]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>RFECMD</name>
    <description><![CDATA[Command to send to the MCE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCERCEV</name>
    <description><![CDATA[MCE-to-RFE Receive Command Register]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>MCECMD</name>
    <description><![CDATA[Command received from MCE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI0CTRL</name>
    <description><![CDATA[ADI Interface 0 Control Register]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>WRS</name>
    <description><![CDATA[Transaction size]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>WEN</name>
    <description><![CDATA[Read enable configuration.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI0CLK</name>
    <description><![CDATA[ADI Interface 0 Clock]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CLK</name>
    <description><![CDATA[Generates a clock transaction]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI0CLRREQ</name>
    <description><![CDATA[ADI Interface 0 Clear Request]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ0</name>
    <description><![CDATA[Clears the REQ toggler to]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI0ADDWDATA</name>
    <description><![CDATA[ADI Interface 0 Address and Write Data]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[ADI0 Address to analog registers in range 0..63]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>WDATA</name>
    <description><![CDATA[ADI0 Write Data]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADI0RD</name>
    <description><![CDATA[ADI Interface 0 Read Data]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>ACK</name>
    <description><![CDATA[Self-Timed Operation Done/Read data valid]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RDATA</name>
    <description><![CDATA[ADI0 Read Data]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RSSIOFFSET</name>
    <description><![CDATA[RSSI Offset Adjustment Register]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>OFFSET</name>
    <description><![CDATA[Offset to convert to dBm (unsigned)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RSSIVAL</name>
    <description><![CDATA[RSSI Value Register]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[RSSI current value. If -128 (0x80) the value is not yet valid.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RSSIMAXVAL</name>
    <description><![CDATA[RSSI Maximum Value Register]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[RSSI max value since start of measurements cycle. If -128 (0x80) the value is invalid.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MAGNCTRL0</name>
    <description><![CDATA[Magnitude estimator 0 control register]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ACC0PERMODE</name>
    <description><![CDATA[Enable periodic mode]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>ACC0SCALE</name>
    <description><![CDATA[Scaling value; by factor 1/2^(acc0scale)]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>ACC0PERIOD</name>
    <description><![CDATA[Accumulation period; in incoming samples]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MAGNCTRL1</name>
    <description><![CDATA[Magnitude estimator 1 control register]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>ACC1PERMODE</name>
    <description><![CDATA[Enable periodic mode]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>ACC1SCALE</name>
    <description><![CDATA[Scaling value; by factor 1/2^(acc1scale)]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>ACC1PERIOD</name>
    <description><![CDATA[Accumulation period; in incoming samples]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MAGNACC0</name>
    <description><![CDATA[Magnitude estimator 0 accumulator value]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ACCVAL</name>
    <description><![CDATA[Accumulated magnitude over the period]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MAGNACC1</name>
    <description><![CDATA[Magnitude estimator 1 accumulator value]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>ACCVAL</name>
    <description><![CDATA[Accumulated magnitude over the period]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MATHACCELIN</name>
    <description><![CDATA[Math accellerator input value]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Input value in linear units]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LIN2LOGOUT</name>
    <description><![CDATA[Lin2Log output register]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>LOGVAL</name>
    <description><![CDATA[Logarithmic output value. LIN2LOGOUT = 20*log10(MATHACCELIN).]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIVBY3OUT</name>
    <description><![CDATA[Divide by three output register]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>DIV3</name>
    <description><![CDATA[DIVBY3OUT = MATHACCELIN/3. Supports up to 46 as input value; higher values are saturated.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GAINCTRL</name>
    <description><![CDATA[RFE gain control register]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ADCDIGDVGA</name>
    <description><![CDATA[Digital gain in ADCDIG by bitshifting I/Q samples]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFGAIN</name>
    <description><![CDATA[RF front-end gain value]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DBGAIN</name>
    <description><![CDATA[Current RF front-end gain; in dB]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
