zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>TRIM0</name>
    <description><![CDATA[RF front-end trim setting 0]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[Address for ADI0 bus]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Trim value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRIM1</name>
    <description><![CDATA[RF front-end trim setting 1]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[Address for ADI0 bus]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Trim value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRIM2</name>
    <description><![CDATA[RF front-end trim setting 2]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[Address for ADI0 bus]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Trim value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRIM3</name>
    <description><![CDATA[RF front-end trim setting 3]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[Address for ADI0 bus]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Trim value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRIM4</name>
    <description><![CDATA[RF front-end trim setting 4]]></description>
    <addressOffset>0x00000094</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[Address for ADI0 bus]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Trim Value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TRIM5</name>
    <description><![CDATA[RF front-end trim setting 5]]></description>
    <addressOffset>0x00000098</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>ADD</name>
    <description><![CDATA[Address for ADI0 bus]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[Trim Value]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETIMCTRL</name>
    <description><![CDATA[RFE local timer/counter control register]]></description>
    <addressOffset>0x0000009C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>CAPTURESOURCE</name>
    <description><![CDATA[Selects bit from event bus to use as timer capture event]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>ENABLECAPTURE</name>
    <description><![CDATA[Enable capture mode]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>COUNTERSOURCE</name>
    <description><![CDATA[Select counter clock source]]></description>
    <bitRange>[6:5]</bitRange>
  </field>
  <field>
    <name>CLEARCOUNTER</name>
    <description><![CDATA[Clear counter value]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>ENABLECOUNTER</name>
    <description><![CDATA[Enable counter]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TIMERSOURCE</name>
    <description><![CDATA[Select timer clock source]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>ENABLETIMER</name>
    <description><![CDATA[Enable timer]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETIMINC</name>
    <description><![CDATA[RFE local counter increment register]]></description>
    <addressOffset>0x000000A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>INCUNIT</name>
    <description><![CDATA[Counter = Counter + (IncUnit + 1)]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETIMPERIOD</name>
    <description><![CDATA[RFE local timer/counter period register]]></description>
    <addressOffset>0x000000A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PERIOD</name>
    <description><![CDATA[16 bit value. When period is reached a timer or counter IRQ is generated.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETIMCOUNTER</name>
    <description><![CDATA[RFE local counter value]]></description>
    <addressOffset>0x000000A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[16 bit value of counter]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETIMCAPT</name>
    <description><![CDATA[RFE local counter value]]></description>
    <addressOffset>0x000000AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VALUE</name>
    <description><![CDATA[Capture value of counter]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETRCSEND</name>
    <description><![CDATA[RFE tracer send trigger register]]></description>
    <addressOffset>0x000000B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEND</name>
    <description><![CDATA[Sends a command to the tracer]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETRCBUSY</name>
    <description><![CDATA[RFE tracer status register]]></description>
    <addressOffset>0x000000B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[Checks if the tracer is busy]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETRCCMD</name>
    <description><![CDATA[RFE tracer commmand register]]></description>
    <addressOffset>0x000000B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>PARCNT</name>
    <description><![CDATA[Number of parameters]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>PKTHDR</name>
    <description><![CDATA[Packet header]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETRCPAR0</name>
    <description><![CDATA[RFE tracer command parameter register 0]]></description>
    <addressOffset>0x000000BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR0</name>
    <description><![CDATA[Parameter 0]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFETRCPAR1</name>
    <description><![CDATA[RFE tracer command parameter register 1]]></description>
    <addressOffset>0x000000C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Register fill]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PAR1</name>
    <description><![CDATA[Parameter 1]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
