zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>CRYPTO</name>
<description><![CDATA[CRYPTO Component]]></description>
<baseAddress>0x40024000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000800</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DMAC_OPTIONS</name>
    <description><![CDATA[DMAC Options register]]></description>
    <addressOffset>0x000000F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000202</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>NR_OF_CHANNELS</name>
    <description><![CDATA[Number of channels implemented; for the EIP-120t this field has value 0x2.]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>NR_OF_PORTS</name>
    <description><![CDATA[Number of ports implemented; for the EIP-120t this field has value 0x2.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DMAC_VERSION</name>
    <description><![CDATA[DMAC Version register]]></description>
    <addressOffset>0x000000FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x01012ED1</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>HW_MAJOR_VERSION</name>
    <description><![CDATA[Major version number]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>HW_MINOR_VERSION</name>
    <description><![CDATA[Minor version number]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>HW_PATCH_LEVEL</name>
    <description><![CDATA[Patch level, starts at 0 at first delivery of this version.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>EIP_NUMBER_COMPL</name>
    <description><![CDATA[Bit-by-bit complement of the EIP_NUMBER field bits.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>EIP_NUMBER</name>
    <description><![CDATA[Binary encoding of the EIP-number of this DMA Controller (209)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_KEY2</name>
    <description><![CDATA[Clear/wipe AES_KEY2 register]]></description>
    <addressOffset>0x00000500</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>KEY2</name>
    <description><![CDATA[AES_KEY2[31+x:0+x] / AES_GHASH_H[31+x:0+x], where x = 0, 32, 64, 96 ordered from the LSW entry of this 4-deep register arrary.
The interpretation of this field depends on the crypto operation mode.
TDB - Check the Reference Manual]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_KEY3</name>
    <description><![CDATA[Clear/wipe AES_KEY3 register]]></description>
    <addressOffset>0x00000510</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>KEY3</name>
    <description><![CDATA[AES_KEY3[31+x:0+x] / AES_KEY2[159+x:128+x], where x = 0, 32, 64, 96 ordered from the LSW entry of this 4-deep register arrary.
The interpretation of this field depends on the crypto operation mode.
TDB - Check the Reference Manual]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_IV</name>
    <description><![CDATA[AES Initialization vector registers]]></description>
    <addressOffset>0x00000540</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>IV</name>
    <description><![CDATA[The interpretation of this field depends on the crypto operation mode.
TDB - Check the Reference Manual]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_CTRL</name>
    <description><![CDATA[AES Input/Output Buffer Control and Mode register]]></description>
    <addressOffset>0x00000550</addressOffset>
    <access>read-write</access>
    <resetValue>0x80000000</resetValue>
<fields>
  <field>
    <name>CONTEXT_READY</name>
    <description><![CDATA[If 1, this read-only status bit indicates that the context data registers can be overwritten and the Host is permitted to write the next context (note 2).]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>SAVED_CONTEXT_READY</name>
    <description><![CDATA[(note 1)
If 1, this status bit indicates that an AES authentication TAG and/or IV block(s) is/are available for the Host to retrieve. This bit is only asserted if the save_context bit is set to 1. The bit is mutual exclusive with the context_ready bit.
Writing a one clears the bit to zero, indicating the AES core can start its next operation. This bit is also cleared when the 4th word of the output TAG and/or IV is read.
Note: All other mode bit writes will be ignored when this mode bit is written with a one.
Note: This bit is controlled automatically by the EIP-120t for TAG read DMA operations.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>SAVE_CONTEXT</name>
    <description><![CDATA[This bit indicates that an authentication TAG or result IV needs to be stored as a result context.
Typically this bit must be set for authentication modes returning a TAG (CBC-MAC, GCM and CCM), or for basic encryption modes that require future continuation with the current result IV.
If this bit is set, the engine will retain its full context until the TAG and/or IV registers are read.
The TAG or IV must be read before the AES engine can start a new operation.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[28:25]</bitRange>
  </field>
  <field>
    <name>CCM_M</name>
    <description><![CDATA[Defines M that indicates the length of the authentication field for CCM operations; the authentication field length equals two times (the value of CCM-M plus one).
Note: The EIP-120t always returns a 128-bit authentication field, of which the M least significant bytes are valid. All values are supported.]]></description>
    <bitRange>[24:22]</bitRange>
  </field>
  <field>
    <name>CCM_L</name>
    <description><![CDATA[Defines L that indicates the width of the length field for CCM operations; the length field in bytes equals the value of CMM-L plus one. All values are supported.]]></description>
    <bitRange>[21:19]</bitRange>
  </field>
  <field>
    <name>CCM</name>
    <description><![CDATA[If set to 1, AES-CCM is selected
AES-CCM is a combined mode, using AES for both authentication and encryption.
Note: Selecting AES-CCM mode requires writing of the AAD length register after all other registers.
Note: The CTR mode bit in this register must also be set to 1 to enable AES-CTR; selecting other AES modes than CTR mode is invalid.]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>GCM</name>
    <description><![CDATA[Set these bits to 11, to select AES-GCM mode.
AES-GCM is a combined mode, using the Galois field multiplier GF(2128) for authentication and AES-CTR mode for encryption.
Note: The CTR mode bit in this register must also be set to 1 to enable AES-CTR
Bit combination description:
00 = no GCM mode
01 = reserved, do not select
10 = reserved, do not select
11 = autonomous GHASH (both H and Y0-encrypted calculated internally)
Note: The EIP-120t-1 configuration only supports mode 11 (autonomous GHASH), other GCM modes are not allowed. So for the EIP-120t-1 configuration the only valid values are 00 and 11.
Note: The EIP-120t-2 configuration does not support GCM and therefore these bits should always be set to 00.]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>CBC_MAC</name>
    <description><![CDATA[Set to 1 to select AES-CBC MAC mode.
The direction bit must be set to 1 for this mode.
Selecting this mode requires writing the length register after all other registers.]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[14:9]</bitRange>
  </field>
  <field>
    <name>CTR_WIDTH</name>
    <description><![CDATA[Specifies the counter width for AES-CTR mode
00 = 32-bit counter
01 = 64-bit counter
10 = 96-bit counter
11 = 128-bit counter]]></description>
    <bitRange>[8:7]</bitRange>
  </field>
  <field>
    <name>CTR</name>
    <description><![CDATA[If set to 1, AES counter mode (CTR) is selected.
Note: This bit must also be set for GCM and CCM, when encryption/decryption is required.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>CBC</name>
    <description><![CDATA[If set to 1, cipher-block-chaining (CBC) mode is selected.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>KEY_SIZE</name>
    <description><![CDATA[This read-only field specifies the key size.
The key size is automatically configured when a new key is loaded via the key store module.
00 = N/A - reserved
01 = 128-bit
10 = 192-bit
11 = 256-bit Refer to section 4.7 for details on the AES key, key size section and loading.]]></description>
    <bitRange>[4:3]</bitRange>
  </field>
  <field>
    <name>DIRECTION</name>
    <description><![CDATA[If set to 1 an encrypt operation is performed.
If set to 0 a decrypt operation is performed.
This bit must be written with a 1 when CBC-MAC is selected.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>INPUT_READY</name>
    <description><![CDATA[(note 1)
If 1, this status bit indicates that the 16-byte AES input buffer is empty. The Host is permitted to write the next block of data.
Writing a one clears the bit to zero and indicates that the AES core can use the provided input data block.
Writing a 1 to this bit will be ignored.
Note: For DMA operations, this bit is automatically controlled by the EIP-120t.
After reset, this bit is 0. After writing a context (note 1), this bit will become 1.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>OUTPUT_READY</name>
    <description><![CDATA[(note 1)
If 1, this status bit indicates that an AES output block is available to be retrieved by the Host.
Writing a 0 clears the bit to zero and indicates that output data is read by the Host. The AES core can provide a next output data block.
Writing a 1 to this bit will be ignored.
Note: For DMA operations, this bit is automatically controlled by the EIP-120t.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_C_LENGTH_0</name>
    <description><![CDATA[Crypto Data Length Register (LSW)]]></description>
    <addressOffset>0x00000554</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>C_LENGTH</name>
    <description><![CDATA[Bits [31:0] of the combined data length register]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_C_LENGTH_1</name>
    <description><![CDATA[Crypto Data Length Register (MSW)]]></description>
    <addressOffset>0x00000558</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:29]</bitRange>
  </field>
  <field>
    <name>C_LENGTH</name>
    <description><![CDATA[Bits [60:32] of the combined data length register.

Bits [60:0] of the crypto length registers (LSW and MSW) store the cryptographic data length in bytes for all modes. Once processing with this context is started, this length decrements to zero. Data lengths up to (2^61 - 1) bytes are allowed.
For GCM, any value up to 2^36 - 32 bytes can be used. This is because a 32-bit counter mode is used; the maximum number of 128-bit blocks is 2^32 - 2, resulting in a maximum number of bytes of 2^36 - 32.
Writing to this register triggers the engine to start using this context. This is valid for all modes except GCM and CCM.
Note: For the combined modes (GCM and CCM), this length does not include the authentication only data; the authentication length is specified in the AES_AUTH_LENGTH register below.
All modes must have a length > 0. For the combined modes, it is allowed to have one of the lengths equal to zero.
For the basic encryption modes (ECB/CBC/CTR) it is allowed to program zero to the length field; in that case the length is assumed infinite.
All data must be byte (8-bit) aligned for stream cipher modes; bit aligned data streams are not supported by the EIP-120t. For block cipher modes, the data length must be programmed in multiples of the block cipher size, 16 bytes.
For a Host read operation, these registers return all-zeroes.]]></description>
    <bitRange>[28:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_AUTH_LENGTH</name>
    <description><![CDATA[Authentication length register]]></description>
    <addressOffset>0x0000055C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>AUTH_LENGTH</name>
    <description><![CDATA[Bits [31:0] of the authentication length register store the authentication data length in bytes for combined modes only (GCM or CCM)
Supported AAD-lengths for CCM are from 0 to (2^16 - 2^8) bytes. For GCM any value up to (2^32 - 1) bytes can be used. Once processing with this context is started, this length decrements to zero.
Writing this register triggers the engine to start using this context for GCM and CCM.
For a Host read operation, these registers return all-zeroes.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_DATA_OUT</name>
    <description><![CDATA[Data input/output register]]></description>
    <addressOffset>0x00000560</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DATA</name>
    <description><![CDATA[Data registers for output block data from the EIP-120t.
- AES_DATA_OUT_0 = AES Output Data[31:0]
- AES_DATA_OUT_1 = AES Output Data[63:32]
- AES_DATA_OUT_2 = AES Output Data[95:64]
- AES_DATA_OUT_3 = AES Output Data[127:96]
For normal operations, this register is not used, since data input and output is transferred from and to the AES core via DMA.

