zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
For a Host read operation, these registers contain the 128-bit output block from the latest AES operation. Reading from a word-aligned offset within this address range will read one word (4 bytes) of data out the 4-word deep (16 bytes = 128-bits AES block) data output buffer. The words (4 words, one full block) should be read before the core will move the next block to the data output buffer. To empty the data output buffer, the output_ready flag of the AES_CTRL register must be written.
For the modes with authentication (CBC-MAC, GCM and CCM), the invalid (message) bytes/words can be written with any data.

Note: The AAD / authentication only data is not copied to the output buffer but only used for authentication.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_DATA_IN</name>
    <description><![CDATA[Data input/output register]]></description>
    <addressOffset>0x00000560</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DATA</name>
    <description><![CDATA[Data registers for input block data to the EIP-120t.
- AES_DATA_IN_0 = AES Input Data[31:0]
- AES_DATA_IN_1 = AES Input Data[63:32]
- AES_DATA_IN_2 = AES Input Data[95:64]
- AES_DATA_IN_3 = AES Input Data[127:96]
For normal operations, this register is not used, since data input and output is transferred from and to the AES core via DMA.

For a Host write operation, these registers must be written with the 128-bit input block for the next AES operation. Writing at a word-aligned offset within this address range will store the word (4 bytes) of data into the corresponding position of 4-word deep (16 bytes = 128-bit AES block) data input buffer. This buffer is used for the next AES operation. If the last data block is not completely filled with valid data (see notes below), it is allowed to write only the words with valid data. Next AES operation is triggered by writing to the input_ready flag of the AES_CTRL register.

Note: AES typically operates on 128 bits block multiple input data. The CTR, GCM and CCM modes form an exception. The last block of a CTR-mode message may contain less than 128 bits (refer to [NIST 800-38A]): 0 < n <= 128 bits. For GCM/CCM, the last block of both AAD and message data may contain less than 128 bits (refer to [NIST 800-38D]). The EIP-120t automatically pads or masks misaligned ending data blocks with zeroes for GCM, CCM and CBC-MAC. For CTR mode, the remaining data in an unaligned data block is ignored.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AES_TAG_OUT</name>
    <description><![CDATA[AES tag output register]]></description>
    <addressOffset>0x00000570</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>AES_TAG</name>
    <description><![CDATA[This register contains the authentication TAG for the combined and authentication-only modes.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTRL_OPTIONS</name>
    <description><![CDATA[CTRL Module options register]]></description>
    <addressOffset>0x000007F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x02010093</resetValue>
<fields>
  <field>
    <name>TYPE</name>
    <description><![CDATA[This field reads 0x01 for the EIP-120t-1 device
This field reads 0x02 for the EIP-120t-2 device]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>ANH_INTERFACE</name>
    <description><![CDATA[AHB interface is available
If this bit is zero, the EIP-120t has a TCM interface]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>SHA_256</name>
    <description><![CDATA[The HASH core supports SHA-256]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>AEC_CCM</name>
    <description><![CDATA[AES-CCM is available as a single operation]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>AEC_GCM</name>
    <description><![CDATA[AES-GCM is available as a single operation]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>AES_256</name>
    <description><![CDATA[AES core supports 256-bit keys
Note: If both AES-128 and AES-256 are set to one, the AES core supports 192-bit keys as well.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>AES_128</name>
    <description><![CDATA[AES core supports 128-bit keys]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>HASH</name>
    <description><![CDATA[HASH Core is available]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>AES</name>
    <description><![CDATA[AES core is available]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>KEY_STORE</name>
    <description><![CDATA[KEY STORE is available]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTRL_VERSION</name>
    <description><![CDATA[CTRL Module version register]]></description>
    <addressOffset>0x000007FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x91108778</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>HW_MAJOR_VERSION</name>
    <description><![CDATA[Major version number]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>HW_MINOR_VERSION</name>
    <description><![CDATA[Minor version number]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>HW_PATCH_LEVEL</name>
    <description><![CDATA[Patch level, starts at 0 at first delivery of this version.]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>EIP_NUMBER_COMPL</name>
    <description><![CDATA[These bits simply contain the complement of bits [7:0] (0x87), used by a driver to ascertain that the EIP-120t register is indeed read.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>EIP_NUMBER</name>
    <description><![CDATA[These bits encode the EIP number for the EIP-120t, this field contains the value 120 (decimal) or 0x78.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CH1_EXTADDR</name>
    <description><![CDATA[Channel 1 external address]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ADDR</name>
    <description><![CDATA[Channel external address value.
When read during operation, it holds the last updated external address after being sent to the master interface.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STATUS</name>
    <description><![CDATA[DMAC status]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>PORT_ERR</name>
    <description><![CDATA[Reflects possible transfer errors on the AHB port.]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[16:2]</bitRange>
  </field>
  <field>
    <name>CH1_ACT</name>
    <description><![CDATA[A 1 indicates that channel 1 is active (DMA transfer on-going).]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CH0_ACT</name>
    <description><![CDATA[A 1 indicates that channel 0 is active (DMA transfer on-going).]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CH0_DMALENGTH</name>
    <description><![CDATA[DMAC channel length]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DMALEN</name>
    <description><![CDATA[Channel DMA length in bytes.
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Setting this register to a non-zero value starts the transfer if the channel is enabled. Therefore, this register must be written last when setting up a DMA channel!]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CH0_EXTADDR</name>
    <description><![CDATA[Channel 0 external address]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ADDR</name>
    <description><![CDATA[Channel external address value.
When read during operation, it holds the last updated external address after being sent to the master interface.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CH1_CTRL</name>
    <description><![CDATA[Channel 1 control register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>PRIO</name>
    <description><![CDATA[Channel priority:
0 - Low
1 - High
If both channels have the same priority, access of the channels to the external port is arbitrated using the Round Robin scheme. If one channel has a High priority and another one Low, the channel with the High priority is served first, in case of simultaneous access requests.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Channel enable:
0 - Disabled
1 - Enable
Note: Disabling an active channel will interrupt the DMA operation. The ongoing block transfer will be completed, but no new transfers will be requested.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CH0_CTRL</name>
    <description><![CDATA[Channel 0 control register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>PRIO</name>
    <description><![CDATA[Channel priority:
0 - Low
1 - High
If both channels have the same priority, access of the channels to the external port is arbitrated using the Round Robin scheme. If one channel has a High priority and another one Low, the channel with the High priority is served first, in case of simultaneous access requests.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Channel enable:
0 - Disabled
1 - Enable
Note: Disabling an active channel will interrupt the DMA operation. The ongoing block transfer will be completed, but no new transfers will be requested.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERSR</name>
    <description><![CDATA[DMAC Port error raw status]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_2</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>PORT1_AHB_ERROR</name>
    <description><![CDATA[A 1 indicates that the EIP-101m has detected an AHB bus error]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>PORT1_CHANNEL</name>
    <description><![CDATA[Indicates which channel has serviced last (channel 0 or channel 1) by AHB master port.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CH1_DMALENGTH</name>
    <description><![CDATA[DMAC channel length]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DMALEN</name>
    <description><![CDATA[Channel DMA length in bytes.
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Setting this register to a non-zero value starts the transfer if the channel is enabled. Therefore, this register must be written last when setting up a DMA channel!]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWRES</name>
    <description><![CDATA[DMAC software reset]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SWRES</name>
    <description><![CDATA[Software reset enable 0 = disabled 1 = enabled (self-cleared to zero).
Note: Completion of the software reset must be checked via the DMAC_STATUS register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MST_RUNPARAMS</name>
    <description><![CDATA[DMAC Master run-time parameters]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00002400</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>AHB_MST1_BURST_SIZE</name>
    <description><![CDATA[Maximum burst size that can be performed on the AHB bus
0010b = 4 bytes (default)
0011b = 8 bytes
0100b = 16 bytes
0101b = 32 bytes
0110b = 64 bytes
Others = reserved]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>AHB_MST1_IDLE_EN</name>
    <description><![CDATA[Idle insertion between consecutive burst transfers on AHB
0 - No Idle insertion
1 - Idle insertion]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>AHB_MST1_INCR_EN</name>
    <description><![CDATA[Burst length type of AHB transfer
0 - unspecified length burst transfers
1 - fixed length burst or single transfers]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>AHB_MST1_LOCK_EN</name>
    <description><![CDATA[Locked transform on AHB
0 - transfers are not locked
1 - transfers are locked]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>AHB_MST1_BIGEND</name>
    <description><![CDATA[Endianess for the AHB master
0 - little endian
1 - big endian]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INT_CFG</name>
    <description><![CDATA[Interrupt configuration]]></description>
    <addressOffset>0x00000780</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LEVEL</name>
    <description><![CDATA[If this bit is zero, the interrupt output is a pulse
If this bit is set to one, the interrupt is a level interrupt that must be cleared by writing the interrupt clear register
This bit is applicable for both interrupt output signals.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INT_CLR</name>
    <description><![CDATA[Interrupt clear]]></description>
    <addressOffset>0x00000788</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DMA_BUS_ERR</name>
    <description><![CDATA[If a one is written to this bit, the DMA bus error status is cleared, writing a zero has no effect.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>KEY_ST_WR_ERR</name>
    <description><![CDATA[If a one is written to this bit, the key store write error status is cleared, writing a zero has no effect.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>KEY_ST_RD_ERR</name>
    <description><![CDATA[If a one is written to this bit, the key store read error status is cleared, writing a zero has no effect.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[28:2]</bitRange>
  </field>
  <field>
    <name>DMA_IN_DONE</name>
    <description><![CDATA[If a one is written to this bit, the DMA in done (irq_dma_in_done) interrupt output is cleared, writing a zero has no effect.
Note that clearing an interrupt only makes sense if the interrupt output is programmed as level (refer to CTRL_INT_CFG)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESULT_AV</name>
    <description><![CDATA[If a one is written to this bit, the result available (irq_result_av) interrupt output is cleared, writing a zero has no effect.
Note that clearing an interrupt only makes sense if the interrupt output is programmed as level (refer to CTRL_INT_CFG)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INT_SET</name>
    <description><![CDATA[Interrupt set]]></description>
    <addressOffset>0x0000078C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DMA_BUS_ERR</name>
    <description><![CDATA[If a one is written to this bit, the DMA bus error status is cleared, writing a zero has no effect.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>KEY_ST_WR_ERR</name>
    <description><![CDATA[If a one is written to this bit, the key store write error status is cleared, writing a zero has no effect.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>KEY_ST_RD_ERR</name>
    <description><![CDATA[If a one is written to this bit, the key store read error status is cleared, writing a zero has no effect.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[28:2]</bitRange>
  </field>
  <field>
    <name>DMA_IN_DONE</name>
    <description><![CDATA[If a one is written to this bit, the DMA data in done (irq_dma_in_done) interrupt output is set to one, writing a zero has no effect.
If the interrupt configuration register is programmed to pulse, clearing the DMA data in done (irq_dma_in_done) interrupt is not needed. If it is programmed to level, clearing the interrupt output should be done by writing the interrupt clear register (CTRL_INT_CLR)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESULT_AV</name>
    <description><![CDATA[If a one is written to this bit, the result available (irq_result_av) interrupt output is set to one, writing a zero has no effect.
If the interrupt configuration register is programmed to pulse, clearing the result available (irq_result_av) interrupt is not needed. If it is programmed to level, clearing the interrupt output should be done by writing the interrupt clear register (CTRL_INT_CLR)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INT_EN</name>
    <description><![CDATA[Interrupt enable]]></description>
    <addressOffset>0x00000784</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DMA_IN_DONE</name>
    <description><![CDATA[If this bit is set to zero the DMA input done (irq_dma_in_done) interrupt output is disabled and will remain zero
If this bit is set to one, the DMA input done interrupt output is enabled]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESULT_AV</name>
    <description><![CDATA[If this bit is set to zero the result available (irq_result_av) interrupt output is disabled and will remain zero
If this bit is set to one, the result available interrupt output is enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SW_RESET</name>
    <description><![CDATA[Software reset]]></description>
    <addressOffset>0x00000740</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SW_RESET</name>
    <description><![CDATA[If this bit is set to 1, the following modules are reset:
- Master control internal state is reset. That includes interrupt, error status register and result available interrupt generation FSM.
- Key store module state is reset. That includes clearing the Written Area flags; therefore the keys must be reloaded to the key store module.
Writing 0 has no effect.
The bit is self cleared after executing the reset.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
