zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>ALG_SEL</name>
    <description><![CDATA[Master control algorithm select register]]></description>
    <addressOffset>0x00000700</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>TAG</name>
    <description><![CDATA[If this bit is cleared to zero, the DMA operation involves only data.
If this bit is set, the DMA operation includes a TAG (Authentication Result / Digest).
For SHA-256 operation, a DMA must be set up for both input data and TAG. For any other selected module, setting this bit only allows a DMA that reads the TAG. No data allowed to be transferred to or from the selected module via the DMA.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[30:2]</bitRange>
  </field>
  <field>
    <name>AES</name>
    <description><![CDATA[If set to one, selects the AES engine as source/destination for the DMA
Both Read and Write maximum transfer size to DMA engine is set to 16 bytes]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>KEY_STORE</name>
    <description><![CDATA[If set to one, selects the Key Store as destination for the DMA
The maximum transfer size to DMA engine is set to 32 bytes (however transfers of 16, 24 and 32 bytes are allowed)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PROT_EN</name>
    <description><![CDATA[Master PROT enable register]]></description>
    <addressOffset>0x00000704</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>PROT_EN</name>
    <description><![CDATA[If this bit is cleared to zero m_h_prot[1] on the AHB master interface always remains zero.
If this bit is set to one, the m_h_prot[1] signal on the master AHB bus is asserted to 1 if a AHB read operation is performed, using DMA, with the key store module as destination.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INT_STAT</name>
    <description><![CDATA[Interrupt status]]></description>
    <addressOffset>0x00000790</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DMA_BUS_ERR</name>
    <description><![CDATA[This bit is set when a DMA bus error is detected during a DMA operation. The value of this register is held until it is cleared via the CTRL_INT_CLR register.
Note: This error is asserted if an error is detected on the AHB master interface during a DMA operation.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>KEY_ST_WR_ERR</name>
    <description><![CDATA[This bit is set when a write error is detected during the DMA write operation to the key store memory. The value of this register is held until it is cleared via the CTRL_INT_CLR register.
Note: This error is asserted if a DMA operation does not cover a full key area or more areas are written than expected.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>KEY_ST_RD_ERR</name>
    <description><![CDATA[This bit will be set when a read error is detected during the read of a key from the key store, while copying it to the AES core. The value of this register is held until it is cleared via the CTRL_INT_CLR register.
Note: This error is asserted if a key location is selected in the key store that is not available.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[28:2]</bitRange>
  </field>
  <field>
    <name>DMA_IN_DONE</name>
    <description><![CDATA[This read only bit returns the actual DMA data in done (irq_data_in_done) interrupt status of the DMA data in done interrupt output pin (irq_data_in_done).]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESULT_AV</name>
    <description><![CDATA[This read only bit returns the actual result available (irq_result_av) interrupt status of the result available interrupt output pin (irq_result_av).]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SIZE</name>
    <description><![CDATA[Key size register]]></description>
    <addressOffset>0x00000408</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>KEY_SIZE</name>
    <description><![CDATA[Key size:
00 - Reserved
01 - 128 bits
10 - 192 bits
11 - 256 bits
When writing this to this register, KEY_STORE_WRITTEN_AREA register will be reset.
Note: For the EIP-120t-2 configuration the key_size bits are fixed to 01, for software compatibility the KEY_STORE_WRITTEN_AREA register will still be reset when writing to this register.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>READ_AREA</name>
    <description><![CDATA[Read area register]]></description>
    <addressOffset>0x0000040C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000008</resetValue>
<fields>
  <field>
    <name>BUSY</name>
    <description><![CDATA[Key store operation busy status flag (read only):
0 -operation is completed.
1 -operation is not completed and the key store is busy.]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[30:4]</bitRange>
  </field>
  <field>
    <name>RAM_AREA</name>
    <description><![CDATA[Selects the area of the key store RAM from where the key needs to be read that will be writen to the AES engine.
ram_area:
0000 - ram_area0
0001 - ram_area1
0010 - ram_area2
0011 - ram_area3
0100 - ram_area4
0101 - ram_area5
0110 - ram_area6
0111 - ram_area7
1000 - no ram area selected
1001 .. 1111 - Reserved
RAM areas ram_area0, ram_area2, ram_area4 and ram_area6 are the only valid read areas for 192 and 256 bits key sizes.
Only RAM areas that contain valid written keys can be selected.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WRITTEN_AREA</name>
    <description><![CDATA[Written area (status) register]]></description>
    <addressOffset>0x00000404</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN7</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN6</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN5</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN4</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN3</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN2</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN1</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RAM_AREA_WRITTEN0</name>
    <description><![CDATA[ram_area_writtenx (read) :
0 - This RAM area is not written with valid key information.
1 - This RAM area is written with valid key information.
Each individual ram_area_writtenx bit can be reset by writing a 1.
Note: This register will be reset on a soft reset from the master control module. After a soft reset, all keys must be rewritten to the key store memory.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WRITE_AREA</name>
    <description><![CDATA[Write area register]]></description>
    <addressOffset>0x00000400</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Write zeroes and ignore on reading]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RAM_AREA7</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RAM_AREA6</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RAM_AREA5</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RAM_AREA4</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RAM_AREA3</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RAM_AREA2</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RAM_AREA1</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RAM_AREA0</name>
    <description><![CDATA[Represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written.
ram_areax:
0 - ram_areax is not selected to be written.
1 - ram_areax is selected to be written.
Writing to multiple RAM locations is only possible when the selected RAM areas are sequential.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
