zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_EVCTRL</name>
<description><![CDATA[AUX_EVCTRL]]></description>
<baseAddress>0x400C5000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>EVCFG0</name>
    <description><![CDATA[Configuration for C3PO event vectors 1 and 0]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>POL1</name>
    <description><![CDATA[Polarity of the event given by VEC1_EVENT]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>EN1</name>
    <description><![CDATA[Enable detection of VEC1_EVENT]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>VEC1_EVENT</name>
    <description><![CDATA[If event line given by VEC1_EVENT occurs jump to vector 1]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>POL0</name>
    <description><![CDATA[Polarity of the event given by VEC0_EVENT]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>EN0</name>
    <description><![CDATA[Enable detection of VEC0_EVENT]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>VEC0_EVENT</name>
    <description><![CDATA[If event line given by VEC0_EVENT occurs jump to vector 0]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EVCFG1</name>
    <description><![CDATA[Configuration for C3PO event vectors 3 and 2]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:15]</bitRange>
  </field>
  <field>
    <name>POL3</name>
    <description><![CDATA[Polarity of the event given by VEC3_EVENT]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>EN3</name>
    <description><![CDATA[Enable detection of VEC3_EVENT]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>VEC3_EVENT</name>
    <description><![CDATA[If event line given by VEC3_EVENT occurs jump to vector 3]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>POL2</name>
    <description><![CDATA[Polarity of the event given by VEC2_EVENT]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>EN2</name>
    <description><![CDATA[Enable detection of VEC2_EVENT]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>VEC2_EVENT</name>
    <description><![CDATA[If event line given by VEC2_EVENT occurs jump to vector 2]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EVCFG2</name>
    <description><![CDATA[Configuration for C3PO event  7]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>C3PO_EVENT7</name>
    <description><![CDATA[Selects which of the 32 aux eent shall be mapped to C3PO event 7]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AONEVFLAG</name>
    <description><![CDATA[Event flags for events to AON]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>FLAGS</name>
    <description><![CDATA[Event flags for the AON events. Writing a '1' to one of these flags have no effect, writing a zero to a flag clears it, and at the same time sets the corresponding event line to AON low. Reading will return the even flags.]]></description>
    <bitRange>[8:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AONEVPOL</name>
    <description><![CDATA[Polarity of the events generating events to AON]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>POL</name>
    <description><![CDATA[These bits are xor'ed with the actual event lines.
0: Rising edge sets the corresonding flag and asserts the event line.
1: Falling edge sets the corresponding flag and asserts the event line.]]></description>
    <bitRange>[8:3]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DMACFG</name>
    <description><![CDATA[DMA configuration register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>REQMODE</name>
    <description><![CDATA[0: AUX generates events on DMA_Req_o
1: AUX generates events on DMA_Sreq_o]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[0: DMA interface is not in use
1: DMA interface is active]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SEL</name>
    <description><![CDATA[0: ADC fifo not empty generates DMA event
1: ADC almost full generates DMA event]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWEVENT</name>
    <description><![CDATA[SW generated events from AUX]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>RC2CL</name>
    <description><![CDATA[Writing 1 to this bit sets the corresponding event line (#2). Writing 0 to this bit has no effect. To read the status of the event line, read AONEVFLAG]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>ERR</name>
    <description><![CDATA[Writing 1 to this bit sets the corresponding event line (#1). Writing 0 to this bit has no effect. To read the status of the event line, read AONEVFLAG]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SM</name>
    <description><![CDATA[Writing 1 to this bit sets the corresponding event line (#0). Writing 0 to this bit has no effect. To read the status of the event line, read AONEVFLAG]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EVENTS0</name>
    <description><![CDATA[Events 15:0]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTS_15_0</name>
    <description><![CDATA[Current value of the synchronized event bus bits [15:0].]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EVENTS1</name>
    <description><![CDATA[Events 32:16]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>EVENTS_31_16</name>
    <description><![CDATA[Current value of the synchronized event bus bits [31:16].]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCUEVENTPOL</name>
    <description><![CDATA[Polarity of the events generating events to mcu]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>POL</name>
    <description><![CDATA[For each bit in this field:
0: A high state of the corresponding MCU event line sets the flag
1: A low state of the corresponding MCU event line sets the flag
]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCUEVENTF</name>
    <description><![CDATA[Event flags for events to MCU]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>FLAGS</name>
    <description><![CDATA[Event flags set whenever MCU_event[n] XOR MCU_event_pol[n] equals 1. Write 0 to clear. Writing 1 has no effect]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCUEVENTM</name>
    <description><![CDATA[Event mask for events to MCU]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>MASK</name>
    <description><![CDATA[For each bit in this field
0: The corresponding event will not generate an event on the combined output
1: The corresponding event will set the combined event output if the corresponding flag is set to 1
]]></description>
    <bitRange>[10:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DMASW</name>
    <description><![CDATA[Software dma request register]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ</name>
    <description><![CDATA[Direct connection to DMA controller]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>EVFLAGS</name>
    <description><![CDATA[Software dma request register]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>FLAGS</name>
    <description><![CDATA[Event flags. FLAG[n] is set when event selected by EVCFG<m>.VEC<n>_EVENT is enabled and occurs. The flags are OR’ed together to make the wake up signal for the C3PO. To clear a flag write 0 to the flag in question. Writing 1 has no effect. ]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
