zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_SEMAPH</name>
<description><![CDATA[AUX_SMPH]]></description>
<baseAddress>0x400C8000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>SMPH0</name>
    <description><![CDATA[Semaphore register 0]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE0</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH1</name>
    <description><![CDATA[Semaphore register 1]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE1</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH2</name>
    <description><![CDATA[Semaphore register 2]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE2</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH3</name>
    <description><![CDATA[Semaphore register 3]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE3</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH4</name>
    <description><![CDATA[Semaphore register 4]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE4</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH5</name>
    <description><![CDATA[Semaphore register 5]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE5</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH6</name>
    <description><![CDATA[Semaphore register 6]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE6</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPH7</name>
    <description><![CDATA[Semaphore register 7]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SEMAPHORE7</name>
    <description><![CDATA[Reading this register will at the same time clear the register.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SMPHREL</name>
    <description><![CDATA[Semaphore release register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>EVENTRELEASE</name>
    <description><![CDATA[This register is meant for AUX controller usage only.  It can be accessed from OCP as well for debug and verification purposes.

Writing to this register will release the corresponding semaphore to the event line to AUX_ctrl as soon as it is ready.

Write same value again to set the event line low. Alternatively, the event line will be automatically cleared when semaphore is returned..

When read the last written value is returned
]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>AUX_WUC</name>
<description><![CDATA[AUX_WUC]]></description>
<baseAddress>0x400C6000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>MODCLKEN</name>
    <description><![CDATA[Clock enable for submodules of AUX]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>AUX_ADI</name>
    <description><![CDATA[Clock for ADI Master
0: AUX_ADI clock is stopped
1: AUX_ADI  clock is running
NOTE: The OSCTRL also has to be enabled in order to use the ADI master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>OSCCTRL</name>
    <description><![CDATA[Clock for DDI Master
0: OSC_CTRL clock is stopped
1: OSC_CTRL clock is running
]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TDCIF</name>
    <description><![CDATA[0: TDCIF clock is stopped
1: TDCIF clock is running]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>SOC_AUXCTRL</name>
    <description><![CDATA[0: SOC_AUXCTRL clock is stopped
1: SOC_AUXCTRL clock is running]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TIMER</name>
    <description><![CDATA[0: TIMER clock is stopped
1: TIMER clock is running]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>AIODIOCTRL1</name>
    <description><![CDATA[0: AIODIOCTRL1 clock is stopped
1: AIODIOCTRL1 clock is running]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>AIODIOCTRL0</name>
    <description><![CDATA[0: AIODIOCTRL0 clock is stopped
1: AIODIOCTRL0 clock is running]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SMPH</name>
    <description><![CDATA[0: SMPH clock is stopped
1: SMPH clock is running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>POWEROFFREQ</name>
    <description><![CDATA[Power off request]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ</name>
    <description><![CDATA[0: Request to be powered
1: Request to be powered off
The request will only be made if AUXCTRLSTAT.FON = 0 and ICBSTAT.IDLE=1]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>POWERDOWNREQ</name>
    <description><![CDATA[Power down request]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ</name>
    <description><![CDATA[0: Request to be in active mode
1: Request to be in power down mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>POWERDOWNACK</name>
    <description><![CDATA[Power down acknowledge]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ACK</name>
    <description><![CDATA[0: The AUX can assume that it is in active mode
1: The request for power down is acknowledted and the AUX must act like it is in power down mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLKLFREQ</name>
    <description><![CDATA[Low frequency clock request]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ</name>
    <description><![CDATA[0: Request high frequency clock
1: Request low frequency clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLKLFACK</name>
    <description><![CDATA[Low frequency clock acknowledge]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ACK</name>
    <description><![CDATA[0: Ack of high frequency clock
1: Ack of low frequency clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GBIASREQ</name>
    <description><![CDATA[Global bias request]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ</name>
    <description><![CDATA[0: AUX does not need global bias enabled
1: AUX needs global bias to be enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GBIASREADY</name>
    <description><![CDATA[Global bias acknowledge]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>READY</name>
    <description><![CDATA[0: Global bias is not ready
1: Global bias is ready]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BGAPREQ</name>
    <description><![CDATA[Band gap request]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>REQ</name>
    <description><![CDATA[0: AUX does not need band gap enabled
1: AUX needs band gap to be enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BGAPREADY</name>
    <description><![CDATA[Band gap acknowledge]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>READY</name>
    <description><![CDATA[0: Band gap is not ready
1: Band gap is ready]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WUEVENT</name>
    <description><![CDATA[Wake up event]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>RTC</name>
    <description><![CDATA[Status of the RTC wake up event from AON]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SW</name>
    <description><![CDATA[Status of the SW wake up event from AON]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PRG</name>
    <description><![CDATA[Status of the PRG wake up event from AON]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WUEVENTCLR</name>
    <description><![CDATA[Wake up event clear]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>RTCCLR</name>
    <description><![CDATA[0: Don't clear the RTC wakeup event from AON
1: Clear the RTC wakeup event from AON]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SWCLR</name>
    <description><![CDATA[0: Don't clear the SW wakeup event from AON
1: Clear the SW wakeup event from AON]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PRGCLR</name>
    <description><![CDATA[0: Don't clear the PRG wakeup event from AON
1: Clear the PRG wakeup event from AON]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCCLKCTRL</name>
    <description><![CDATA[ADC clock control]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>ACLK_ADC_GOOD</name>
    <description><![CDATA[0: ADC clock not ready
1: ADC clock ready]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ACLK_ADC_EN</name>
    <description><![CDATA[0: Disable the ADC clock
1: Enable the ADC clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCCLKCTRL</name>
    <description><![CDATA[TDC clock control]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>ACLK_TDC_GOOD</name>
    <description><![CDATA[0: TDC clock not ready
1: TDC clock ready]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ACLK_TDC_EN</name>
    <description><![CDATA[0: Disable the TDC clock
1: Enable the TDC clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>REFCLKCTRL</name>
    <description><![CDATA[Reference clock control]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>ACLK_REF_GOOD</name>
    <description><![CDATA[0: REF clock not ready
1: REF clock ready]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ACLK_REF_EN</name>
    <description><![CDATA[0: Disable the REF clock
1: Enable the REF clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RTCSUBSEC0</name>
    <description><![CDATA[Real time counter sub second increment, low part]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>INC15_0</name>
    <description><![CDATA[Bits 15:0 of SUBSECINC]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RTCSUBSEC1</name>
    <description><![CDATA[Real time counter sub second increment, high part]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>INC23_16</name>
    <description><![CDATA[Bits 23:16 of SUBSECINC]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RTCSUBSECCTRL</name>
    <description><![CDATA[Real time counter sub second increment control]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SUBSECINC_RDY_ACK</name>
    <description><![CDATA[0: New SUBSECINC value not captured by AON yet
1: New SUBSECINC value is captured by AON]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SUBSECINC_RDY</name>
    <description><![CDATA[0: SUBSECINC value invalid
1: SUBSECIND value is valid]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ICBCTRL</name>
    <description><![CDATA[Interconnect bridge handshake register (request signals)]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>IDLEREQ</name>
    <description><![CDATA[Request for idle]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ICBSTAT</name>
    <description><![CDATA[Interconnect bridge handshake register (status signals)]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>IDLE</name>
    <description><![CDATA[Indicates when idle is granted]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>IDLEACK</name>
    <description><![CDATA[Ack of idle request]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AUXCTRLSTAT</name>
    <description><![CDATA[Reads status of AUX Control pins from AON]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>FON</name>
    <description><![CDATA[Status of the force on input from AON]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RUNPRG</name>
    <description><![CDATA[Status of the flag from AON that there is a valid program in AUX memory]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AUXIOLATCH</name>
    <description><![CDATA[Controls latching of AUX IO signals in AON IOC]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LATCH_EN</name>
    <description><![CDATA[Controls latches in AON_IOC. For AIODIO settings to have effect on pads, the latches needs to be closed if one wants to preserve settings during power off of aux.
0: Latch closed
1: Latch open]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEFAULTALIAS</name>
    <description><![CDATA[Reserved for default address in alias table]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
