zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_RAM</name>
<description><![CDATA[]]></description>
<baseAddress>0x400E0000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
</registers>
</peripheral>
<peripheral>
<name>AUX_SOC</name>
<description><![CDATA[SOC_AUXCTRL]]></description>
<baseAddress>0x400C9000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>ADCCTRL</name>
    <description><![CDATA[SOC ADC control register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>START_POL</name>
    <description><![CDATA[0: Start on rising edge of event line
1: Start on falling edge of event line]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>START_SRC</name>
    <description><![CDATA[Select source of the ADC start signal.

0: AON_WU_EVENT
1: CMP_A_i
2: CMP_B_i
3: TDC_Done
4: Timer 0 event
5: Timer 1 event
6: Reserved
7: ADC_Done
8: ADC_Almost_full
9:12: None
13:28 AIO_DAT_i [0:15]
29: ACLK_Ref_i
30: MCU_Event_i
31: ADC_irq
]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>CTRL</name>
    <description><![CDATA[00: ADC Interface disabled
01: ADC Interface enabled
10: Reserved
11: ADC Fifo Flush. Note that CTRL needs to be set to 01 again for fifo to be functional. A flush takes a couple of clock periods on the AUX clock to finish.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCSTA</name>
    <description><![CDATA[ADC fifo status register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>OVERFLOW</name>
    <description><![CDATA[0: Fifo has not overflowed
1: Fifo has overflowed, this flag is sticky until fifo is flushed]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>UNDERFLOW</name>
    <description><![CDATA[0: Fifo has not underflowed
1: Fifo has underflowed, this flag is sticky until the fifo is flushed]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>FULL</name>
    <description><![CDATA[0: Fifo is not full
1: Fifo is full]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>ALMOST_FULL</name>
    <description><![CDATA[0: Fifo is not almost full
1: There is room for one more sample in the fifo]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EMPTY</name>
    <description><![CDATA[0: There is data in the fifo
1: The fifo is empty]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCFIFO</name>
    <description><![CDATA[ADC fifo register]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[When read a sample is popped from the fifo. When written the written data is put in the fifo]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCTRIG</name>
    <description><![CDATA[Trigger for ADC]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>TRIG</name>
    <description><![CDATA[A write to this register will trigger an ADC conversion. If the corresponding event selected to trigger conversions in ADCCTRL.START_SRC and ADCCTRL.START_POL is active, a write will not generate a trigger. To be sure that all writes generate triggers one should set the ADCCTRL.START_SRC and ADCCTRL.START_POL to a setting that does not trigger conversion from the event lines. (E.g set it to a unused comparator)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CSCTRL</name>
    <description><![CDATA[Current source control register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RESET_N</name>
    <description><![CDATA[Current source control
0: Current source is clamped
1: Current source is active/operating]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCDBG0</name>
    <description><![CDATA[Debug register SOC ADC]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>SAR</name>
    <description><![CDATA[ADC SAR value when ADC is in debug mode]]></description>
    <bitRange>[11:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCDBG1</name>
    <description><![CDATA[Debug register SOC ADC]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>CONV</name>
    <description><![CDATA[ADC CONV signal when ADC is in debug mode]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CONVGATING</name>
    <description><![CDATA[ADC CONVGATING signal when ADC is in debug mode]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>COMPLATCH</name>
    <description><![CDATA[ADC_COMP_LATCH signal when ADC is in debug mode]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>COMPRESET</name>
    <description><![CDATA[ADC_COMP_RESET signal when ADC is in debug mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ADCDBG2</name>
    <description><![CDATA[Debug register SOC ADC]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>COMP</name>
    <description><![CDATA[ADC Comperator status when ADC is in debug mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
