zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_AIODIO1</name>
<description><![CDATA[Aux AIODIOCTRL0 register definitions]]></description>
<baseAddress>0x400C2000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>GPIODO</name>
    <description><![CDATA[Output data register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DO</name>
    <description><![CDATA[Data output for AUX General Purpose IO's 0 to 7]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOMODE</name>
    <description><![CDATA[IO configuration register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>IO7</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #7]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>IO6</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #6]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>IO5</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #5]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>IO4</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #4]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>IO3</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #3]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>IO2</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #2]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>IO1</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #1]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>IO0</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #0]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIODI</name>
    <description><![CDATA[Input data register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DI</name>
    <description><![CDATA[Data input for AUX General Purpose IO's 0 to 7]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIOSET</name>
    <description><![CDATA[IO set register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SET</name>
    <description><![CDATA[Writing 1 to a bit postion sets the correponding bin in DATO register: Read will return the value of DATO register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIOCLR</name>
    <description><![CDATA[IO clear register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CLR</name>
    <description><![CDATA[Writing 1 to a bit postion clears the correponding bin in DATO register: Read will return the value of DATO register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIOTGL</name>
    <description><![CDATA[IO toggle register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TGL</name>
    <description><![CDATA[Writing 1 to a bit postion toggles the correponding bin in DATO register: Read will return the value of DATO register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INPUTBUF</name>
    <description><![CDATA[Input buffer enable]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[0: Digital input buffer disabled
1: Digital input buffer enabled]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>AUX_AIODIO0</name>
<description><![CDATA[Aux AIODIOCTRL0 register definitions]]></description>
<baseAddress>0x400C1000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>GPIODO</name>
    <description><![CDATA[Output data register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DO</name>
    <description><![CDATA[Data output for AUX General Purpose IO's 0 to 7]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOMODE</name>
    <description><![CDATA[IO configuration register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>IO7</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #7]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>IO6</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #6]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>IO5</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #5]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>IO4</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #4]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>IO3</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #3]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>IO2</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #2]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>IO1</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #1]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>IO0</name>
    <description><![CDATA[Selects input output mode for AUX GPIO #0]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIODI</name>
    <description><![CDATA[Input data register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DI</name>
    <description><![CDATA[Data input for AUX General Purpose IO's 0 to 7]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIOSET</name>
    <description><![CDATA[IO set register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SET</name>
    <description><![CDATA[Writing 1 to a bit postion sets the correponding bin in DATO register: Read will return the value of DATO register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIOCLR</name>
    <description><![CDATA[IO clear register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CLR</name>
    <description><![CDATA[Writing 1 to a bit postion clears the correponding bin in DATO register: Read will return the value of DATO register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIOTGL</name>
    <description><![CDATA[IO toggle register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TGL</name>
    <description><![CDATA[Writing 1 to a bit postion toggles the correponding bin in DATO register: Read will return the value of DATO register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INPUTBUF</name>
    <description><![CDATA[Input buffer enable]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[0: Digital input buffer disabled
1: Digital input buffer enabled]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
