zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_TIMER</name>
<description><![CDATA[AUX_TIMER]]></description>
<baseAddress>0x400C7000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CFG0</name>
    <description><![CDATA[Timer configuration register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>T1PRE</name>
    <description><![CDATA[Prescaler division ratio n: Division ratio is 2^n]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>T0PRE</name>
    <description><![CDATA[Prescaler division ratio n: Division ratio is 2^n]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>T1MODE</name>
    <description><![CDATA[0: Timer 1 increments on each clock cycle
1: Timer 1 counter increments only on edges of the event set by T1TICKSRC ( note that events are only sampled according to prescaler setting, every 2^T1PRE clock cycles )]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>T1RELOAD</name>
    <description><![CDATA[0: Timer 1 is not automatically restarted
1:Timer 1 is automatically restarted when target is reached]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>T0MODE</name>
    <description><![CDATA[0: Timer 0 increments on each clock cycle
1: Timer 0 counter increments only on edges of the event set by T0TICKSRC ( note that events are only sampled according to prescaler setting every 2^T0PRE clock cycles )]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>T0RELOAD</name>
    <description><![CDATA[0: Timer 0 is not automatically restarted
1:Timer 0 is automatically restarted when target is reached]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CFG1</name>
    <description><![CDATA[Timer configuration register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>SRC_POL1</name>
    <description><![CDATA[0: count rising edges
1: Count falling edges]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>T1TICKSRC</name>
    <description><![CDATA[Aux timer 1 tick source. Select which event line shall be used as tick source for timer 1]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>SRC_POL0</name>
    <description><![CDATA[0: count rising edges
1: Count falling edges]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>T0TICKSRC</name>
    <description><![CDATA[Aux timer 0 tick source. Select which event line shall be used as tick source for timer 0]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>START</name>
    <description><![CDATA[Start/stop control for timers]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>STOP1</name>
    <description><![CDATA[Write 1 to stop timer 1
Note: START1 takes precedence over STOP1]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>STOP0</name>
    <description><![CDATA[Write 1 to stop timer 0 Note: START0 takes precedence over STOP0]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>START1</name>
    <description><![CDATA[Write 1 to start timer 1. When read returns 1 if timer is running. 0 Otherwise]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>START0</name>
    <description><![CDATA[Write 1 to start timer 0. When read returns 1 if timer is running. 0 Otherwise]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>T0TARGET</name>
    <description><![CDATA[Target counter value timer0]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>T0TARGET</name>
    <description><![CDATA[Aux timer 0 counts from 0 to T0TARGET. Then gives an event and restarts if configured to do to so in the CFG0.T0RELOAD setting

If T0MODE=0,no prescaler is used, and T0TARGET equals 1, the event line will be always set]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>T1TARGET</name>
    <description><![CDATA[Target counter value timer1]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>T1TARGET</name>
    <description><![CDATA[Aux timer 1 counts from 0 to T1TARGET. Then gives an event and restarts if configured to do to so in the CFG0.T1RELOAD setting

If T1MODE=0,no prescaler is used, and T1TARGET equals 1, the event line will be always set]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
