zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_TDCIF</name>
<description><![CDATA[AUX_TDC]]></description>
<baseAddress>0x400C4000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>TDCCTRL</name>
    <description><![CDATA[TDC control register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>CTRL</name>
    <description><![CDATA[Command for starting TDC measurement]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCSTA</name>
    <description><![CDATA[TDC status register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000006</resetValue>
<fields>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>STARTBF</name>
    <description><![CDATA[Internal signal for debug purpose
1: Start signal was received before falling edge of fast clock
0: Start signal was received after falling edge of fast clock
]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>STOPAF</name>
    <description><![CDATA[Internal signal for debug purpose
1: Stop signal was received after falling edge of fast_clock
0: Stop signal was received before falling edge of fast _clock
]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>SAT</name>
    <description><![CDATA[1Conversion stopped due to timeout]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DONE</name>
    <description><![CDATA[1: Measurement complete]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>STATE</name>
    <description><![CDATA[Readback of TDC statemachine]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCRES</name>
    <description><![CDATA[TDC Result register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000002</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT</name>
    <description><![CDATA[Result of the TDC conversion]]></description>
    <bitRange>[24:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCSATCTRL</name>
    <description><![CDATA[TDC saturation control]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>LIMIT</name>
    <description><![CDATA[Select when the TDC should time out.
0<=n<4  : Time out when TDCRES.DAT[10+3] is high
4<=n<15: Time out when TDCRES.DAT[10+n] is high.
15: Time out when TDCRES.DAT wraps around]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCSTRIGSRC</name>
    <description><![CDATA[Select start/stop trigger sources for TDC]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:14]</bitRange>
  </field>
  <field>
    <name>STOP_POL</name>
    <description><![CDATA[Select polarity of stop signal.
0: Stops when high level is detected
1: Stops when low level is detected

NB must not be changed if STATE is not IDLE]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>STOP_SRC</name>
    <description><![CDATA[Selects event for asyncronous stop
NB must not be changed if STATE is not IDLE
0: AON_WU_EVENT
1: CMP_A_i
2: CMP_B_i
3: CS_RESET_n
4: Timer 0 event
5: Timer 1 event
6: Reserved
7: ADC_Done
8: ADC_almost_full
9:12: Obssigs[3:0]
13:28 AIO_DAT_i [0:15]
29: ACLK_Ref_i
30: MCU_Event_i
31: TDC_prescaler
]]></description>
    <bitRange>[12:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>START_POL</name>
    <description><![CDATA[Select polarity of start signal.
0: Starts when high level is detected
1: Starts when low level is detected

NB must not be changed if STATE is not IDLE]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>START_SRC</name>
    <description><![CDATA[Selects event for asyncronous start
0: AON_WU_EVENT
1: CMP_A_i
2: CMP_B_i
3: CS_RESET_n
4: Timer 0 event
5: Timer 1 event
6: Reserved
7: ADC_Done
8: ADC_almost_full
9:12: Obssigs[3:0]
13:28 AIO_DAT_i [0:15]
29: ACLK_Ref_i
30: MCU_Event_i
31: TDC_prescaler]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCCOUNTER</name>
    <description><![CDATA[Stop counter status of TDC]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CNT</name>
    <description><![CDATA[Remaining #stop events that will be ignored. Writing to this register updates the  value.

NB must not be changed if state is not IDLE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCCOUNTERLOAD</name>
    <description><![CDATA[Stop counter control of TDC]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SEI</name>
    <description><![CDATA[Counter compare value. When the counter is enabled the first #CMP-1 stop events is ignored. Ant the TDC will stop measurement on event #CMP

NB! Both values 0 and 1 will make the TDC stop on the first event after the start event

