zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
NB must not be changed if state is not IDLE]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCCOUNTERCTRL</name>
    <description><![CDATA[Stop counter enable]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Counter
0: Counter is disabled
1: Counter is enabled
When counter is enabled the first #CNT stop events are ignored. This can be used to measure multiple periods of a clock signal.
NB must not be changed if state is not IDLE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDCPRESCALER</name>
    <description><![CDATA[Prescaler control]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000001F</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RESET_N</name>
    <description><![CDATA[Prescaler reset control
0: Prescaler is held in reset
1: Prescaler is not held in reset]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RATIO</name>
    <description><![CDATA[Prescaler ratio.
0: Prescaler divides by 16
1: Prescaler divides by 64
]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>SOURCE</name>
    <description><![CDATA[Selects event for prescaler to use as input
NB only change when prescaler is in reset
0: AON_WU_EVENT
1: CMP_A_i
2: CMP_B_i
3: CS_RESET_n
4: Timer 0 event
5: Timer 1 event
6: Reserved
7: ADC_Done_i
8:12: Obssigs[3:0]
13:28 AIO_DAT_i [0:15]
29: ACLK_Ref_i
30: MCU_Event_i
31: Prescaler stopped
]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>AUX_C3PO</name>
<description><![CDATA[]]></description>
<baseAddress>0x400E1000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>C3POCTRL</name>
    <description><![CDATA[Control of aux_ctrl]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>FORCEEVLOW</name>
    <description><![CDATA[1: Force event signals low ]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>FORCEEVHIGH</name>
    <description><![CDATA[1: Force event signals high (takes priority over FORCEEVLOW)]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>RESETVECTOR</name>
    <description><![CDATA[Vector to be used when restarting]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>FORCEWAKEUPLOW</name>
    <description><![CDATA[1: Force wakeup to low]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>FORCEWAKEUPHIGH</name>
    <description><![CDATA[1: Force wakeup to high  (takes  priority over FORCEWAKEUPLOW)]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESTART</name>
    <description><![CDATA[1: Force restart to high]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>SINGLESTEP</name>
    <description><![CDATA[Deasserts suspend until next instrucion executed]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SUSPEND</name>
    <description><![CDATA[Suspend C3PO]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CLKEN</name>
    <description><![CDATA[0: Clock to C3PO controlled by AON interface
1: Force on the C3PO clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POSTAT0</name>
    <description><![CDATA[C3PO Program counter and instruction]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>OPCODE</name>
    <description><![CDATA[Next opcode]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>PC</name>
    <description><![CDATA[Program counter]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POFLAGS</name>
    <description><![CDATA[C3PO Internal Flags]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>BUSERROR</name>
    <description><![CDATA[This bit is set if the C3PO tries to access memory space where no peripheral is mapped. This bit is also set if the clock to a peripheral is stopped and C3PO tries to access it.

When this bit is set the C3POCTRL.SUSPEND is also set and the C3PO is suspended. To resume operation of the C3PO write C3POCTRL.SUSPEND = 0 and the bus error flag will be cleared as well]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>SLEEP</name>
    <description><![CDATA[Indicates that clock is stopped due to SLEEP instruction]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>WEV</name>
    <description><![CDATA[Indicates that clock is stopped due to WEV]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>STOPCLK</name>
    <description><![CDATA[Indicates that clock for C3PO is stopped by initiative from C3PO]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>V</name>
    <description><![CDATA[State of V flag]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>C</name>
    <description><![CDATA[State of C flag]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>N</name>
    <description><![CDATA[State of N flag]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>Z</name>
    <description><![CDATA[State of Z flag]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POSTIM</name>
    <description><![CDATA[C3PO wakeup signals and events]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>EXCEPTIONVECTOR</name>
    <description><![CDATA[Exception vector for C3PO]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>WAKEUP</name>
    <description><![CDATA[WAKEUP signal for C3PO]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>EVENTS</name>
    <description><![CDATA[Event signals for C3PO]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POREGS10</name>
    <description><![CDATA[C3PO regs 1 and 0]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>REG1</name>
    <description><![CDATA[Contents of internal C3PO register 1]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>REG0</name>
    <description><![CDATA[Contents of internal C3PO register 0]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POREGS32</name>
    <description><![CDATA[C3PO regs 3 and 2]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>REG3</name>
    <description><![CDATA[Contents of internal C3PO  register 3]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>REG2</name>
    <description><![CDATA[Contents of internal C3PO register 2]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POREGS54</name>
    <description><![CDATA[C3PO regs 5 and 4]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>REG5</name>
    <description><![CDATA[Contents of internal C3PO register 5]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>REG4</name>
    <description><![CDATA[Contents of internal C3PO  register 4]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POREGS76</name>
    <description><![CDATA[C3PO regs 7 and 6]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>REG7</name>
    <description><![CDATA[Contents of internal C3PO  register 7]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>REG6</name>
    <description><![CDATA[Contents of internal C3PO register 6]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POLOOPADD</name>
    <description><![CDATA[C3PO loop address and stop clock status]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>STOPCLK</name>
    <description><![CDATA[End address of loop]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>START</name>
    <description><![CDATA[Start address of loop ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>C3POLOOPCNT</name>
    <description><![CDATA[C3PO loop counter status]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CNT</name>
    <description><![CDATA[Number of outstanding loop iterations]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
