zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AUX_OSCDDI</name>
<description><![CDATA[Digital to Digital Interface]]></description>
<baseAddress>0x400CA000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DIR03</name>
    <description><![CDATA[Direct access for  DDI byte offsets 0 to 3]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 2]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 1]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 0]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR47</name>
    <description><![CDATA[Direct access for  DDI byte offsets 4 to 7]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 6]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 5]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 4]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR811</name>
    <description><![CDATA[Direct access for  DDI byte offsets 8 to 11]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 10]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 9]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 8]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR1215</name>
    <description><![CDATA[Direct access for  DDI byte offsets 12 to 15]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 14]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 13]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 12]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR1619</name>
    <description><![CDATA[Direct access for  DDI byte offsets 16 to 19]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 19]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 18]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 17]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 16]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR2023</name>
    <description><![CDATA[Direct access for  DDI byte offsets 20 to 23]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 23]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 22]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 21]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 20]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR2427</name>
    <description><![CDATA[Direct access for  DDI byte offsets 24 to 27]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 27]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 26]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 25]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 24]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR2831</name>
    <description><![CDATA[Direct access for  DDI byte offsets 28 to 31]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 31]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 30]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 29]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 28]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR3235</name>
    <description><![CDATA[Direct access for  DDI byte offsets 32 to 35]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 35]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 34]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 33]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 32]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR3639</name>
    <description><![CDATA[Direct access for  DDI byte offsets 36 to 39]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 39]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 38]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 37]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 36]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR4043</name>
    <description><![CDATA[Direct access for  DDI byte offsets 40 to 43]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 43]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 42]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 41]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 40]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR4447</name>
    <description><![CDATA[Direct access for  DDI byte offsets 44 to 47]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 47]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 46]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 45]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 44]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR4851</name>
    <description><![CDATA[Direct access for  DDI byte offsets 48 to 51]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 51]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 50]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 49]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 48]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR5255</name>
    <description><![CDATA[Direct access for  DDI byte offsets 52 to 55]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 55]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 54]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 53]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 52]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR5659</name>
    <description><![CDATA[Direct access for  DDI byte offsets 56 to 59]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 59]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 58]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 57]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 56]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DIR6063</name>
    <description><![CDATA[Direct access for  DDI byte offsets 60 to 63]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>B3</name>
    <description><![CDATA[Direct access to DDI register 63]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>B2</name>
    <description><![CDATA[Direct access to DDI register 62]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>B1</name>
    <description><![CDATA[Direct access to DDI register 61]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>B0</name>
    <description><![CDATA[Direct access to DDI register 60]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET03</name>
    <description><![CDATA[Set register for DDI byte offsets 0 to 3]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 3. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 2. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 1. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 0. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET47</name>
    <description><![CDATA[Set register for DDI byte offsets 4 to 7]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 7. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 6. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 5. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 4. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET811</name>
    <description><![CDATA[Set register for DDI byte offsets 8 to 11]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 11. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 10. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 9. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 8. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET1215</name>
    <description><![CDATA[Set register for DDI byte offsets 12 to 15]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 15. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 14. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 13. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 12. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET1619</name>
    <description><![CDATA[Set register for DDI byte offsets 16 to 19]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 19. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 18. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 17. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 16. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET2023</name>
    <description><![CDATA[Set register for DDI byte offsets 20 to 23]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 23. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 22. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 21. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 20. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET2427</name>
    <description><![CDATA[Set register for DDI byte offsets 24 to 27]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 27. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 26. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 25. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 24. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET2831</name>
    <description><![CDATA[Set register for DDI byte offsets 28 to 31]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 31. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 30. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 29. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 28. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET3235</name>
    <description><![CDATA[Set register for DDI byte offsets 32 to 35]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 35. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 34. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 33. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 32. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
