zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>SET3639</name>
    <description><![CDATA[Set register for DDI byte offsets 36 to 39]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 39. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 38. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 37. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 36. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET4043</name>
    <description><![CDATA[Set register for DDI byte offsets 40 to 43]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 43. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 42. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 41. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 40. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET4447</name>
    <description><![CDATA[Set register for DDI byte offsets 44 to 47]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 47. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 46. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 45. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 44. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET4851</name>
    <description><![CDATA[Set register for DDI byte offsets 48 to 51]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 51. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 50. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 49. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 48. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET5255</name>
    <description><![CDATA[Set register for DDI byte offsets 52 to 55]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 55. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 54. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 53. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 52. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET5659</name>
    <description><![CDATA[Set register for DDI byte offsets 56 to 59]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 59. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 58. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 57. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 56. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SET6063</name>
    <description><![CDATA[Set register for DDI byte offsets 60 to 63]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 63. Read returns 0.]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 62. Read returns 0.]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 61. Read returns 0.]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will set the corresponding bit in DDI register 60. Read returns 0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR03</name>
    <description><![CDATA[Clear register for DDI byte offsets 0 to 3]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 2]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 1]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 0]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR47</name>
    <description><![CDATA[Clear register for DDI byte offsets 4 to 7]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 6]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 5]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 4]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR811</name>
    <description><![CDATA[Clear register for DDI byte offsets 8 to 11]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 10]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 9]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 8]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR1215</name>
    <description><![CDATA[Clear register for DDI byte offsets 12 to 15]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 14]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 13]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 12]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR1619</name>
    <description><![CDATA[Clear register for DDI byte offsets 16 to 19]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 19]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 18]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 17]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 16]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR2023</name>
    <description><![CDATA[Clear register for DDI byte offsets 20 to 23]]></description>
    <addressOffset>0x00000094</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 23]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 22]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 21]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 20]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR2427</name>
    <description><![CDATA[Clear register for DDI byte offsets 24 to 27]]></description>
    <addressOffset>0x00000098</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 27]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 26]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 25]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 24]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR2831</name>
    <description><![CDATA[Clear register for DDI byte offsets 28 to 31]]></description>
    <addressOffset>0x0000009C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 31]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 30]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 29]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 28]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR3235</name>
    <description><![CDATA[Clear register for DDI byte offsets 32 to 35]]></description>
    <addressOffset>0x000000A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 35]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 34]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 33]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 32]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR3639</name>
    <description><![CDATA[Clear register for DDI byte offsets 36 to 39]]></description>
    <addressOffset>0x000000A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 39]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 38]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 37]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 36]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR4043</name>
    <description><![CDATA[Clear register for DDI byte offsets 40 to 43]]></description>
    <addressOffset>0x000000A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 43]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 42]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 41]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 40]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR4447</name>
    <description><![CDATA[Clear register for DDI byte offsets 44 to 47]]></description>
    <addressOffset>0x000000AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 47]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 46]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 45]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 44]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR4851</name>
    <description><![CDATA[Clear register for DDI byte offsets 48 to 51]]></description>
    <addressOffset>0x000000B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 51]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 50]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 49]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 48]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR5255</name>
    <description><![CDATA[Clear register for DDI byte offsets 52 to 55]]></description>
    <addressOffset>0x000000B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 55]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 54]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 53]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 52]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR5659</name>
    <description><![CDATA[Clear register for DDI byte offsets 56 to 59]]></description>
    <addressOffset>0x000000B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 59]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 58]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 57]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 56]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLR6063</name>
    <description><![CDATA[Clear register for DDI byte offsets 60 to 63]]></description>
    <addressOffset>0x000000BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>S3</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 63]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>S2</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 62]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>S1</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 61]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>S0</name>
    <description><![CDATA[A high bit value will clear the corresponding bit in DDI register 60]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
