zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>SLAVESTAT</name>
    <description><![CDATA[DDI Slave status register]]></description>
    <addressOffset>0x000000C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DI_REQ</name>
    <description><![CDATA[Read current value of DI_REQ signal. Writing 0 to this bit forces a sync with slave, ensuring that req will be 0. It is recommended to write 0 to this register before power down of the master.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DI_ACK</name>
    <description><![CDATA[Read current value of DI_ACK signal]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SLAVECLR</name>
    <description><![CDATA[DDI Slave reset register]]></description>
    <addressOffset>0x000000C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RESETLOCK</name>
    <description><![CDATA[This register is no longer accessible when this bit is set.  (unless sticky_bit_overwrite is asserted on top module)]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[6:1]</bitRange>
  </field>
  <field>
    <name>RESET</name>
    <description><![CDATA[Write 1 to reset the DDI slave]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SLAVECONF</name>
    <description><![CDATA[DDI Master configuration register]]></description>
    <addressOffset>0x000000C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000004</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CONFLOCK</name>
    <description><![CDATA[This register is no longer accessible when this bit is set.  (unless sticky_bit_overwrite is asserted on top module)]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[6:3]</bitRange>
  </field>
  <field>
    <name>WAITFORACK</name>
    <description><![CDATA[A transaction does not end on the DDI interface until ack has been received when this bit is set.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DDICLKSPEED</name>
    <description><![CDATA[Sets the period of an DDI transactions. All transactions takes an even number of clock cycles,- DDI clock rising edge occurs in the middle of the period. Data and ctrl to slave is set up in beginning of cycle, and data from slave is read in after the transaction
00: An DDI transaction takes 2 master clock cyclkes
01: An DDI transaction takes 4 master clock cycles
10: And DDI Transaction takes 8 master clock cycles
11: An DDI transaction takes 16 master clock cycles]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B01</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 0 and 1]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 1]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 1, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 1]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 1, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 0]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 0, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 0]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 0, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B23</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 2 and 3]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 3]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 3, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 3]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 3, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 2]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 2, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 2]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 2, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B45</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 4 and 5]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 5]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 5, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 5]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 5, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 4]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 4, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 4]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 4, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B67</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 6 and 7]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 7]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 7, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 7]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 7, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 6]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 6, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 6]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 6, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B89</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 8 and 9]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 9]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 9, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 9]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 9, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 8]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 8, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 8]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 8, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1011</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 10 and 11]]></description>
    <addressOffset>0x00000114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 11]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 11, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 11]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 11, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 10]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 10, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 10]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 10, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1213</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 12 and 13]]></description>
    <addressOffset>0x00000118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 13]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 13, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 13]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 13, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 12]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 12, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 12]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 12, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1415</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 14 and 15]]></description>
    <addressOffset>0x0000011C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 15]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 15, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 15]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 15, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 14]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 14, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 14]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 14, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1617</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 16 and 17]]></description>
    <addressOffset>0x00000120</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 17]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 17, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 17]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 17, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 16]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 16, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 16]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 16, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B1819</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 18 and 19]]></description>
    <addressOffset>0x00000124</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 19]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 19, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 19]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 19, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 18]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 18, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 18]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 18, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B2021</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 20 and 21]]></description>
    <addressOffset>0x00000128</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 21]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 21, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 21]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 21, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 20]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 20, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 20]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 20, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
