zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MASK4B2223</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 22 and 23]]></description>
    <addressOffset>0x0000012C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 23]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 23, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 23]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 23, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 22]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 22, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 22]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 22, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B2425</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 24 and 25]]></description>
    <addressOffset>0x00000130</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 25]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 25, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 25]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 25, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 24]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 24, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 24]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 24, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B2627</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 26 and 27]]></description>
    <addressOffset>0x00000134</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 27]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 27, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 27]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 27, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 26]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 26, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 26]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 26, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B2829</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 28 and 29]]></description>
    <addressOffset>0x00000138</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 29]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 29, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 29]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 29, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 28]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 28, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 28]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 28, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B3031</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 30 and 31]]></description>
    <addressOffset>0x0000013C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 31]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 31, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 31]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 31, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 30]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 30, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 30]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 30, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B3233</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 32 and 33]]></description>
    <addressOffset>0x00000140</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 33]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 33, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 33]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 33, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 32]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 32, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 32]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 32, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B3435</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 34 and 35]]></description>
    <addressOffset>0x00000144</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 35]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 35, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 35]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 35, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 34]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 34, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 34]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 34, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B3637</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 36 and 37]]></description>
    <addressOffset>0x00000148</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 37]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 37, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 37]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 37, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 36]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 36, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 36]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 36, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B3839</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 38 and 39]]></description>
    <addressOffset>0x0000014C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 39]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 39, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 39]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 39, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 38]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 38, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 38]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 38, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B4041</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 40 and 41]]></description>
    <addressOffset>0x00000150</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 41]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 41, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 41]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 41, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 40]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 40, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 40]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 40, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B4243</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 42 and 43]]></description>
    <addressOffset>0x00000154</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 43]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 43, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 43]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 43, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 42]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 42, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 42]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 42, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B4445</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 44 and 45]]></description>
    <addressOffset>0x00000158</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 45]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 45, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 45]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 45, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 44]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 44, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 44]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 44, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B4647</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 46 and 47]]></description>
    <addressOffset>0x0000015C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 47]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 47, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 47]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 47, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 46]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 46, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 46]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 46, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
