zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MASK4B4849</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 48 and 49]]></description>
    <addressOffset>0x00000160</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 49]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 49, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 49]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 49, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 48]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 48, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 48]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 48, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B5051</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 50 and 51]]></description>
    <addressOffset>0x00000164</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 51]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 51, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 51]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 51, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 50]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 50, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 50]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 50, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B5253</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 52 and 53]]></description>
    <addressOffset>0x00000168</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 53]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 53, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 53]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 53, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 52]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 52, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 52]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 52, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B5455</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 54 and 55]]></description>
    <addressOffset>0x0000016C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 55]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 55, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 55]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 55, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 54]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 54, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 54]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 54, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B5657</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 56 and 57]]></description>
    <addressOffset>0x00000170</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 57]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 57, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 57]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 57, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 56]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 56, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 56]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 56, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B5859</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 58 and 59]]></description>
    <addressOffset>0x00000174</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 59]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 59, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 59]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 59, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 58]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 58, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 58]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 58, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B6061</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 60 and 61]]></description>
    <addressOffset>0x00000178</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 61]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 61, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 61]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 61, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 60]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 60, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 60]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 60, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK4B6263</name>
    <description><![CDATA[Masked access (4m/4d) for DDI Registers at byte offsets 62 and 63]]></description>
    <addressOffset>0x0000017C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 63]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>D1H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 63, - only bits selected by mask M1H will be affected by access]]></description>
    <bitRange>[27:24]</bitRange>
  </field>
  <field>
    <name>M1L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 63]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>D1L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 63, - only bits selected by mask M1L will be affected by access]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>M0H</name>
    <description><![CDATA[Mask for bits [7:4] in DDI register 62]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>D0H</name>
    <description><![CDATA[Data for bits [7:4] in DDI register 62, - only bits selected by mask M0H will be affected by access]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>M0L</name>
    <description><![CDATA[Mask for bits [3:0] in DDI register 62]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>D0L</name>
    <description><![CDATA[Data for bits [3:0] in DDI register 62, - only bits selected by mask M0L will be affected by access]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B01</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 0 and 1]]></description>
    <addressOffset>0x00000180</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 1]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 1, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 0]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 0, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B23</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 2 and 3]]></description>
    <addressOffset>0x00000184</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 3]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 3, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 2]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 2, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B45</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 4 and 5]]></description>
    <addressOffset>0x00000188</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 5]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 5, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 4]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 4, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B67</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 6 and 7]]></description>
    <addressOffset>0x0000018C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 7]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 7, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 6]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 6, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B89</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 8 and 9]]></description>
    <addressOffset>0x00000190</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 9]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 9, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 8]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 8, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1011</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 10 and 11]]></description>
    <addressOffset>0x00000194</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 11]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 11, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 10]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 10, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1213</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 12 and 13]]></description>
    <addressOffset>0x00000198</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 13]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 13, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 12]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 12, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1415</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 14 and 15]]></description>
    <addressOffset>0x0000019C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 15]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 15, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 14]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 14, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B1617</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 16 and 17]]></description>
    <addressOffset>0x000001A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 17]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 17, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 16]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 16, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
