zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MASK8B1819</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 18 and 19]]></description>
    <addressOffset>0x000001A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 19]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 19, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 18]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 18, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B2021</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 20 and 21]]></description>
    <addressOffset>0x000001A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 21]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 21, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 20]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 20, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B2223</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 22 and 23]]></description>
    <addressOffset>0x000001AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 23]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 23, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 22]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 22, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B2425</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 24 and 25]]></description>
    <addressOffset>0x000001B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 25]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 25, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 24]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 24, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B2627</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 26 and 27]]></description>
    <addressOffset>0x000001B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 27]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 27, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 26]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 26, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B2829</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 28 and 29]]></description>
    <addressOffset>0x000001B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 29]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 29, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 28]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 28, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B3031</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 30 and 31]]></description>
    <addressOffset>0x000001BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 31]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 31, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 30]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 30, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B3233</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 32 and 33]]></description>
    <addressOffset>0x000001C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 33]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 33, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 32]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 32, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B3435</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 34 and 35]]></description>
    <addressOffset>0x000001C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 35]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 35, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 34]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 34, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B3637</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 36 and 37]]></description>
    <addressOffset>0x000001C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 37]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 37, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 36]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 36, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B3839</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 38 and 39]]></description>
    <addressOffset>0x000001CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 39]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 39, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 38]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 38, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B4041</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 40 and 41]]></description>
    <addressOffset>0x000001D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 41]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 41, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 40]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 40, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B4243</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 42 and 43]]></description>
    <addressOffset>0x000001D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 43]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 43, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 42]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 42, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B4445</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 44 and 45]]></description>
    <addressOffset>0x000001D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 45]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 45, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 44]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 44, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B4647</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 46 and 47]]></description>
    <addressOffset>0x000001DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 47]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 47, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 46]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 46, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B4849</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 48 and 49]]></description>
    <addressOffset>0x000001E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 49]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 49, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 48]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 48, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B5051</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 50 and 51]]></description>
    <addressOffset>0x000001E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 51]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 51, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 50]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 50, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B5253</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 52 and 53]]></description>
    <addressOffset>0x000001E8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 53]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 53, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 52]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 52, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B5455</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 54 and 55]]></description>
    <addressOffset>0x000001EC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 55]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 55, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 54]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 54, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B5657</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 56 and 57]]></description>
    <addressOffset>0x000001F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 57]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 57, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 56]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 56, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B5859</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 58 and 59]]></description>
    <addressOffset>0x000001F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 59]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 59, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 58]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 58, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B6061</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 60 and 61]]></description>
    <addressOffset>0x000001F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 61]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 61, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 60]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 60, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK8B6263</name>
    <description><![CDATA[Masked access (8m/8d) for DDI Registers at byte offsets 62 and 63]]></description>
    <addressOffset>0x000001FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M1</name>
    <description><![CDATA[Mask for  DDI register 63]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>D1</name>
    <description><![CDATA[Data for DDI register 63, - only bits selected by mask M1 will be affected by access]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>M0</name>
    <description><![CDATA[Mask for  DDI register 62]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>D0</name>
    <description><![CDATA[Data for DDI register 62, - only bits selected by mask M0  will be affected by access]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B01</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 0 and 1]]></description>
    <addressOffset>0x00000200</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 0 and 1]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  0 and 1, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
