zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>MASK16B23</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 2 and 3]]></description>
    <addressOffset>0x00000204</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 2 and 3]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  2 and 3, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B45</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 4 and 5]]></description>
    <addressOffset>0x00000208</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 4 and 5]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  4 and 5, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B67</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 6 and 7]]></description>
    <addressOffset>0x0000020C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 6 and 7]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  6 and 7, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B89</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 8 and 9]]></description>
    <addressOffset>0x00000210</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 8 and 9]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  8 and 9, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1011</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 10 and 11]]></description>
    <addressOffset>0x00000214</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 10 and 11]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  10 and 11, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1213</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 12 and 13]]></description>
    <addressOffset>0x00000218</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 12 and 13]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  12 and 13, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1415</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 14 and 15]]></description>
    <addressOffset>0x0000021C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 14 and 15]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  14 and 15, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1617</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 16 and 17]]></description>
    <addressOffset>0x00000220</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 16 and 17]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  16 and 17, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B1819</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 18 and 19]]></description>
    <addressOffset>0x00000224</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 18 and 19]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  18 and 19, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B2021</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 20 and 21]]></description>
    <addressOffset>0x00000228</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 20 and 21]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  20 and 21, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B2223</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 22 and 23]]></description>
    <addressOffset>0x0000022C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 22 and 23]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  22 and 23, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B2425</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 24 and 25]]></description>
    <addressOffset>0x00000230</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 24 and 25]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  24 and 25, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B2627</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 26 and 27]]></description>
    <addressOffset>0x00000234</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 26 and 27]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  26 and 27, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B2829</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 28 and 29]]></description>
    <addressOffset>0x00000238</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 28 and 29]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  28 and 29, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B3031</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 30 and 31]]></description>
    <addressOffset>0x0000023C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 30 and 31]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  30 and 31, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B3233</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 32 and 33]]></description>
    <addressOffset>0x00000240</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 32 and 33]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  32 and 33, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B3435</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 34 and 35]]></description>
    <addressOffset>0x00000244</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 34 and 35]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  34 and 35, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B3637</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 36 and 37]]></description>
    <addressOffset>0x00000248</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 36 and 37]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  36 and 37, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B3839</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 38 and 39]]></description>
    <addressOffset>0x0000024C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 38 and 39]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  38 and 39, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B4041</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 40 and 41]]></description>
    <addressOffset>0x00000250</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 40 and 41]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  40 and 41, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B4243</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 42 and 43]]></description>
    <addressOffset>0x00000254</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 42 and 43]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  42 and 43, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B4445</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 44 and 45]]></description>
    <addressOffset>0x00000258</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 44 and 45]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  44 and 45, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B4647</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 46 and 47]]></description>
    <addressOffset>0x0000025C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 46 and 47]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  46 and 47, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B4849</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 48 and 49]]></description>
    <addressOffset>0x00000260</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 48 and 49]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  48 and 49, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B5051</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 50 and 51]]></description>
    <addressOffset>0x00000264</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 50 and 51]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  50 and 51, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B5253</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 52 and 53]]></description>
    <addressOffset>0x00000268</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 52 and 53]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  52 and 53, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B5455</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 54 and 55]]></description>
    <addressOffset>0x0000026C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 54 and 55]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  54 and 55, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B5657</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 56 and 57]]></description>
    <addressOffset>0x00000270</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 56 and 57]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  56 and 57, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B5859</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 58 and 59]]></description>
    <addressOffset>0x00000274</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 58 and 59]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  58 and 59, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B6061</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 60 and 61]]></description>
    <addressOffset>0x00000278</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 60 and 61]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  60 and 61, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MASK16B6263</name>
    <description><![CDATA[Masked access (16m/16d) for DDI Registers at byte offsets 62 and 63]]></description>
    <addressOffset>0x0000027C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>M</name>
    <description><![CDATA[Mask for DDI register 62 and 63]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>D</name>
    <description><![CDATA[Data for DDI register at offsets  62 and 63, - only bits selected by mask M  will be affected by access]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
