zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>BROM</name>
<description><![CDATA[General Purpose RAM]]></description>
<baseAddress>0x10000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00020000</size>
<usage>registers</usage>
</addressBlock>
<registers>
</registers>
</peripheral>
<peripheral>
<name>RFCORERAM</name>
<description><![CDATA[Dummy Component for CC26xx memory map template]]></description>
<baseAddress>0x21000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000100</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DUMMY_REG0</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DUMMY_BITFIELD</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>FLASH_CFG</name>
<description><![CDATA[Dummy Component for CC26xx memory map template]]></description>
<baseAddress>0x50000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000100</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DUMMY_REG0</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DUMMY_BITFIELD</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>AON_BATMON</name>
<description><![CDATA[]]></description>
<baseAddress>0x40095000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CONFIGURATION</name>
    <description><![CDATA[General configuration of BATMON]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>CALCULATION</name>
    <description><![CDATA[0: Calculation block disabled
1: Calculation block enabled]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>MEASUREMENT</name>
    <description><![CDATA[0: Measurements disabled
1: Measurements are performed(battery voltage and temperature)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MEASUREPER</name>
    <description><![CDATA[Measurement periode configuration (bmon and temp)]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[11: Measure every 32 cycle
10: Measure every 16 cycle
01: Measure every 8 cycle
00: Measure continuously]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>COMPTEST</name>
    <description><![CDATA[Enable comparator test]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ENABLE</name>
    <description><![CDATA[1: Testing of comparator possible.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEMPP0</name>
    <description><![CDATA[Temperature calculation parameter 0. Sets the constant term in the selector vaule – to – temperature value quadratic equation.]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[The configuration value will be mapped before used in temperature calculation. The values below reflect the mapped end value.

bit 7: Select range
  0: range -384 - -257
  1: range -256 - -129

bit [6:0]: offset from range base (-384 or -256)]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEMPP1</name>
    <description><![CDATA[Temperature calculation parameter 1. Sets the linear coefficient in the quadratic equation.]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[The configuration value will be mapped before used in temperature calculation. The values below reflect the mapped end value.

bit [5:0]: offset from range base 256 with resolution of 4 (2 bits). Max value: 508]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEMPP2</name>
    <description><![CDATA[Temperature calculation parameter 2. Sets the quadratic coefficient in the quadratic equation.]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[The configuration value will be mapped before used in temperature calculation. The values below reflect the mapped value.

bit [4:0]: offset from range base 64 with resolution of 2 (1 bit). Max value: 126]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BMONP0</name>
    <description><![CDATA[Battery voltage calculation parameter 0. Sets the linear coefficient in the linear equation for selector value – to – battery voltage conversion.]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[The configuration value will be mapped before used in voltage calculation. The values below reflect the mapped end value.

bit 5: Select range
  0: range 352 - 383
  1: range 384 - 415

