zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
bit [4:0]: offset from range base (352 or 384)]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BMONP1</name>
    <description><![CDATA[Battery voltage calculation parameter 1. Sets the constant term in the linear equation.]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[The configuration value will be mapped before used in voltage calculation. The values below reflect the mapped value.

bit [5:0]: offset from range base 128. Max value: 191]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOCSTRP0</name>
    <description><![CDATA[IO drive strength conversion parameter 0]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000028</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>CFG2</name>
    <description><![CDATA[Configuration of second stage of the drive strength conversion]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>CFG1</name>
    <description><![CDATA[Configuration of first stage of the drive strength conversion]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FLASHPUMPP0</name>
    <description><![CDATA[Flash pump conversion parameter 0]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>OVERRIDE</name>
    <description><![CDATA[0: Override disabled
1: Override enabled and the 4 LSBs of this register is used towards flash pump.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>HYSTERESIS</name>
    <description><![CDATA[0: 1 bit hysteresis between rising and falling voltage compare
1: 2 bit hysteresis between rising and falling voltage compare]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[Adjustmen of the voltage limits. All zeros use lowest limits, all ones configures highest limits.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BATTERY</name>
    <description><![CDATA[Battery voltage status in Volts]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>INTEGER</name>
    <description><![CDATA[Integer part]]></description>
    <bitRange>[10:8]</bitRange>
  </field>
  <field>
    <name>FRACTIONAL</name>
    <description><![CDATA[Fractional part]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BATTERYUPDATE</name>
    <description><![CDATA[Battery voltage updated]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[1 if new battery voltage is present.
Write '1' to clear the status.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEMPERATURE</name>
    <description><![CDATA[Temperature status in degree Celsius]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>INTEGER</name>
    <description><![CDATA[Integer part (signed)]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>FRACTIONAL</name>
    <description><![CDATA[Fractional part]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TEMPERATUREUPDATE</name>
    <description><![CDATA[Temperature updated]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[1 if new temperature is present.
Write '1' to clear the status.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>COMPTESTOUT</name>
    <description><![CDATA[Comparator test output]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Comparator output in test mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IODRIVESTRENGTH</name>
    <description><![CDATA[IO drive strength status register]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[IO drive strength sent towards the AON IOC (gray encoded)]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>VINAT</name>
    <description><![CDATA[Voltage indication status register. Reflects status sent towards Flash Pump]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>VINAT3P0</name>
    <description><![CDATA[1: Indicates that the Voltage is above 3.0 Volts]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>VINAT2P4</name>
    <description><![CDATA[1: Indicates that the Voltage is above 2.4 Volts]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>VINAT2P1</name>
    <description><![CDATA[1: Indicates that the Voltage is above 2.1 Volts]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>VINAT1P7</name>
    <description><![CDATA[1: Indicates that the Voltage is above 1.7 Volts]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SAR</name>
    <description><![CDATA[SAR status register]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[0: SAR search not done yet
1: SAR search done]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
