zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AON_IOC</name>
<description><![CDATA[]]></description>
<baseAddress>0x40094000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>IOSTRMIN</name>
    <description><![CDATA[IO Drive Strength Minimum setting]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>MIN</name>
    <description><![CDATA[Gray encoded value to output on pad_STR0/1/2_o when mcu_ioc_STR_i selects minimum drive strength]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOSTRMED</name>
    <description><![CDATA[IO Drive Strength Medium setting]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000006</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>MED</name>
    <description><![CDATA[Gray encoded value to output on pad_STR0/1/2_o when mcu_ioc_STR_i selects medium drive strength]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOSTRMAX</name>
    <description><![CDATA[IO Drive Strength Maximum setting]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000005</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>MAX</name>
    <description><![CDATA[Gray encoded value to output on pad_STR0/1/2_o when mcu_ioc_STR_i selects maximum drive strength]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOCLATCH</name>
    <description><![CDATA[Controls transparency of all latches holding I/O or configuration state from the MCU IOC]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ENABLE</name>
    <description><![CDATA[0: Latches are static
1: Latches are transparent]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLK32K</name>
    <description><![CDATA[Control of 32 KHz clock]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>OEN</name>
    <description><![CDATA[0: Output enable active
1: Output enable not active]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>AON_EVENT</name>
<description><![CDATA[]]></description>
<baseAddress>0x40093000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CTRLWUMCU</name>
    <description><![CDATA[Wake-up selector for MCU]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x3F3F3F3F</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:30]</bitRange>
  </field>
  <field>
    <name>WU3</name>
    <description><![CDATA[Event source ID for MCU wake-up event 3]]></description>
    <bitRange>[29:24]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[]]></description>
    <bitRange>[23:22]</bitRange>
  </field>
  <field>
    <name>WU2</name>
    <description><![CDATA[Event source ID for MCU wake-up event 2]]></description>
    <bitRange>[21:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>WU1</name>
    <description><![CDATA[Event source ID for MCU wake-up event 1]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>WU0</name>
    <description><![CDATA[Event source ID for MCU wake-up event 0]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTRLWUAUX</name>
    <description><![CDATA[Wake-up selector for AUX]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x003F3F3F</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>WU2</name>
    <description><![CDATA[Event source ID for AUX wake-up event 2]]></description>
    <bitRange>[21:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>WU1</name>
    <description><![CDATA[Event source ID for AUX wake-up event 1]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>WU0</name>
    <description><![CDATA[Event source ID for AUX wake-up event 0]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTRLEVENTMCU</name>
    <description><![CDATA[Event selector for MCU]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x002B2B2B</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>AONS2</name>
    <description><![CDATA[Event source ID for MCU AONS  event 2]]></description>
    <bitRange>[21:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[]]></description>
    <bitRange>[15:14]</bitRange>
  </field>
  <field>
    <name>AONS1</name>
    <description><![CDATA[Event source ID for MCU AONS  event 1]]></description>
    <bitRange>[13:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>AONS0</name>
    <description><![CDATA[Event source ID for MCU AONS  event 0]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTRLEVENTRTC</name>
    <description><![CDATA[Event selector for MCU]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>AONS0</name>
    <description><![CDATA[Event source ID for RTC AONS  event 0]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
