zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AON_WUC</name>
<description><![CDATA[]]></description>
<baseAddress>0x40091000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>MCUCLK</name>
    <description><![CDATA[MCU Clock Management]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>CALIBRATED</name>
    <description><![CDATA[MCU bootcode will set this bit when the MCU_CLK  HF is calibrated.  The FLASH can not be used until this bit is set.
1: MCU clock is calibrated to 48 Mhz, allowing flash to power up.
0: Flash must not assume that the sclk_hf is safe]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PDSRC</name>
    <description><![CDATA[When MCU requests powerdown with sclk_hf as source, then WUC will switch over to this clock source during powerdown, and automatically switch back to sclk_hf when the system is back in active mode
00: no clock in pd
01: sclk_lf
10: sclk_mf
11: reserved
]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AUXCLK</name>
    <description><![CDATA[AUX Clock Management]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:13]</bitRange>
  </field>
  <field>
    <name>PDSRC</name>
    <description><![CDATA[When AUX requests powerdown with sclk_hf as source, then WUC will switch over to this clock source during powerdown, and automatically switch back to sclk_hf when the system is back in active mode
00: no clock in pd
01: sclk_lf
10: sclk_mf
11: reserved
]]></description>
    <bitRange>[12:11]</bitRange>
  </field>
  <field>
    <name>DIV</name>
    <description><![CDATA[Select the AUX clock divider for hfclk
000: DIV 2
001: DIV 4
010: DIV 8
011: DIV 16
100: DIV 32
101: DIV 64
110: DIV 128
111: DIV 256
NB: It is not supported to change the aux clock divider while the hfclk is active]]></description>
    <bitRange>[10:8]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>SRC</name>
    <description><![CDATA[Selects the clock source for AUX:
001: sclk_hf
010: sclk_mf
100: sclk_lf
Others: reserved
NB: Switching the clock source is guaranteed to be glitchless]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MCUCFG</name>
    <description><![CDATA[MCU Configuration]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000F</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>VIRTOFF</name>
    <description><![CDATA[Controls action when receiving a request to power-off MCU:
0: Power-off MCU
1: Assert reset and stop clock, but keep MCU powered (virtual power-off)]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>FIXEDWU</name>
    <description><![CDATA[Controls timing of MCU-wakeup:
0: MCU wake-up is immediately following triggering event
1: MCU wake-up is forced to happen a fixed number of 32 KHz clocks following the triggering event.
The number of 32 Khz clock cycles is configured in CONFIG.FIXEDWUPERIOD register
This bit is used to ensure that the MCU is always woken up an exact number of clocks following the triggering event by compensating for any  variable delays caused by other activities going on at the time of wakeup (such as a recharge event etc.)]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RES3</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:4]</bitRange>
  </field>
  <field>
    <name>SRAMRET</name>
    <description><![CDATA[MCU RAM is partitioned into 4 banks of 1Kx32 each. Bit #n controls retention mode for RAM bank #n:
0: Retention disabled
1: Retention enabled
NB: If retention is disabled for all banks, the RAM will be powered off when it would otherwise be put in retention mode]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AUXCFG</name>
    <description><![CDATA[AUX Configuration]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:18]</bitRange>
  </field>
  <field>
    <name>VIRTOFF</name>
    <description><![CDATA[Controls action when receiving a request to power-off AUX:
0: Power-off AUX
1: Assert reset and stop clock, but keep AUX powered (virtual power-off)]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>FIXEDWU</name>
    <description><![CDATA[Controls timing of AUX-wakeup:
0: AUX wake-up is immediately following triggering event
1: AUX wake-up is forced to happen a fixed number of 32 KHz clocks following the triggering event.
The number of  32KHz cloc cycles is configured in CONFIG.FIXEDWUPERIOD register.
This bit is used to ensure that the AUX is always woken up an exact number of clocks following the triggering event by compensating for any  variable delays caused by other activities going on at the time of wakeup (such as a recharge event etc.)
NB: Waking up AUX by FORCEON and SWEVENT is not affected by this bit]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:1]</bitRange>
  </field>
  <field>
    <name>SRAMRET</name>
    <description><![CDATA[AUX RAM is a single 512x16 instance. This bit controls retention mode for the RAM:
0: Retention is disabled
1: Retention is enabled
NB: If retention is disabled, the RAM will be powered off when it would otherwise be put in retention mode]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AUXEVENT</name>
    <description><![CDATA[AUX Event Management]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESETREQ</name>
    <description><![CDATA[Reset request for AUX
1: AUX reset pin is asserted
0: AUX reset pin is deasserted]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[30:3]</bitRange>
  </field>
  <field>
    <name>RUNPROG</name>
    <description><![CDATA[Tells AUX that it has a valid image in the memory
1: AUX will start executing the program in AUXRAM when it wakes up
0: AUX may wake up, but controller will remain in idle since memory image can not be trusted]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SWEVENT</name>
    <description><![CDATA[Forces AUX to be powered on, and a SW event to be sent to the AUX controller:
0: No action
1: Force AUX to be powered on, and generate SW event to AUX]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FORCEON</name>
    <description><![CDATA[Forces AUX to be powered on and held on until forceon is released again. MCU will use this bit to ensure that AUX peripherals remains even if AUX requests to get powered of.
1: AUX can not request power off or disconnect
0: AUX will get powered of when it requests it.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PWRSTAT</name>
    <description><![CDATA[Power Status]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES5</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:23]</bitRange>
  </field>
  <field>
    <name>OSCGBIAS</name>
    <description><![CDATA[Indicates OSC GBIAS state:
0: OSC is not requesting GBIAS
1: OSC is requesting GBIAS]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>AUXGBIAS</name>
    <description><![CDATA[Indicates AUX GBIAS state:
0: AUX is not requesting GBIAS
1: AUX is requesting GBIAS]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>MCUGBIAS</name>
    <description><![CDATA[Indicates MCU GBIAS state:
0: MCU is not requesting GBIAS
1: MCU is requesting GBIAS]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>RES4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>OSCBGAP</name>
    <description><![CDATA[Indicates OSC BGAP state:
0: OSC is not requesting BGAP
1: OSC is requesting BGAP]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>AUXBGAP</name>
    <description><![CDATA[Indicates AUX BGAP state:
0: AUX is not requesting BGAP
1: AUX is requesting BGAP]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>MCUBGAP</name>
    <description><![CDATA[Indicates MCU BGAP state:
0: MCU is not requesting BGAP
1: MCU is requesting BGAP]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RES3</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>GBIASON99</name>
    <description><![CDATA[Indicates GBIAS state:
0: GBIAS is powered off
1: GBIAS is powered on and steady within 99%]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>GBIASON</name>
    <description><![CDATA[Indicates GBIAS state:
0: GBIAS is powered off
1: GBIAS is powered on and steady within 95%]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>BGAPON</name>
    <description><![CDATA[Indicates BGAP state:
0: BGAP is powered off
1: BGAP is powered on]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>RES2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>AUXPWRDOWN</name>
    <description><![CDATA[Indicates state of power supply as seen by AUX:
0: Active mode
1: Powerdown mode]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>MCUPWRDOWN</name>
    <description><![CDATA[Indicates state of power supply as seen by MCU:
0: Active mode
1: Powerdown mode]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>JTAGPWR</name>
    <description><![CDATA[Indicates JTAG power state:
0: JTAG is powered off
1: JTAG is powered on]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>AUXPWR</name>
    <description><![CDATA[Indicates AUX power state:
0: AUX is powered off
1: AUX is powered on and ready for use ( also connected to bus )]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>MCUPWR</name>
    <description><![CDATA[Indicates MCU power state:
0: MCU is powered off
1: MCU is powered on]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>AUXBUSRESET_DONE</name>
    <description><![CDATA[Indicates Reset Done from AUX Bus:
0: AUX Bus is being reset
1: AUX Bus reset is released]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>AUXBUSCONNECT</name>
    <description><![CDATA[Indicates that AUX Bus is connected:
0: AUX bus is not connected
1: AUX bus is connected ( idle_ack = 0 )]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>AUXRESET_DONE</name>
    <description><![CDATA[Indicates Reset Done from AUX:
0: AUX is being reset
1: AUX reset is released]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PWRDOWN</name>
    <description><![CDATA[Indicates state of power supply:
0: Active mode
1: Powerdown mode (limited current supply)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SHUTDOWN</name>
    <description><![CDATA[Shutdown Control]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>JTAGOVERRIDE</name>
    <description><![CDATA[This register is ignored. Shutdown requests can be overriden directly from WUCTAP]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Writing a 1 to this bit force all I/O values to be latched – possibly enabling I/O wakeup – then all internal power supplies are turned off, effectively puttng the device into Shutdown mode.
Note: The shutdown request / IO latching does not take effect unti next timel system enters powerdown
]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG</name>
    <description><![CDATA[General Configuration]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>OFFPDDIS</name>
    <description><![CDATA[Controls whether MCU and AUX requesting to be powered off will enable a transition to powerdown:
0: Enabled
1: Disabled]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FIXEDWUPERIOD</name>
    <description><![CDATA[Select the a wakeup period for AUX and MCU wakeup. Wakeup time will take at least the number of lf_clk cycles specified in this register, when enabed by FIXEDWU field in MCUCFG and AUXCFG.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>AUXSRAMERASE</name>
    <description><![CDATA[Asserting this bit will erase the AUX RAM ( by asserting the eroase pin to the RAM macro)
Note. This bit can be locked]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>MCUSRAMERASE</name>
    <description><![CDATA[Asserting this bit will erase the MCU RAM ( by asserting the eroase pin to the RAM macro)
Note: This bit can be locked]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>AUXSRAMREPAIR</name>
    <description><![CDATA[SW-controlled bit reflecting the AUX SRAM repair state:
0: AUX SRAM has not been repaired
1: AUX SRAM has been repaired
NB: Once the AUX SRAM has been repaired, SW sets this bit. When this bit is set, SW will ensure that AUX SRAM is not being repaired again, as that would corrupt the contents]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>MCUSRAMREPAIR</name>
    <description><![CDATA[SW-controlled bit reflecting the MCU SRAM repair state:
0: MCU SRAM has not been repaired
1: MCU SRAM has been repaired
NB: Once the MCU SRAM has been repaired, SW sets this bit. When this bit is set, SW will ensure that MCU SRAM is not being repaired again, as that would corrupt the contents]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STATUS</name>
    <description><![CDATA[General Status]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>TAP_SECURTY_CTRL</name>
    <description><![CDATA[Readback of security ctrl word of WUC_TAP
Bit 0: t2c_wuc_sec_chiperase
Bit 1:t2c_wuc_sec_totalerase
Bit 2:t2c_wuc_sec_bddat
Bit 3:t2c_wuc_sec_bdrdy
Bit 4 :t2c_wuc_sec_aux_reset_req
Bit 5: t2c_wuc_sec_mcu_reset_req
Bit 6: t2c_wuc_sec_res6
Bit 7: t2c_wuc_sec_res7
]]></description>
    <bitRange>[23:16]</bitRange>
  </field>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:10]</bitRange>
  </field>
  <field>
    <name>TOTALERASE</name>
    <description><![CDATA[Request set by WUC TAP to request ROM FW to perform a total Flash erase
0: No action
1: Perform total Flash erase
This bit can only be set if the 128-bit unlock key has been entered correctly, but it is NOT dependent on LOCKCFG.BACKDOORENABLE.
This bit can only be cleared by writing a 1 to it]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>CHIPERASE</name>
    <description><![CDATA[Request set by WUC TAP to request ROM FW to perform a chip erase
0: No action
1: Perform full Chip erase
This bit can only be cleared by writing a 1 to it]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>MCURESETSRC</name>
    <description><![CDATA[Indicates source of last MCU VD warm reset:
0: MCU SW reset
1: JTAG reset
This bit can only be cleared by writing a 1 to it]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>MCUWARMRESET</name>
    <description><![CDATA[Indicates type of last MCU VD reset:
0: Last MCU reset was not a warm reset
1: Last MCU reset was a warm reset
This bit can only be cleared by writing a 1 to it]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RCCFG</name>
    <description><![CDATA[Recharge Controller Configuration]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>ADEN</name>
    <description><![CDATA[Enable adaptation of recharge period.
The details of the adaptation algorithm is described in the spec (TBD)]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RES</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>C2</name>
    <description><![CDATA[Gain factor for adaptive recharge algorithm

