zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
period_new=period * ( 1+/-(2^-C1+2^-C2)
Valiid values for C2 is 2 to 10]]></description>
    <bitRange>[23:20]</bitRange>
  </field>
  <field>
    <name>C1</name>
    <description><![CDATA[Gain factor for adaptive recharge algorithm

period_new=period * ( 1+/-(2^-C1+2^-C2)
Valiid values for C1 is 1 to 10]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>MAXRCPERIOD_M</name>
    <description><![CDATA[This register defines the Max period that the recharge algoritm can take, ie it defines  the maximum number of cycles between 2 recharges.
The maximum number of cycles is specified with a 5 bit mantissa and 3 bit exponent:
MAXCYCLES=({MAXPERIOD_M,4b'1111}<<MAXPERIOD_E)
This field sets the mantissa of the MAXPERIOD]]></description>
    <bitRange>[15:11]</bitRange>
  </field>
  <field>
    <name>MAXRCPERIOD_E</name>
    <description><![CDATA[This register defines the Max period that the recharge algoritm can take, ie it defines  the maximum number of cycles between 2 recharges.
The maximum number of cycles is specified with a 5 bit mantissa and 3 bit exponent:
MAXCYCLES=({MAXPERIOD_M,4'b1111}<<MAXPERIOD_E)
This field sets the exponent of the MAXPERIOD]]></description>
    <bitRange>[10:8]</bitRange>
  </field>
  <field>
    <name>PERIOD_M</name>
    <description><![CDATA[Number of 32 KHz clocks between activation of recharge controller
For recharge algorithm, PERIOD is the initial period when entering powerdown mode. The adaptive recharge algoritm will not change this register
PERIOD will effectivly be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent:

This field sets the Mantissat of the Period. PERIOD= ({PERIOD_M,4b'1111} <<PERIOD_E)]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>PERIOD_E</name>
    <description><![CDATA[Number of 32 KHz clocks between activation of recharge controller
For recharge algorithm, PERIOD is the initial period when entering powerdown mode. The adaptive recharge algoritm will not change this register
PERIOD will effectivly be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent:
This field sets the Exponent of the Period. PERIOD= ({PERIOD_M,4b'1111} <<PERIOD_E)]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RCSTAT</name>
    <description><![CDATA[Recharge Controller Status]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>VDDRSMP</name>
    <description><![CDATA[The last 4 VDDR samples, bit 0 being the newest]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>GOODPER</name>
    <description><![CDATA[The maximum value of recharge period seen with VDDR>threshold]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OSCCFG</name>
    <description><![CDATA[Oscillator Configuration]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PERIOD_M</name>
    <description><![CDATA[Number of 32 KHz clocks between oscillator amplitude calibrations.
When this counter expires, an oscillator amplitude calibration is triggered immediately in Active mode. When this counter expires in Powerdown mode an internal flag is set that causes GBIAS to turn on together with BGAP when the next recharge occurs, at the same time triggering the oscillator amplitude calibration as well as a recharge of the uLDO reference voltage.
The Period will effectivly be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent
PERIOD = ({PERIOD_M,4'b1111} << PERIOD_E)
This field sets the mantissa
Note: Oscillator amplitude calibration is turned of when both OSCCFG.PERIOD_M and OSCCFG.PERIOD_E are set to 0]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>PERIOD_E</name>
    <description><![CDATA[Number of 32 KHz clocks between oscillator amplitude calibrations.
When this counter expires, an oscillator amplitude calibration is triggered immediately in Active mode. When this counter expires in Powerdown mode an internal flag is set that causes GBIAS to turn on together with BGAP when the next recharge occurs, at the same time triggering the oscillator amplitude calibration as well as a recharge of the uLDO reference voltage.
The Period will effectivly be a 16 bit value codedn in a 5 bit mantissa and 3 bit exponent
PERIOD = ({PERIOD_M,4'b1111}} << PERIOD_E)
This field sets the exponent
Note: Oscillator amplitude calibration is turned of when both OSCCFG.PERIOD_M and OSCCFG.PERIOD_E are set to 0]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>JTAGCFG</name>
    <description><![CDATA[JTAG Configuration]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000100</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>PWRMODE</name>
    <description><![CDATA[Controls JTAG VD power state:
0: Controlled exclusively b y icemelter/icepick
1: JTAG VD is forced on, independent of icemelter/icepick
NB: the reset value causes JTAG VD to be powered on by default. SW must clear this bit to turn off the JTAG VD]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>PBIST2TAP</name>
    <description><![CDATA[PBIST2 TAP access control:
0: Disabled
1: Enabled
NB: This bit can be locked]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>PBIST1TAP</name>
    <description><![CDATA[PBIST1 TAP access control:
0: Disabled
1: Enabled
NB: This bit can be locked]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RES2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TESTTAP</name>
    <description><![CDATA[Test TAP access control:
0: Disabled
1: Enabled
NB: This bit can be locked]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>WUCTAP</name>
    <description><![CDATA[WUC TAP debug access control:
0: Disabled
1: Enabled
Note that the basic security releated WUC TAP functions described here  are always open
NB: This bit can be locked]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PRCMTAP</name>
    <description><![CDATA[PRCM access control:
0: Disabled
1: Enabled
NB: This bit can be locked]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CPUDAP</name>
    <description><![CDATA[Main CPU DAP access control:
0: Disabled
1: Enabled
NB: This bit can be locked]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>JTAGUSERCODE</name>
    <description><![CDATA[JTAG USERCODE]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x0B99A02F</resetValue>
<fields>
  <field>
    <name>USERCODE</name>
    <description><![CDATA[32-bit JTAG USERCODE register feeding main JTAG TAP
NB: This field can be locked]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UNLOCK0</name>
    <description><![CDATA[UNLOCK Key Part 0]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>KEY</name>
    <description><![CDATA[Bit [31:0] of the 128 bit unlock code.
NB: This register is write-only and can be locked]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UNLOCK1</name>
    <description><![CDATA[UNLOCK Key Part 1]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000FFFF</resetValue>
<fields>
  <field>
    <name>KEY</name>
    <description><![CDATA[Bit [63:32] of the 128 bit unlock code.
NB: This register is write-only and can be locked]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UNLOCK2</name>
    <description><![CDATA[UNLOCK Key Part 2]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>KEY</name>
    <description><![CDATA[Bit [95:64] of the 128 bit unlock code.
NB: This register is write-only and can be locked]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UNLOCK3</name>
    <description><![CDATA[UNLOCK Key Part 3]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000FFFF</resetValue>
<fields>
  <field>
    <name>KEY</name>
    <description><![CDATA[Bit [127:96] of the 128 bit unlock key.
NB: This register is write-only and can be locked]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCKCFG</name>
    <description><![CDATA[Lock Configuration]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SECURITYSTATE</name>
    <description><![CDATA[Shows Device Security State:
0: Locked
1: Unlocked
The Device Security State is unlocked if the efuse unlocked bit is set, or if the correct 128-bit unlock key has been provided (if enabled by LOCKCFG.BACKDOORENABLE).
All taps/daps will be open when this bit is set]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>STICKYBITOVERRIDE</name>
    <description><![CDATA[Sticky bit Unlock State:
0: Locked
1: Unlocked
The Sticky bit Unlock State is unlocked if the correct 128-bit unlock key has been provided (if enabled by LOCKCFG.BACKDOORENABLE).
The Stickybitoverrode is propagated to other modules containing Lockable bits to allow them to be unlocked.
Also, when the STICKYBITOVERRIDE is set, -  LOCKCFG.LOCK can be cleared.]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>RES</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[29:3]</bitRange>
  </field>
  <field>
    <name>SECURITYINITIALIZED</name>
    <description><![CDATA[Indicates to ICEPICK that bootcode has finished security initialization.
Bootcode writes to this register as theend of the safezone boot sequence.
1: Security initialization is done
0: Security initialization is not yet done.
Note that this bit is not protected.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>BACKDOORENABLE</name>
    <description><![CDATA[Controls 128-bit unlock key feature:
0: Unlock via JTAG is disabled
1: Unlock via JTAG is enabled
Note that even if unlock is disabled, total erase of the Flash is still enabled if the entered key is correct
NB: This bit can be locked]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>LOCK</name>
    <description><![CDATA[Controls access to WUC Lockable bits:
0: Lockable bits in WUC are writeable
1: Lockable bits in WUC can't be written
NB: Once set to 1, this bit can only be cleared if the sticky bit unlock is asserted]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
