zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AON_RTC</name>
<description><![CDATA[]]></description>
<baseAddress>0x40092000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CONFIG</name>
    <description><![CDATA[Configuration register]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>EVTMASK</name>
    <description><![CDATA[Eventmask selecting which delayed event signals are OR'ed together to form the combined event.
16 : Use CH0 delayed event in combined event
17:  Use CH1 delayed event in combined event
18: Use CH2 delayed event in combined event]]></description>
    <bitRange>[18:16]</bitRange>
  </field>
  <field>
    <name>RES1</name>
    <description><![CDATA[]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>EVTDELAY</name>
    <description><![CDATA[No of clock cycles the delayed event is delayed
0x0 : no delay
0x1: 1
0x2: 2
0x3: 4
0x4: 8
0x5: 16
0x6: 32
0x7: 48
0x8: 64
0x9: 80
0xA: 96
0xB: 112
0xC: 128
0xD: 144]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>RESET</name>
    <description><![CDATA[RESET RTC counter
The bit is cleared automatically by HW]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RES2</name>
    <description><![CDATA[]]></description>
    <bitRange>[6:2]</bitRange>
  </field>
  <field>
    <name>RTCUPDEN</name>
    <description><![CDATA[Enable RTC Update tick
(16 Khz signal used in radio)
1: RTC_UPD signal is toggling @16 kHz
0: RTC_UPD signal is 0]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ENABLE</name>
    <description><![CDATA[Enable RTC counter
0: Halted (frozen)
1: Running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STATUS</name>
    <description><![CDATA[Status register
Note: Reading from this register will force an immediate
synchronization of the aon status bits. The read operation is stalled for 2 cycles to ensure that data is clocked through the synchronizers]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>EVENT2</name>
    <description><![CDATA[Set by HW on CH2 event.
Cleared by writing 1, or by writing 1 to CLREVENT2, or asserting EventClr[2] HW pin (done by AUX)]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RES1</name>
    <description><![CDATA[]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>EVENT1</name>
    <description><![CDATA[Set by HW on CH1 event.
Cleared by writing 1, or by writing 1 to CLREVENT1, or asserting EventClr[1] HW pin]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RES2</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>EVENT0</name>
    <description><![CDATA[Set by HW on CH0 event.
Cleared by writing 1, or by writing 1 to CLREVENT0, or asserting EventClr[0] HW pin]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEC</name>
    <description><![CDATA[Seconds register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SEC</name>
    <description><![CDATA[Unsigned integer counting seconds. Incremented when SUBSEC overflows]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SUBSEC</name>
    <description><![CDATA[Subseconds register]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SUBSEC</name>
    <description><![CDATA[the SUBSECINC value]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SUBSECINC</name>
    <description><![CDATA[Subseconds register]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00800000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:24]</bitRange>
  </field>
  <field>
    <name>SUBSECINC</name>
    <description><![CDATA[This value is added to RTC_SUBSEC.SUBSEC on every cycle. To perform the addition, SUBSECINC[23:6] are aligned with SUBSEC[17:0]. The remaining bits SUBSECINC[5:0] are accumulated in a hidden 6-bit register that generates a carry into the above mentioned addition on overflow.
The default value corresponds to incrementing by precisely 1/32768 of a second.]]></description>
    <bitRange>[23:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CHCFG</name>
    <description><![CDATA[Channel configuration register]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:19]</bitRange>
  </field>
  <field>
    <name>CH2CONTROL</name>
    <description><![CDATA[Set to enable continuous opereation of CH2]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>RES1</name>
    <description><![CDATA[]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>CH2ENABLE</name>
    <description><![CDATA[Set to enable CH2]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RES2</name>
    <description><![CDATA[]]></description>
    <bitRange>[15:10]</bitRange>
  </field>
  <field>
    <name>CH1MODE</name>
    <description><![CDATA[Set CH1 mode
0: Compare mode (default)
1: Capture mode]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>CH1ENABLE</name>
    <description><![CDATA[Set to enable CH1]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RES3</name>
    <description><![CDATA[]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>CH0ENABLE</name>
    <description><![CDATA[Set to enable CH0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CMP0</name>
    <description><![CDATA[CH0 compare register]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CMP0</name>
    <description><![CDATA[CH0 compare value
When CMP0 == {SEC[15:0],SUBSEC[31:16]}, a CH0 event is generated]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CMP1</name>
    <description><![CDATA[CH1 compare register]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CMP1</name>
    <description><![CDATA[CH1 compare value
When CMP1 == {SEC[15:0],SUBSEC[31:16]}, a CH1 event is generated.
Only valid if CH1 is in compare mode]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CMP2</name>
    <description><![CDATA[CH2 compare register]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CMP2</name>
    <description><![CDATA[CH2 compare value
When CMP2 == {SEC[15:0],SUBSEC[31:16]}, a CH2 event is generated]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CMP2INC</name>
    <description><![CDATA[CH2 compare increment register]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CMP2INC</name>
    <description><![CDATA[This value is added to CMP2 following a CH2 event, if CH2 is in continuous mode]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CAPTURE1</name>
    <description><![CDATA[CH1 capture register]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SEC</name>
    <description><![CDATA[CH1 capture value of SEC[15:0], when CH1 capture event occurs.
Only valid if CH1 is in capture mode]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>SUBSEC</name>
    <description><![CDATA[CH1 capture value fo SUBSEC[31:16], when CH1 capture event occurs.
Only valid if CH1 is in capture mode]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYNC</name>
    <description><![CDATA[OCP synchronization register]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>WBUSY</name>
    <description><![CDATA[This register will always return 0,- however it will not return the value until there are no outstanding write requests between AONIF and AON
Note: Writing to this register prior to reading will force a wait until next LF_CLK edge. This is recommended for syncing read registers from AON when waking up from sleep
Failure to do so may result in reading aon values from prior to going to sleep]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
