zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>AON_SYSCTRL12</name>
<description><![CDATA[]]></description>
<baseAddress>0x40090000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>POWER</name>
    <description><![CDATA[Power management]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>VDDS3SEGENSET</name>
    <description><![CDATA[When written with a 1, VDDS3 I/O segment is enabled]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>VDDS2SEGENSET</name>
    <description><![CDATA[When written with a 1, VDDS2 I/O segment is enabled]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>VDDS3SEGENCLR</name>
    <description><![CDATA[When written with a 1, VDDS3 I/O segment is disabled]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>VDDS2SEGENCLR</name>
    <description><![CDATA[When written with a 1, VDDS2 I/O segment is disabled]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:3]</bitRange>
  </field>
  <field>
    <name>DCDCACTIVE</name>
    <description><![CDATA[Select if DCDC is used in active mode
1: Use DCDC in active mode.
0: Do not use DCDC in active mode. ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EXTREGMODE</name>
    <description><![CDATA[Status of source for VDDR supply:
0: DCDC/GLDO are to generate VDDR
1: DCDC/GLDO are bypassed, external regulator supplies VDDR]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DCDCEN</name>
    <description><![CDATA[Controls use of DCDC when going from Powerdown to Active due to a wakeup or recharge request
0: Use GLDO
1: Use DCDC]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET</name>
    <description><![CDATA[Reset management]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000E0</resetValue>
<fields>
  <field>
    <name>SYSRESET</name>
    <description><![CDATA[Cold reset register
1: Generate system reset. Appears as pin reset]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[30:12]</bitRange>
  </field>
  <field>
    <name>VDDSLOSSENOR</name>
    <description><![CDATA[Override of VDDSLOSSEN
0: Brown out detect of VDDS is ignored, unless VDDSLOSSEN=1
1: Brown out detect of VDDS generates system reset
This bit can be locked]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>VDDRLOSSENOR</name>
    <description><![CDATA[Override of VDDRLOSSEN
0: Brown out detect of VDDR is ignored, unless VDDRLOSSEN=1
1: Brown out detect of VDDR generates system reset
This bit can be locked]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>VDDLOSSENOR</name>
    <description><![CDATA[Override of VDDLOSSEN
0: Brown out detect of VDD is ignored, unless VDDLOSSEN=1
1: Brown out detect of VDD generates system reset
This bit can be locked]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>CLKLOSSENOR</name>
    <description><![CDATA[Override of CLKLOSSEN
Clock loss enable:
0: Clock loss is ignored unless CLKLOSSEN=1
1: Clock loss generates system reset
This bit can be locked]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>VDDSLOSSEN</name>
    <description><![CDATA[0: Brown out detect of VDDS is ignored, unless VDDSLOSSENOR=1
1: Brown out detect of VDDS generates system reset]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>VDDRLOSSEN</name>
    <description><![CDATA[0: Brown out detect of VDDR is ignored, unless VDDRLOSSENOR=1
1: Brown out detect of VDDR generates system reset]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>VDDLOSSEN</name>
    <description><![CDATA[0: Brown out detect of VDD is ignored, unless VDDLOSSENOR=1
1: Brown out detect of VDD generates system reset]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>CLKLOSSEN</name>
    <description><![CDATA[Clock loss enable:
0: Clock loss is ignored, unless CLKLOSSENOR=1
1: Clock loss generates system reset]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESETSRC</name>
    <description><![CDATA[Shows the source of the last system reset:
000: Power-on
001: RESET pin
010: VDDS BOD
011: VDD BOD
100: VDDR BOD
101: Clock loss
110: Shutdown
111: Reserved
NB: latched after reset, hence must be cleared to be prepared to latch the source of a subsequent reset]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>RESETSRCCLR</name>
    <description><![CDATA[Clear the reset source:
0: Do not affect reset source
1: Clear reset source
This bit is automatically cleared when the operation has been completed]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SLEEP</name>
    <description><![CDATA[Sleep mode register]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SLEEPDIS</name>
    <description><![CDATA[Controls the I/O pad sleep mode:
0: I/O pad sleep mode is enabled
1: I/O pad sleep mode is disabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DEBUG</name>
    <description><![CDATA[Debug register ]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RES0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[This register is reserved for a additional debuggin features in sysctrl.
Bit 0: Disable asynchrouns startup of sysctrl
Bit 1: Sysctrl stays in PDACTIVE untill VDDR_OK is seen.
Bit 2: 1: Dont check for rcoschf when going to PD
Bit 3: 1: Turn off clk_chp
Bit 4: 1: Do not indicate to osctop that we are in PD
Bit 7:5: Reserved]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
