zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>PRCM</name>
<description><![CDATA[PRCM component]]></description>
<baseAddress>0x40082000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>INFCLK_RDIV</name>
    <description><![CDATA[INF clock division factor in run mode]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock
0: 1
1: 2
2: 8
3: 32
Infrastructure clock This clock is asynchronous and distributed using ULL clock cells. If source clock is 48 MHz, minimum divider is 2.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INFCLK_SDIV</name>
    <description><![CDATA[INF clock division factor in sleep mode]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock
0: 1
1: 2
2: 8
3: 32
Infrastructure clock This clock is asynchronous and distributed using ULL clock cells. If source clock is 48 MHz, minimum divider is 2.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>INFCLK_DSDIV</name>
    <description><![CDATA[INF clock division factor in deep sleep mode]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock
0: 1
1: 2
2: 8
3: 32
Infrastructure clock This clock is asynchronous and distributed using ULL clock cells. If source clock is 48 MHz, minimum divider is 2.]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PD_REQ</name>
    <description><![CDATA[CPU Power domain control]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>MFCLK</name>
    <description><![CDATA[Bit is obsolete.
The control is placed in MCUCLK.PDSRC in the WUC]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>MCU_VD</name>
    <description><![CDATA[Request WUC to power down the MCU voltage domain
1 - Assert request when CM3 is in deepsleep and RFCORE is idle
0 - No request

The bit will have no effect before
1. RFCORE do no request the bus
2. deepsleep is asserted]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>LFCLK</name>
    <description><![CDATA[Bit is obsolete.
The control is placed in MCUCLK.PDSRC in the WUC]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>ULDO</name>
    <description><![CDATA[Request WUC to switch to uLDO.
1 - Assert request when possible
0 - No request

The bit will have no effect before the following requirements are met:
1. FLASH has accepted to be powered down
2. deepsleep must be asserted]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLKCTRL</name>
    <description><![CDATA[Load settings to CLKCTRL]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000002</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>LOAD_STATUS</name>
    <description><![CDATA[Status of load.
Will be cleared to 0 when a write access to any of the registers requiring a load and be set to 1 when a load is done.
Note that writing no change to a register will result in the load status being cleared.

0 : One or more registers have been write accessed after last load
1 : No registers are write accessed after last load]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>LOAD</name>
    <description><![CDATA[Write 1 to load settings to CLKCTRL. Bit is HW cleared.

Multiple changes to settings may be done before load is written once so all changes takes place at the same time. LOAD can also be done after single setting updates.

Registers that needs to be followed by LOAD before settings being applied are:
- SYSBUSCLK_DIV
- CPUCLK_DIV
- PERBUSCPUCLK_DIV
- PERBUSDMACLK_DIV
- PERDMACLK_DIV
- CG_PERBUSCPUCLK
- CG_PERBUSDMACLK
- CG_RFCORECLK
- CG_FLASHCLK
- RCG_SEC_DMA
- SCG_SEC_DMA
- DSCG_SEC_DMA
- RCG_GPIO
- SCG_GPIO
- DSCG_GPIO
- RCG_GPTM
- SCG_GPTM
- DSCG_GPTM
- GPTM_DIV
- RCG_I2C
- SCG_I2C
- DSCG_I2C
- RCG_SSI
- SCG_SSI
- DSCG_SSI
- RCG_UART
- SCG_UART
- DSCG_UART
- RCG_I2S
- SCG_I2S
- DSCG_I2S
- BCLK_CTRL
- AGENCN
- AGENMDR
- AGENBDR
- AGENWDR
- CONFIG_RAMSIZE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORECLK_CG</name>
    <description><![CDATA[RFCORE clk gate]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[0: Clock gated
1: Clock running if RFCORE power domain is on]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FLASHCLK_CG</name>
    <description><![CDATA[FLASH clk gate]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[00: Clock gated
01: Clock running if CPUCORECLK is running
11: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERBUSCPUCLK_CG</name>
    <description><![CDATA[PERBUSCPU clock clock gate]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Register are not in use]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERBUSDMACLK_CG</name>
    <description><![CDATA[PERBUSDMA clock clock gate]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Register are not in use]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEC_DMA_RCG</name>
    <description><![CDATA[SEC and DMA clk gate for run mode]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>DMA</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>TRNG</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CRYPTO</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEC_DMA_SCG</name>
    <description><![CDATA[SEC and DMA clk gate for sleep mode]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>DMA</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>TRNG</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CRYPTO</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SEC_DMA_DSCG</name>
    <description><![CDATA[SEC and DMA clk gate for deep sleep mode]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>DMA</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>TRNG</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CRYPTO</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIO_RCG</name>
    <description><![CDATA[GPIO clk gate for run mode]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>GPIO</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIO_SCG</name>
    <description><![CDATA[GPIO clk gate for sleep mode]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>GPIO</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPIO_DSCG</name>
    <description><![CDATA[GPIO clk gate for deep sleep mode]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>GPIO</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPTM_RCG</name>
    <description><![CDATA[GPTM clk gate for run mode]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>GPTM</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPTM_SCG</name>
    <description><![CDATA[GPTM clk gate for sleep mode]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>GPTM</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPTM_DSCG</name>
    <description><![CDATA[GPTM clk gate for deep sleep mode]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>GPTM</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2C_RCG</name>
    <description><![CDATA[I2C clk gate for run mode]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>I2C</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2C_SCG</name>
    <description><![CDATA[I2C clk gate for sleep mode]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>I2C</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2C_DSCG</name>
    <description><![CDATA[I2C clk gate for deep sleep mode]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>I2C</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UART_RCG</name>
    <description><![CDATA[UART clk gate for run mode]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>UART</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UART_SCG</name>
    <description><![CDATA[UART clk gate for sleep mode]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>UART</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UART_DSCG</name>
    <description><![CDATA[UART clk gate for deep sleep mode]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>UART</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SSI_RCG</name>
    <description><![CDATA[SSI clk gate for run mode]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SSI</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SSI_SCG</name>
    <description><![CDATA[SSI clk gate for sleep mode]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SSI</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SSI_DSCG</name>
    <description><![CDATA[SSI clk gate for deep sleep mode]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SSI</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2S_RCG</name>
    <description><![CDATA[I2S clk gate for run mode]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>I2S</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2S_SCG</name>
    <description><![CDATA[I2S clk gate for sleep mode]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>I2S</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2S_DSCG</name>
    <description><![CDATA[I2S clk gate for deep sleep mode]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>I2S</name>
    <description><![CDATA[0: Clock gated
1: Clock running]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYSBUSCLK_DIV</name>
    <description><![CDATA[SYSBUS clock division factor]]></description>
    <addressOffset>0x000000B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock
0: 1
1: 2
2: 4
3: 8
4: 16
5: 32
6: NA (Forced 32)
7: NA (Forced 32)]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CPUCLK_DIV</name>
    <description><![CDATA[CPU clock division factor]]></description>
    <addressOffset>0x000000B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock
0: 1
1: 2]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERBUSCPUCLK_DIV</name>
    <description><![CDATA[PERBUSCPU clock division factor]]></description>
    <addressOffset>0x000000BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock when sysbusclk is gated and CG_PERBUSCPUCLK = 1. When sysbusclk is running perbuscpuclk use SYSBUSCLK_DIV setting
0: 1
1: 2
2: 4
3: 8
4: 16
5: 32
6: 64
7: 128
8: 256
9: NA (Forced 256)
10: NA (Forced 256)
11: NA (Forced 256)
12: NA (Forced 256)
13: NA (Forced 256)
14: NA (Forced 256)
15: NA (Forced 256)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERBUSDMACLK_DIV</name>
    <description><![CDATA[PERBUSDMA clock division factor]]></description>
    <addressOffset>0x000000C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Register are not in use]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
