zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>PERDMACLK_DIV</name>
    <description><![CDATA[PERDMA clock division factor]]></description>
    <addressOffset>0x000000C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Division rate for this clock
0: 1
1: 2
2: 4
3: 8
4: 16
5: 32
6: 64
7: 128
8: 256
9: NA (Forced 256)
10: NA (Forced 256)
11: NA (Forced 256)
12: NA (Forced 256)
13: NA (Forced 256)
14: NA (Forced 256)
15: NA (Forced 256)
Asynchronous clock. Software is responsible for selecting a safe frequency. (≤5/3 perbusdmaclk for uart operation, ≤ perbusdmaclk for ssi operation)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>BCLK_CTRL</name>
    <description><![CDATA[I2S clock ctrl]]></description>
    <addressOffset>0x000000C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Not in use]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>SEL</name>
    <description><![CDATA[BCLK source selector
0: Use external bclk
1: Use internally generated clock]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPTM_DIV</name>
    <description><![CDATA[GPTM scalar]]></description>
    <addressOffset>0x000000CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>DIVFACTOR</name>
    <description><![CDATA[Scalar used for GPTMs. The division rate will be constant and ungated for Run / Sleep/ DeepSleep mode when it is slower than the PERBUSCPU_DIV setting. When set faster than PERBUSCPU_DIV setting the PERBUSCPU_DIV will be used.
Note that the register will contain the written content even though the setting is faster that PERBUSCUP_DIV setting.
0: 1
1: 2
2: 4
3: 8
4: 16
5: 32
6: 64
7: 128
8: 256
9: NA (Forced 256)
10: NA (Forced 256)
11: NA (Forced 256)
12: NA (Forced 256)
13: NA (Forced 256)
14: NA (Forced 256)
15: NA (Forced 256)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AGENCN</name>
    <description><![CDATA[ACLK control]]></description>
    <addressOffset>0x000000D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>ADRP</name>
    <description><![CDATA[Active edge of clk_bclk in the audio interface module. If set, wclkgen is toggled on negative edge of bclkgen. Opposite if not set.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>WCLKPHS</name>
    <description><![CDATA[Decides how the wclkgen division ratio is calculated and used to generate different duty cycles (WDIV in the AGENWDR register).
00 – Single phase
01 – Dual phase
10 – User Defined
11 – Reserved/Undefined]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>MBWEN</name>
    <description><![CDATA[Enables the generation of mclkgen, bclkgen, wclkgen and wclkgen_n when set. If disabled, mclkgen, bclkgen and wclkgen will be static low, while wclkgen_n will be static high.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AGENMDR</name>
    <description><![CDATA[MCLK Division ratio]]></description>
    <addressOffset>0x000000D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>MDIV</name>
    <description><![CDATA[An unsigned factor of the division ratio used to generate mclkgen [2-1024]:

mclkgen = clk_aclk/MDIV[Hz]

A value of 0 is interpreted as 1024.
A value of 1 is invalid.
If MDIV is odd the low phase of the clock is one clk_aclk period longer than the high phase.]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AGENBDR</name>
    <description><![CDATA[BCLK Division ratio]]></description>
    <addressOffset>0x000000D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>BDIV</name>
    <description><![CDATA[An unsigned factor of the division ratio used to generate bclkgen [2-1024]:

bclkgen = clk_aclk/MDIV[Hz]

A value of 0 is interpreted as 1024.
A value of 1 is invalid.
If BDIV is odd and ADRP=0, the low phase of the clock is one clk_aclk period longer than the high phase, if ADRP=1 the high phase is longer.]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AGENWDR</name>
    <description><![CDATA[WCLK Division ratio]]></description>
    <addressOffset>0x000000DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>WDIV</name>
    <description><![CDATA[If WCLKPHS = 00, Single phase.
wclkgen is high one bclkgen period and low WDIV[9:0] (unsigned, [1-1023]) bclkgen periods.

wclkgen = clk_aclk / BDIV*(WDIV[9:0] + 1) [Hz]

If WCLKPHS = 01, Dual phase.
Each phase on wclkgen (50% duty cycle) is WDIV[9:0] (unsigned, [1-1023]) bclkgen periods.

wclkgen = clk_aclk / BDIV*(2*WDIV[9:0]) [Hz]

