zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
If WCLKPHS = 10, User defined.
wclkgen is high WDIV[7:0] (unsigned, [1-255]) bclkgen periods and low WDIV[15:8] (unsigned, [1-255]) bclkgen periods.

wclkgen = clk_aclk / (BDIV*(WDIV[7:0] + WDIV[15:8]) [Hz] ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_SEC_DMA</name>
    <description><![CDATA[RESET for SEC and DMA]]></description>
    <addressOffset>0x000000F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>DMA</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.PERIPH = 1)]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>TRNG</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.PERIPH = 1)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CRYPTO</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.PERIPH = 1)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_GPIO</name>
    <description><![CDATA[RESET for GPIO IPs]]></description>
    <addressOffset>0x000000F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>GPIO</name>
    <description><![CDATA[Write 1 to reset. HW cleared.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_GPTM</name>
    <description><![CDATA[RESET for GPTM IPs]]></description>
    <addressOffset>0x000000F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>GPTM</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.PERIPH = 1)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_I2C</name>
    <description><![CDATA[RESET for I2C IPs]]></description>
    <addressOffset>0x000000FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>I2C</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.SERIAL = 1)]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_UART</name>
    <description><![CDATA[RESET for UART IPs]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>UART</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.SERIAL = 1)]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_SSI</name>
    <description><![CDATA[RESET for SSI IPs]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>SSI</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
SSI 0:
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.SERIAL = 1)
SSI 1:
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.PERIPH = 1)]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESET_I2S</name>
    <description><![CDATA[RESET for I2S IP]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>I2S</name>
    <description><![CDATA[Write 1 to reset. HW cleared.
Acess will only have effect when PERIPH power domain is on (SWPWR_STATUS.PERIPH = 1)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SW_RESET</name>
    <description><![CDATA[SYSBUS clock sleep mode gate]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>MCU</name>
    <description><![CDATA[Write 1 generates reset request to WUC to reset the entire MCU voltage domain. Request is cleared by HW.

Everything in MCU voltage domain reset including PRCM itself]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[Write 1 generates reset pulse on reset_rfcore_n. HW cleared
Acess will only have effect when RFCORE power domain is on (SWPWR_STATUS.RFCORE = 1)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[Write 1 generates reset pulse on reset_cpucore_n. HW cleared
Acess will only have effect when CPU power domain is on (MNGPWR_STATUS.CPU = 1)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WARM_RESET</name>
    <description><![CDATA[WARM reset status]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>LOCKUP_STATUS</name>
    <description><![CDATA[0 - No registred event
1 - A CM3 LOCKUP event has occured since last SW clear of the register.
A read of this register clears both status bits.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>WDT_STATUS</name>
    <description><![CDATA[0 - No registred event
1 - A WDT event has occured since last SW clear of the register.
A read of this register clears both status bits.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_CTRL</name>
    <description><![CDATA[Power domain control]]></description>
    <addressOffset>0x0000012C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>PERIPH</name>
    <description><![CDATA[PERIPH Power domain.
0 - PERIPH power domain is powered down
1 - PERIPH power domain is powered up]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SERIAL</name>
    <description><![CDATA[SERIAL Power domain.
0 - SERIAL power domain is powered down
1 - SERIAL power domain is powered up]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[1 - RFCORE power domain powered on
0 - RFCORE power domain powered off if also NMGPWR_CTRL.RFC = '0']]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_RFCORE_CTRL</name>
    <description><![CDATA[RFCORE Power domain control]]></description>
    <addressOffset>0x00000130</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[Alias for SWPWR_CTRL.RFCORE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_SERIAL_CTRL</name>
    <description><![CDATA[SERIAL Power domain control]]></description>
    <addressOffset>0x00000134</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>SERIAL</name>
    <description><![CDATA[Alias for SWPWR_CTRL.SERIAL]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_PERIPH_CTRL</name>
    <description><![CDATA[PERIPH Power domain control]]></description>
    <addressOffset>0x00000138</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>PERIPH</name>
    <description><![CDATA[Alias for SWPWR_CTRL.PERIPH]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_STATUS</name>
    <description><![CDATA[Power domain control]]></description>
    <addressOffset>0x00000140</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>PERIPH</name>
    <description><![CDATA[PERIPH Power domain.
0 - Domain may be powered down
1 - Domain powered up (guaranteed)]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SERIAL</name>
    <description><![CDATA[SERIAL Power domain.
0 - Domain may be powered down
1 - Domain powered up (guaranteed)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[RFCORE Power domain
0 - Domain may be powered down
1 - Domain powered up (guaranteed)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_RFCORE</name>
    <description><![CDATA[RFCORE Power domain control]]></description>
    <addressOffset>0x00000144</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Alias for SWPWR_STATUS.RFCORE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_SERIAL</name>
    <description><![CDATA[SERIAL Power domain control]]></description>
    <addressOffset>0x00000148</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Alias for SWPWR_STATUS.SERIAL]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_PERIPH</name>
    <description><![CDATA[PERIPH Power domain control]]></description>
    <addressOffset>0x0000014C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Alias for SWPWR_STATUS.PERIPH]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_CTRL</name>
    <description><![CDATA[MNG Power domain control]]></description>
    <addressOffset>0x0000017C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000A</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[When 1  BUS power domain is powered on.
When 0 BUS power domain is powered when  RFCORE needs access or CPU power doamain is on. Else BUS power domain is powered down.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>FL_BUS</name>
    <description><![CDATA[1 - VIMS power domain is powered whenever the BUS power domain is powered.
0 - VIMS power domain is only powered when CPU is powered.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RFC</name>
    <description><![CDATA[1 - RFCORE power domain powered on
0 - RFCORE power domain powered off if also SWPWR_CTRL.RFC = '0'

