zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Bit shall be used by RFCORE in autonomus mode but there is no HW restrictions fom CM3 to access the bit.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[Setting this bit to ‘1’ initiates power-on of the CPU power domain.
Setting this bit to ‘0’ causes a power down of the CPU power domain when CPU indicates it is idle, and initiates power-down of the BUS and SRAM power domains when BUS_RFC=0.
This bit shall be automatically set by a WIC power-on event.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Earlier RFC_BUS bit. Bit functionality is replaced with RFC_WU dirctly from RFCORE]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_CPU_CTRL</name>
    <description><![CDATA[CPU direct control]]></description>
    <addressOffset>0x00000184</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[This is an alias for MNGPWR_CTRL.CPU]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_RFC_CTRL</name>
    <description><![CDATA[RFC direct control]]></description>
    <addressOffset>0x00000188</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RFC</name>
    <description><![CDATA[This is an alias for MNGPWR_CTRL.RFC]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_FL_BUS_CTRL</name>
    <description><![CDATA[FL_BUS direct control]]></description>
    <addressOffset>0x0000018C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>FL_BUS</name>
    <description><![CDATA[This is an alias for MNGPWR_CTRL.FL_BUS]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_BUS_CTRL</name>
    <description><![CDATA[BUS direct control]]></description>
    <addressOffset>0x00000190</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[This is an alias for MNGPWR_CTRL.BUS]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_STATUS</name>
    <description><![CDATA[Power manager status]]></description>
    <addressOffset>0x00000194</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000001A</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:5]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[This bit indicates if the BUS domain is currently accessible (‘1’)]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>FL_BUS</name>
    <description><![CDATA[This bit indicates if the VIMS domain is currently accessible (‘1’)]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RFC</name>
    <description><![CDATA[This bit indicates if the RFCORE domain is currently accessible (‘1’)]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[This bit indicates if the CPU, BUS and SRAM domain is currently accessible (‘1’)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_BUS_STATUS</name>
    <description><![CDATA[BUS direct status read]]></description>
    <addressOffset>0x00000198</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[This is an alias for MNGPWR_STATUS.BUS]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_RFC_STATUS</name>
    <description><![CDATA[RFC direct status read]]></description>
    <addressOffset>0x0000019C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RFC</name>
    <description><![CDATA[This is an alias for MNGPWR_STATUS.RFC]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_CPU_STATUS</name>
    <description><![CDATA[CPU direct status read]]></description>
    <addressOffset>0x000001A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[This is an alias for MNGPWR_STATUS.CPU]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MNGPWR_FLASH_STATUS</name>
    <description><![CDATA[FLASH direct status read]]></description>
    <addressOffset>0x000001A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>FLASH</name>
    <description><![CDATA[This is an alias for MNGPWR_STATUS.FL_BUS]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORE_RBITS</name>
    <description><![CDATA[Control to RFCORE]]></description>
    <addressOffset>0x000001CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>READ</name>
    <description><![CDATA[Outputs to rf_core. Not PRCM related but placed here since RFCORE does not have retention]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORE_SMODE</name>
    <description><![CDATA[Selected mode]]></description>
    <addressOffset>0x000001D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>CURRENT</name>
    <description><![CDATA[Written by MCU - Outputs to rf_core. Only modes permitted by RFCORE_AMODE shall be writeable.
000: Mode 0
001: Mode 1
010: Mode 2
011: Mode 3
100: Mode 4
101: Mode 5
110: Mode 6
111: Mode 7 ]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORE_AMODE</name>
    <description><![CDATA[Allowed modes]]></description>
    <addressOffset>0x000001D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CFG</name>
    <description><![CDATA[Written once during boot. Defines permitted RFCORE modes. More than one mode can be permitted.
Bit 0: Mode 0
Bit 1: Mode 1
Bit 2: Mode 2
Bit 3: Mode 3
Bit 4: Mode 4
Bit 5: Mode 5
Bit 6: Mode 6
Bit 7: Mode 7 ]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LOCK_PSW</name>
    <description><![CDATA[Lock power switch register]]></description>
    <addressOffset>0x00000220</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LOCK</name>
    <description><![CDATA[Lock CONFIG_PSW register from write.
0 - All bits in  CONFIG_PSW writeable
1 - All bits in  CONFIG_PSW register locked from writing.
This bit can only be cleared when PRCM_LOCKED = 0.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MEM_RET</name>
    <description><![CDATA[DIE CONFIG for retention]]></description>
    <addressOffset>0x00000224</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[0: Retention for RFCORE SRAM disabled
1: Retention for RFCORE SRAM enabled]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[0: Memory retention disabled
1: Memory retention enabled
Bit 0 -> TRAM
Bit 1 -> CRAM]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_RFC</name>
    <description><![CDATA[DIE CONFIG for RFCORE]]></description>
    <addressOffset>0x00000228</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[0 - RFCORE disabled
1 - RFCORE enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_RET</name>
    <description><![CDATA[Retention control]]></description>
    <addressOffset>0x0000022C</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000E7</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SPARE</name>
    <description><![CDATA[0: Retention disabled
1: Retention enabled]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>PERIPH</name>
    <description><![CDATA[0: Retention disabled
1: Retention enabled]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SERIAL</name>
    <description><![CDATA[0: Retention disabled
1: Retention enabled]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[Domain not designed for retention]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[Domain not designed for retention]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: Retention disabled
1: Retention enabled]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[0: Retention disabled
1: Retention enabled]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CLKCTRL</name>
    <description><![CDATA[0: Retention disabled
1: Retention enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_SEC_DMA</name>
    <description><![CDATA[DIE CONFIG for SEC and DMA]]></description>
    <addressOffset>0x00000230</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED_1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:9]</bitRange>
  </field>
  <field>
    <name>EN_DMA</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: DMA module disabled
1: DMA module enabled ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED_0</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[7:2]</bitRange>
  </field>
  <field>
    <name>EN_TRNG</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: TRNG module disabled
1: TRNG module enabled]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EN_CRYPTO</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: CRYPTO module disabled
1: CRYPTO module enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_GPIO</name>
    <description><![CDATA[DIE CONFIG for GPIO]]></description>
    <addressOffset>0x00000234</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: GPIO module disabled
1: GPIO module enabled ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_GPTM</name>
    <description><![CDATA[DIE CONFIG for GPTM]]></description>
    <addressOffset>0x00000238</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: GPTM module disabled
1: GPTM module enabled ]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_I2C</name>
    <description><![CDATA[DIE CONFIG for I2C]]></description>
    <addressOffset>0x0000023C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: I2C module disabled
1: I2C module enabled ]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_UART</name>
    <description><![CDATA[DIE CONFIG for UART]]></description>
    <addressOffset>0x00000240</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: UART module disabled
1: UART module enabled ]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_SSI</name>
    <description><![CDATA[DIE CONFIG for SSI]]></description>
    <addressOffset>0x00000244</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: SSI module disabled
1: SSI module enabled ]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_I2S</name>
    <description><![CDATA[DIE CONFIG for I2S]]></description>
    <addressOffset>0x00000248</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>EN</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
0: I2S module disabled
1: I2S module enabled ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_PRCM</name>
    <description><![CDATA[PRCM config lock]]></description>
    <addressOffset>0x0000024C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>LOCK</name>
    <description><![CDATA[Lock all config, write-once and sticky bits in PRCM. Wiriting '1' to this bit also locks writing to this bit itself.
0: Sticky, write-once and config bits may be altered
1: Sticky, write-once and config bits locked for editing. Bit may be altered if stickybit_overide is asserted.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_RAMSIZE</name>
    <description><![CDATA[CONFIG SIZE for SRAM]]></description>
    <addressOffset>0x00000250</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>RAMSIZE</name>
    <description><![CDATA[Only writeable when PRCM_LOCKED = '0'
Must be loaded with CLKCTRL.LOAD before taking effect
00 - 2k
01 - 4k
10 - 8k
11 - 16k]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CONFIG_PSW</name>
    <description><![CDATA[Power switch config]]></description>
    <addressOffset>0x00000254</addressOffset>
    <access>read-write</access>
    <resetValue>0x16230003</resetValue>
<fields>
  <field>
    <name>DELAY</name>
    <description><![CDATA[This bit shall be written with care! Can only be written when LOCK_PSW.LOCK = 0
Control the time between the last weak switch closed to the first strong switch can be closed. From power-on the reset value will be used but SW may update this register to shorten the delay. The dealy is defined by two system clock periods per integer in this register. I.e if set to 03 and the system runs at 48MHz the delay will be six 48MHz periods long.
Writing a too low value to this register may result in LDO voltage drop and possible flash corruption! Don't!]]></description>
    <bitRange>[31:21]</bitRange>
  </field>
  <field>
    <name>S_JSTART</name>
    <description><![CDATA[This bits shall be written with care! Can only be written when LOCK_PSW.LOCK = 0
Strong Jump Start switch control that minimize the power up time for power domains. During test information about production corner shall be stored in Flash. From power-on the worst case will be used but SW may update this register to jump-start the number of weak switches that can be connected simultaneously when power domains are powered up.
The coding is temperature so only 0 - 1 - 3 - 7 are valid values.
Writing a too high or invalid value to this register may result in LDO voltage drop and possible flash corruption! Don't!]]></description>
    <bitRange>[20:18]</bitRange>
  </field>
  <field>
    <name>S_PCNT</name>
    <description><![CDATA[This bit shall be written with care! Can only be written when LOCK_PSW.LOCK = 0
Defines number of undivided INFCLK perioods between each group of weak switches closing.
00 - PONIN[n+1] = closed 1 period after PONIN[n]
01 - PONIN[n+1] = closed 2 periods after PONIN[n]
10 - PONIN[n+1] = closed 3 periods after PONIN[n]
11 - PONIN[n+1] = closed 4 periods after PONIN[n]
Writing a too low value to this register may result in LDO voltage drop and possible flash corruption! Don't!]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>W_JSTART</name>
    <description><![CDATA[This bits shall be written with care! Can only be written when LOCK_PSW.LOCK = 0
Weak Jump Start switch control that minimize the power up time for power domains. During test information about production corner shall be stored in Flash. From power-on the worst case will be used but SW may update this register to jump-start the number of weak switches that can be connected simultaneously when power domains are powered up.
The coding is temperature so only 0000 - 0001 - 0003 -0007 - 000F - 001F - 003F ... - 1FFF are valid values.
Writing a too high or invalid value to this register may result in LDO voltage drop and possible flash corruption! Don't!]]></description>
    <bitRange>[15:2]</bitRange>
  </field>
  <field>
    <name>W_PCNT</name>
    <description><![CDATA[This bit shall be written with care! Can only be written when LOCK_PSW.LOCK = 0
Defines number of undivided INFCLK perioods between each group of weak switches closing.
00 - PONIN[n+1] = closed 1 period after PONIN[n]
01 - PONIN[n+1] = closed 2 periods after PONIN[n]
10 - PONIN[n+1] = closed 3 periods after PONIN[n]
11 - PONIN[n+1] = closed 4 periods after PONIN[n]
Writing a too low value to this register may result in LDO voltage drop and possible flash corruption! Don't!]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_DBG</name>
    <description><![CDATA[Power domain control]]></description>
    <addressOffset>0x00000258</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[BUS Power domain
Writing 0 to this bit shall only be done for debug. When written 0 the BUS powerdomain is powered down regardless of other settings.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[VIMS Power domain
Writing 0 to this bit shall only be done for debug. When written 0 the VIMS powerdomain is powered down regardless of other settings.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[CPU Power domain
Writing 0 to this bit shall only be done for debug. When written 0 the CPU powerdomain is powered down regardless of other settings.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_DBG_CPU</name>
    <description><![CDATA[CPU Power domain control]]></description>
    <addressOffset>0x0000025C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[Alias for SWPWR_DBG.CPU]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
