zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>SWPWR_DBG_VIMS</name>
    <description><![CDATA[VIMS Power domain control]]></description>
    <addressOffset>0x00000260</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[Alias for SWPWR_DBG.VIMS]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_DBG_BUS</name>
    <description><![CDATA[BUS Power domain control]]></description>
    <addressOffset>0x00000264</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[Alias for SWPWR_DBG.BUS]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SWPWR_DBG_STATUS</name>
    <description><![CDATA[Power domain control]]></description>
    <addressOffset>0x00000268</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>BUS</name>
    <description><![CDATA[BUS Power domain]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[VIMS Power domain]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CPU</name>
    <description><![CDATA[CPU Power domain]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLOCK_OVR</name>
    <description><![CDATA[Force modules clocks on]]></description>
    <addressOffset>0x0000026C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:22]</bitRange>
  </field>
  <field>
    <name>SPARE</name>
    <description><![CDATA[Unused ]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>I2S_0</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>SSI_1</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>SSI_0</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>UART_1</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>UART_0</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>I2C_1</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>I2C_0</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>PERDMA</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>PERBUSDMA</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>GPTM_3</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>GPTM_2</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>GPTM_1</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>GPTM_0</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>GPIO</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DMA</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TRNG</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>CRYPTO</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>PERBUSCPU</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>FLASH</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PERBUSULL</name>
    <description><![CDATA[0: No action
1: Force clock on ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SYSRES_DBG</name>
    <description><![CDATA[SW system reset]]></description>
    <addressOffset>0x00000270</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>TRIG</name>
    <description><![CDATA[0: No action
1: Generates a resetpulse that resets all MCU LL logic but configuration registers. Same result as a WDT timeout. Bit is HW cleared.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PD_FORCE_ON</name>
    <description><![CDATA[Force power domains on]]></description>
    <addressOffset>0x00000278</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>SERIAL</name>
    <description><![CDATA[0: No action
1: Force SERIAL PD on]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>PERIPH</name>
    <description><![CDATA[0: No action
1: Force PERIPH PD on]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>RFCORE</name>
    <description><![CDATA[0: No action
1: Force RFCORE PD on]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>VIMS</name>
    <description><![CDATA[0: No action
1: Force VIMS PD on]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PD_TEST</name>
    <description><![CDATA[Turn on TEST power doamin]]></description>
    <addressOffset>0x0000027C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>ON</name>
    <description><![CDATA[0: Turn off TEST PD
1: Turn on TEST PD]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
