zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>UDMA0</name>
<description><![CDATA[DMA Component]]></description>
<baseAddress>0x40020000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>STATUS</name>
    <description><![CDATA[DMA Status]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x001F0000</resetValue>
<fields>
  <field>
    <name>TEST</name>
    <description><![CDATA[0x0 --> Controller does not include the integration test logic
0x1 --> Controller includes the integration test logic
0x2 - 0xF --> Undefined]]></description>
    <bitRange>[31:28]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[27:21]</bitRange>
  </field>
  <field>
    <name>TOTALCHANNELS</name>
    <description><![CDATA[Number of available DMA channels minus one. For example

b00000 --> Controller configured to use 1 DMA channel
b00001 --> Controller configured to use 2 DMA channel
    .
    .
b11111 --> Controller configured to use 32 DMA channel]]></description>
    <bitRange>[20:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>STATE</name>
    <description><![CDATA[Current state of the control state machine. State can be one of the following:

b0000 --> idle
b0001 --> reading channel controller data
b0010 --> reading source data end pointer
b0011 --> reading destination data end pointer
b0100 --> reading source data
b0101 --> writing destination data
b0110 --> waiting for DMA request to clear
b0111 --> writing channel controller data
b1000 --> stalled
b1001 --> done
b1010 --> peripheral scatter-gather transition
b1011-b1111 --> undefined.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[3:1]</bitRange>
  </field>
  <field>
    <name>MASTERENABLE</name>
    <description><![CDATA[Enable status of the controller:

0 --> Controller is disabled
1 --> Controller is enabled]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CFG</name>
    <description><![CDATA[DMA Configuration]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Undefined. Write as zero]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PRTOCTRL</name>
    <description><![CDATA[Sets the AHB-Lite protection by controlling the HPROT[3:1] signal levels as follows:

Bit [7] Controls HPROT[3] to indicate if a cacheable access is occurring.
Bit [6] Controls HPROT[2] to indicate if a bufferable access is occurring.
Bit [5] Controls HPROT[1] to indicate if a privileged access is occurring.

When bit [n] = 1 then the corresponding HPROT is HIGH.
When bit [n] = 0 then the corresponding HPROT is LOW.]]></description>
    <bitRange>[7:5]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Undefined. Write as zero]]></description>
    <bitRange>[4:1]</bitRange>
  </field>
  <field>
    <name>MASTERENABLE</name>
    <description><![CDATA[Enables the controller:

0 --> Disables the controller
1 --> Enables the controller]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTRL</name>
    <description><![CDATA[Channel control data base pointer]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>BASEPTR</name>
    <description><![CDATA[Pointer to the base address of the primary data structure]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Undefined. Write as zero]]></description>
    <bitRange>[9:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ALTCTRL</name>
    <description><![CDATA[Channel alternate control data base pointer]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000200</resetValue>
<fields>
  <field>
    <name>BASEPTR</name>
    <description><![CDATA[Base address of the alternate data structure]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>WAITONREQ</name>
    <description><![CDATA[Channel wait on request status]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0xFFFF1EFF</resetValue>
<fields>
  <field>
    <name>CHNLSTATUS</name>
    <description><![CDATA[Channel wait on request status:

Bit [C] = 0 --> dma_waitonreq[C] is low
Bit [C] = 1 --> dma_waitonreq[C] is high]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SOFTREQ</name>
    <description><![CDATA[Channel software request]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Set the appropriate bit to generate a software DMA request on the corresponding DMA channel

Bit [C] = 0 --> Does not creare a DMA request for channel C
Bit [C] = 1 --> Creates a DMA request for channel C

Writing to a bit where a DMA channel is not implemented does not create a DMA request for that channel]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SETBURST</name>
    <description><![CDATA[Channel useburst set]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Returns the useburst status, or disables dma_sreq[C] from generating DMA requests. Read as:

Bit [C] = 0 --> DMA channel C responds to requests that it receives on dma_req[C] or dma_sreq[C]. The controller performs 2R, or single, bus transfers.

Bit [C] = --> 1 DMA channel C does not respond to requests that it receives on dma_sreq[C]. The controller only responds to dma_req[C] requests and performs 2R transfers.

Write as:
Bit [C] = 0 --> No effect. Use the CLEARBURST Register to set bit [C] to 0.
Bit [C] = 1 --> Disables dma_sreq[C] from generating DMA requests. The controller performs 2R transfers.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLEARBURST</name>
    <description><![CDATA[Channel useburst clear]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Set the appropriate bit to enable dma_sreq[] to generate requests. Write as:

