zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Bit [C] = 0 --> No effect. Use the SETBURST Register to disable dma_sreq[] from generating requests.

Bit [C] = 1 --> Enables dma_sreq[C] to generate DMA requests.

Writing to a bit where a DMA channel is not implemented has no effect.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SETREQMASK</name>
    <description><![CDATA[Channel request mask set]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Returns the request mask status of dma_req[] and dma_sreq[], or disables the corresponding channel from generating DMA requests. Read as:

Bit [C] = 0 --> External requests are enabled for channel C.
Bit [C] = 1 --> External requests are disabled for channel C.

Write as:
Bit [C] = 0 --> No effect. Use the chnl_req_mask_clr Register to enable DMA requests.
Bit [C] = 1 --> Disables dma_req[C] and dma_sreq[C] from generating DMA requests.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLEARREQMASK</name>
    <description><![CDATA[Channel request mask clear]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Set the appropriate bit to enable DMA request for the channel corresponding to dma_req[] and dma_sreq[]. Write as:

Bit [C] = 0 --> Use the SETREQMASK Register to disable dma_req[] and dma_sreq[] from generating requests
Bit [C] = 1 --> Enables dma_req[C] or dma_sreq[C] to generate DMA requests.

Writing to a bit where a DMA channel is not implemented has no effect.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SETCHANNELEN</name>
    <description><![CDATA[Channel enable set]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Returns the enable status of the channels, or enables the corresponding channels. Read as:

Bit [C] = 0 --> Channel C is disabled.
Bit [C] = 1 --> Channel C is enabled.

Write as:
Bit [C] = 0 --> No effect. Use the CLEARCHANNELEN Register to disable a channel
Bit [C] = 1 --> Enables channel C

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLEARCHANNELEN</name>
    <description><![CDATA[Channel enable clear]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Set the appropriate bit to disable the corresponding DMA channel. Write as:

Bit [C] = 0 --> No effect. Use the SETCHANNELEN Register to enable DMA channels.
Bit [C] = 1 --> Disables channel C.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SETCHNLPRIALT</name>
    <description><![CDATA[Channel primary-alternate set]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Returns the channel control data structure status, or selects the alternate data structure for the corresponding DMA channel. Read as:

Bit [C] = 0 --> DMA channel C is using the primary data structure.
Bit [C] = 1 --> DMA channel C is using the alternate data structure.

Write as:
Bit [C] = 0 --> No effect. Use the CLEARCHNLPRIALT Register to disable a channel
Bit [C] = 1 --> Selects the alternate data structure for channel C.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLEARCHNLPRIALT</name>
    <description><![CDATA[Channel primary-alternate clear]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Set the appropriate bit to select the primary data structure for the corresponding DMA channel.

Write as:
Bit [C] = 0 --> No effect. Use the SETCHNLPRIALT Register to select the alternate data structure.
Bit [C] = 1 --> Selects the primary data structure for channel C.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SETCHNLPRIORITY</name>
    <description><![CDATA[Channel priority set]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Returns the channel priority mask status, or sets the channel priority to high. Read as:

Bit [C] = 0 --> DMA channel C is using the default priority level.
Bit [C] = 1 --> DMA channel C is using a high priority level.

Write as:
Bit [C] = 0 --> No effect. Use the CLEARCHNLPRIORITY Register to set channel C to the default priority level.
Bit [C] = 1 --> Channel C uses the high priority level.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CLEARCHNLPRIORITY</name>
    <description><![CDATA[Channel priority clear]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Set the appropriate bit to select the default priority level for the specified DMA channel.

Write as:
Bit [C] = 0 --> No effect. Use the SETCHNLPRIORITY Register to set channel C to the high priority level.
Bit [C] = 1 --> Channel C uses the default priority level.

Writing to a bit where a DMA channel is not implemented has no effect]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ERROR</name>
    <description><![CDATA[Bus error clear]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Undefined. Write as zero]]></description>
    <bitRange>[31:1]</bitRange>
  </field>
  <field>
    <name>STATUS</name>
    <description><![CDATA[Returns the status of dma_err, or sets the signal LOW.

