zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
Read as:
0 --> dma_err is LOW
1 --> dma_err is HIGH

Write as:
0 --> No effect, status of dma_err is unchanged.
1 --> Sets dma_err LOW.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>REQDONE</name>
    <description><![CDATA[Channel request done]]></description>
    <addressOffset>0x00000504</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Reflects the dma_done status for the given channel. It's a sticky done bit. Unless cleared by writing '1', it holds the value of  '1'.

Read as:
Bit [C] = 0 --> Request is not completed for the channel C
Bit [C] = 1 --> Request is completed for the channel C

Writing a 1 to individual bits would clear the corresponding “dmareqdone” bit.

Write as:
Bit [C] = 0 --> No effect.
Bit [C] = 1 --> dmareqdone[C] bit is cleared  and is set to '0'.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DONEMASK</name>
    <description><![CDATA[Channel request done mask]]></description>
    <addressOffset>0x00000520</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CHNLS</name>
    <description><![CDATA[Controls the propagation of "dma_done" and "dma_active" signals to the peripherals. Specifically used for software channels.

Read as:
Bit [C] = 0 --> "dma_done" and "dma_active" signals are not blocked from reaching to the peripherals.
Also,  dma_done of channel [C] is blocked from contributing to generation of combined dma_done (“dma_done_sft”) coming out of DMA wrapper.

Bit [C] = 1 --> "dma_done" and "dma_active" signals are blocked from reaching to the peripherals.
Also,  dma_done of channel [C] is not blocked from contributing to generation of combined dma_done (“dma_done_sft”) coming out of DMA wrapper.

Write as:
Bit [C] = 0 --> Allows "dma_done" and "dma_active" signals to propagate to the peripherals.
Also, this disables dma_done of channel [C] from contributing to generation of combined dma_done (“dma_done_sft”) coming out of DMA wrapper.

Bit [C] = 1 --> Blocks "dma_done" and "dma_active" signals to propagate to the peripherals.
Also, this enables dma_done of channel [C] to contribute to generation of combined dma_done (“dma_done_sft”) coming out of DMA wrapper.]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PID4</name>
    <description><![CDATA[Peripheral identification 4]]></description>
    <addressOffset>0x00000FD0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000004</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>BLOCKCOUNT</name>
    <description><![CDATA[The number of 4KB address blocks you require, to access the registers, expressed in powers of 2.
These bits read back as 0x0.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>JEP106C</name>
    <description><![CDATA[The JEP106 continuation code value represents how many 0x7F continuation characters occur in the manufacturer’s identity code.
These bits read back as 0x4.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PID0</name>
    <description><![CDATA[Peripheral identification 0]]></description>
    <addressOffset>0x00000FE0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000030</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PARTNUMBER0</name>
    <description><![CDATA[These bits read back as 0x30]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PID1</name>
    <description><![CDATA[Peripheral identification 1]]></description>
    <addressOffset>0x00000FE4</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000B2</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>JEP106CODE3TO0</name>
    <description><![CDATA[JEP106 identity code [3:0]. These bits read back as 0xB because ARM is the designer of the peripheral.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>PARTNUMBER1</name>
    <description><![CDATA[These bits read back as 0x2.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PID2</name>
    <description><![CDATA[Peripheral identification 2]]></description>
    <addressOffset>0x00000FE8</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>REVISION</name>
    <description><![CDATA[The revision status of the controller. For revision r0p0, these bits read back as 0x0.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>JEDEC</name>
    <description><![CDATA[This indicates that the controller uses a manufacturer’s identity code that was allocated by JEDEC according to JEP106. These bits always read back as 0x1.]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>JEP106CODE6TO4</name>
    <description><![CDATA[JEP106 identity code [6:4]. These bits read back as 0x3 because ARM is the designer of this peripheral.]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PID3</name>
    <description><![CDATA[Peripheral identification 3]]></description>
    <addressOffset>0x00000FEC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved for future use. Reads are undefined.]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>MODNUMBER</name>
    <description><![CDATA[The customer must update this field if they modify the RTL of the controller. ARM set this to 0x0.]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PRIMECELLID0</name>
    <description><![CDATA[Primecell Identification 0]]></description>
    <addressOffset>0x00000FF0</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000D</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ID0</name>
    <description><![CDATA[These bits read back as 0x0D.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PRIMECELLID1</name>
    <description><![CDATA[Primecell Identification 1]]></description>
    <addressOffset>0x00000FF4</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000F0</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ID1</name>
    <description><![CDATA[These bits read back as 0xF0.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PRIMECELLID2</name>
    <description><![CDATA[Primecell Identification 2]]></description>
    <addressOffset>0x00000FF8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000005</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ID2</name>
    <description><![CDATA[These bits read back as 0x05]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PRIMECELLID3</name>
    <description><![CDATA[Primecell Identification 3]]></description>
    <addressOffset>0x00000FFC</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000B1</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Undefined]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>ID3</name>
    <description><![CDATA[These bits read back as 0xB1]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
