zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>I2S</name>
<description><![CDATA[I2S Protocol ]]></description>
<baseAddress>0x40021000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>AIFWCLKSRC</name>
    <description><![CDATA[WCLK Source Selection]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>WCLK_INV</name>
    <description><![CDATA[Inverts WCLK source (pad or internal) when set.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>WCLK_SRC</name>
    <description><![CDATA[Selects the one and only WCLK source for AIF, which should be the same as the BCLK source (the BCLK source is selected externally).
]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFDMACFG</name>
    <description><![CDATA[DMA Buffer Size Configuration]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>END_FRAME_IDX</name>
    <description><![CDATA[Writing a non-zero value to this register enables and initializes AIF. Note that before doing so, all other configuration must have been done, and AIFINPTR/AIFOUTPTR must have been loaded. Writing a non-zero value to this register enables and initializes AIF. Note that before doing so, all other configuration must have been done, and AIFINPTR/AIFOUTPTR must have been loaded.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFDIRCFG</name>
    <description><![CDATA[Pin Direction]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:10]</bitRange>
  </field>
  <field>
    <name>AD2_DIR</name>
    <description><![CDATA[Configures the AD2 audio data pin usage
11 - Reserved
]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>AD1_DIR</name>
    <description><![CDATA[Configures the AD1 audio data pin usage:
11 - Reserved
]]></description>
    <bitRange>[5:4]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>AD0_DIR</name>
    <description><![CDATA[Configures the AD0 audio data pin usage
11 - Reserved
]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFFMTCFG</name>
    <description><![CDATA[Serial Interface Format Configuration]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000170</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DATA_DELAY</name>
    <description><![CDATA[The number of BCLK periods between the positive WCLK edge and MSB of the first word in a phase:
0 - LJF format
1 - I2S and DSP format
2-255 - RJF format
Note: When 0, MSB of the next word will be output in the idle period between LSB of the previous word and the start of the next word. Otherwise logical 0 will be output until the data delay has expired.
]]></description>
    <bitRange>[15:8]</bitRange>
  </field>
  <field>
    <name>MEM_LEN_24</name>
    <description><![CDATA[The size of each word stored to or loaded from memory: 0 - 16-bit (one 16 bit access per sample)1 - 24-bit (one 8 bit and one 16 bit locked access per sample)]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>SMPL_EDGE</name>
    <description><![CDATA[On the serial audio interface, data (and wclk) is sampled and clocked out on opposite edges of BCLK.


]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>DUAL_PHASE</name>
    <description><![CDATA[Selects dual- or single-phase format. When set, dual-phase format is selected.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>WORD_LEN</name>
    <description><![CDATA[Number of bits per word (8-24):In single-phase format, this is the exact number of bits per word. In dual-phase format, this is the maximum number of bits per word.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFWMSK0</name>
    <description><![CDATA[Word Selection Bit Mask for Pin x (x is 0, 1 or 2)]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>MSK</name>
    <description><![CDATA[Bit-mask indicating valid channels in a frame on ADx.
In single-phase mode, each bit represents one channel, starting with LSB for the first word in the frame. A frame can contain up to 8 channels.  Channels that are not included in the mask will not be sampled and stored in memory, and clocked out as '0'.
In dual-phase mode, only the two LSBs are considered. For a stereo configuration, set both bits. For a mono configuration, set bit 0 only. In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated when clocked out.
If all bits are zero, no input words will be stored to memory, and the output data lines will be constant '0'. This can be utilized when PWM debug output is desired without any actively used output pins.
]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFWMSK1</name>
    <description><![CDATA[Word Selection Bit Mask for Pin x (x is 0, 1 or 2)]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>MSK</name>
    <description><![CDATA[Bit-mask indicating valid channels in a frame on ADx.
In single-phase mode, each bit represents one channel, starting with LSB for the first word in the frame. A frame can contain up to 8 channels.  Channels that are not included in the mask will not be sampled and stored in memory, and clocked out as '0'.
In dual-phase mode, only the two LSBs are considered. For a stereo configuration, set both bits. For a mono configuration, set bit 0 only. In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated when clocked out.
If all bits are zero, no input words will be stored to memory, and the output data lines will be constant '0'. This can be utilized when PWM debug output is desired without any actively used output pins.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFWMSK2</name>
    <description><![CDATA[Word Selection Bit Mask for Pin x (x is 0, 1 or 2)]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>MSK</name>
    <description><![CDATA[Bit-mask indicating valid channels in a frame on ADx.
In single-phase mode, each bit represents one channel, starting with LSB for the first word in the frame. A frame can contain up to 8 channels.  Channels that are not included in the mask will not be sampled and stored in memory, and clocked out as '0'.
In dual-phase mode, only the two LSBs are considered. For a stereo configuration, set both bits. For a mono configuration, set bit 0 only. In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated when clocked out.
If all bits are zero, no input words will be stored to memory, and the output data lines will be constant '0'. This can be utilized when PWM debug output is desired without any actively used output pins.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFPWMVAL</name>
    <description><![CDATA[PWM Debug Value]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>VAL</name>
    <description><![CDATA[The value written to this register determines the width of the active high PWM pulse (pwm_debug), which starts together with MSB of the first output word in a DMA buffer:
0 - Constant low
1-65534 - Width of the pulse (number of BCLK cycles).
65535 - Constant high
Note: The PWM pulse is also constant high when the configured width equals or exceeds the PWM period (i.e. the duration of a DMA buffer).
Note: At least one output pin must be configured for the PWM function to be operational.
Note: This value should preferably be written when starting on a new block, after the aif_dma_in_irq interrupt has occurred, or after aif_dma_out_irq + a delay corresponding to 3 samples. If written when a new PWM pulse begins, the length of the pulse is undetermined (and possible equal to neither the current nor the previous PWM value).
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFINPTRNEXT</name>
    <description><![CDATA[DMA Input Buffer Next Pointer]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PTR</name>
    <description><![CDATA[Pointer to the first byte in the next DMA input buffer.
The read value equals the last written value until the currently used DMA input buffer is completed, and then becomes NULL when the last written value is transferred to the DMA controller to start on the next buffer. This event is signalized by aif_dma_in_irq.
At startup, the value should be written once before and once after configuring the DMA buffer size in AIFDMACFG.
The next pointer must be written to AIFINPTR while the DMA function uses the previously written pointer. If not written in time, AIFERR.PTR_ERR will be raised and all input pins will be disabled.
Note the following limitations:
•	Address space wrapping is not supported (i.e. address(last sample) must be higher than address(first sample).
•	A DMA block cannot be aligned with the end of the address space (i.e. a block cannot contain the address 0xFFFF)
]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFINPTR</name>
    <description><![CDATA[DMA Input Buffer Current Pointer]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PTR</name>
    <description><![CDATA[Value of the DMA input buffer pointer currently used by the DMA controller (incremented by 1 (byte) or 2 (word) for each AHB access).]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFOUTPTRNEXT</name>
    <description><![CDATA[DMA Output Buffer Next Pointer]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PTR</name>
    <description><![CDATA[Pointer to the first byte in the next DMA output buffer.
The read value equals the last written value until the currently used DMA output buffer is completed, and then becomes NULL when the last written value is transferred to the DMA controller to start on the next buffer. This event is signalized by aif_dma_out_irq.
At startup, the value should be written once before and once after configuring the DMA buffer size in AIFDMACFG. At this time, the first two samples will be fetched from memory.
The next pointer must be written to AIFOUTPTR while the DMA function uses the previously written pointer. If not written in time, AIFERR.PTR_ERR will be raised and all output pins will be disabled.
Note the following limitations:
•	Address space wrapping is not supported (i.e. address(last sample) must be higher than address(first sample).
•	A DMA block cannot be aligned with the end of the address space (i.e. a block cannot contain the address 0xFFFF)
]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AIFOUTPTR</name>
    <description><![CDATA[DMA Output Buffer Current Pointer]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>PTR</name>
    <description><![CDATA[Value of the DMA output buffer pointer currently used by the DMA controller (incremented by 1 (byte) or 2 (word) for each AHB access).]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPCTRL</name>
    <description><![CDATA[Samplestamp Generator Control Register]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>OUT_READY</name>
    <description><![CDATA[Low until the output pins are ready to be started by the samplestamp generator. When started (i.e. STMPOUTTRIG equals the WCLK counter) the bit goes back low.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>IN_READY</name>
    <description><![CDATA[Low until the input pins are ready to be started by the samplestamp generator. When started (i.e. STMPINTRIG equals the WCLK counter) the bit goes back low.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>STMP_EN</name>
    <description><![CDATA[Enables the samplestamp generator. The samplestamp generator should only be enabled after it has been properly configured.
When cleared, all samplestamp generator counters and capture values are cleared.
]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPXCNTC0</name>
    <description><![CDATA[Captured XOSC Counter Value, Capture Channel 0]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_XCNT_CAPT0</name>
    <description><![CDATA[The value of the samplestamp XOSC counter last time samplestamp_req(0) was pulsed. This number corresponds to the number of 24 MHz clock cycles since the last positive edge of the selected WCLK.
The value is cleared when STMPCTRL.STMP_EN is 0.
Note: Due to buffering and synchronization, WCLK is delayed by a small number of clk_bclk periods and clk periods.
Note: When calculating the fractional part of the sample stamp, STMPXPER may be less than STMPXCNTC0.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPXPER</name>
    <description><![CDATA[XOSC Period Value]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_XPER</name>
    <description><![CDATA[The number of 24 MHz clock cycles in the previous WCLK period (i.e. the next value of the XOSC counter at the positive WCLK edge, had it not been reset to 0).
The value is cleared when STMPCTRL.STMP_EN is 0.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPWCNTC0</name>
    <description><![CDATA[Captured WCLK Counter Value, Capture Channel 0]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_WCNT_CAPT0</name>
    <description><![CDATA[The value of the samplestamp WCLK counter last time samplestamp_req(0) was pulsed. This number corresponds to the number of positive WCLK edges since the samplestamp generator was enabled (not taking modification through STMPWADD/STMPWSET into account).
The value is cleared when STMPCTRL.STMP_EN is 0.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPWPER</name>
    <description><![CDATA[WCLK Counter Period Value]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_WPER</name>
    <description><![CDATA[Modulo value for the WCLK counter. This number should correspond to the size of the sample buffer used by the system (i.e. the index of the last sample plus 1).]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPINTRIG</name>
    <description><![CDATA[WCLK Counter Trigger Value for Input Pins]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>IN_START_WCNT</name>
    <description><![CDATA[Compare value used to start the incoming audio streams.
IN_START_WCNT shall equal the WCLK counter value during the WCLK period in which the first input word(s) are sampled and stored to memory (i.e. the sample at the start of the very first DMA input buffer).
The value of this register takes effect when the following conditions are met:
- One or more pins are configured as inputs in AIFDIRCFG.
- AIFDMACFG has been configured for the correct buffer size, and 32 clk_bclk cycles or more have passed afterwards.
Note: To avoid false triggers, IN_START_WCNT should be set higher than STMP_WPER.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPOUTTRIG</name>
    <description><![CDATA[WCLK Counter Trigger Value for Output Pins]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>OUT_START_WCNT</name>
    <description><![CDATA[Compare value used to start the outgoing audio streams.
OUT_START_WCNT shall equal the WCLK counter value during the WCLK period in which the first output word(s) read from memory are clocked out (i.e. the sample at the start of the very first DMA output buffer).
The value of this register takes effect when the following conditions are met:
- One or more pins are configured as outputs in AIFDIRCFG.
- AIFDMACFG has been configured for the correct buffer size, and 32 clk_bclk cycles or more have passed afterwards.
- 2 samples have been preloaded from memory (examine the AIFDOUTPTR register if necessary). Note: The memory read access is only performed when required, i.e. channels 0/1 must be selected in AIFWMSKx.
Note: To avoid false triggers, OUT_START_WCNT should be set higher than STMP_WPER.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPWSET</name>
    <description><![CDATA[WCLK Counter Set Operation]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_WCNT_SET</name>
    <description><![CDATA[WCLK counter modification: Set the running WCLK counter equal to the written value. ]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPWADD</name>
    <description><![CDATA[WCLK Counter Add Operation]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_WCNT_ADD</name>
    <description><![CDATA[WCLK counter modification: Add the written value to the running WCLK counter. If a positive edge of WCLK occurs at the same time as the operation, this will be taken into account.
This operation is typically used to adjust the WCLK counter after receiving the first WASP beacon.
To add a negative value, write "STMP_WPER - value".
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPXPERMIN</name>
    <description><![CDATA[Minimum value of STMPXPER]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000FFFF</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_XPER_MIN</name>
    <description><![CDATA[Each time STMPXPER is updated, the value is also loaded into this register, provided that the value is smaller than the current value of STMPXPERMIN.
When written, the register is reset to 65535, regardless of the value written.
The minimum value can be used to detect extra WCLK pulses (the STMPXPERMIN value will be significantly smaller than STMPXPER).
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPWCNT</name>
    <description><![CDATA[Current value of WCNT]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_WCNT_CURR</name>
    <description><![CDATA[Current value of the WCLK counter]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
