zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>STMPXCNT</name>
    <description><![CDATA[Current value of XCNT]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_XCNT_CURR</name>
    <description><![CDATA[Current value of the XOSC counter, latched when reading STMPWCNT.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPXCNTC1</name>
    <description><![CDATA[Captured XOSC Counter Value, Capture Channel 1]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_XCNT_CAPT1</name>
    <description><![CDATA[The value of the samplestamp XOSC counter last time samplestamp_req(1) was pulsed. This number corresponds to the number of 24 MHz clock cycles since the last positive edge of the selected WCLK.
The value is cleared when STMPCTRL.STMP_EN is 0.
Note: Due to buffering and synchronization, WCLK is delayed by a small number of clk_bclk periods and clk periods.
Note: When calculating the fractional part of the sample stamp, STMPXPER may be less than STMPXCNTC1.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>STMPWCNTC1</name>
    <description><![CDATA[Captured WCLK Counter Value, Capture Channel 1]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>STMP_WCNT_CAPT1</name>
    <description><![CDATA[The value of the samplestamp WCLK counter last time samplestamp_req(1) was pulsed. This number corresponds to the number of positive WCLK edges since the samplestamp generator was enabled (not taking modification through STMPWADD/STMPWSET into account).
The value is cleared when STMPCTRL.STMP_EN is 0.
]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQ_MASK</name>
    <description><![CDATA[I2S Masked interrupt status register]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_IN</name>
    <description><![CDATA[This bit masks the level interrupt  of AIF_DMA_IN]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_OUT</name>
    <description><![CDATA[This bit masks the level interrupt  of AIF_DMA_OUT]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>WCLK_TIMEOUT</name>
    <description><![CDATA[This bit masks the level interrupt  of WCLK_TIMEOUT]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>BUS_ERR</name>
    <description><![CDATA[This bit masks the level interrupt  of BUS_ERR]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>WCLK_ERR</name>
    <description><![CDATA[This bit masks the level interrupt  of WCLK_ERR]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PTR_ERR</name>
    <description><![CDATA[This bit masks the level interrupt  of PTR_ERR]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQ_READ</name>
    <description><![CDATA[I2S Raw Interrupt status register]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_IN</name>
    <description><![CDATA[This bit reads the level interrupt  of AIF_DMA_IN (auto cleared when input pointer is updated - AIFINPTR)]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_OUT</name>
    <description><![CDATA[This bit reads the level interrupt  of AIF_DMA_OUT (auto cleared when out pointer is updated – AIFOUTPTR)]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>WCLK_TIMEOUT</name>
    <description><![CDATA[Set when the sample stamp generator does not detect a positive WCLK edge for 65535 clk periods. This signalizes that the internal/external BCLK/WCLK generator source has been disabled.
The bit is sticky and may only be cleared by software (by writing '0' to it).
]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>BUS_ERR</name>
    <description><![CDATA[Set when a DMA operation is not completed in time (i.e. audio output buffer underflow, or audio input buffer overflow).
This error requires a complete restart since word synchronization has been lost. The bit is sticky and may only be cleared by software (by writing '0' to it).
]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>WCLK_ERR</name>
    <description><![CDATA[Set when:
•	An unexpected WCLK edge occurs during the data delay period of a phase.  Note unexpected WCLK edges during the word and idle periods of the phase are not detected.
•	In dual-phase mode, when two WCLK edges are less than 4 BCLK cycles apart.
•	In single-phase mode, when a WCLK pulse occurs before the last channel.
This error requires a complete restart since word synchronization has been lost. The bit is sticky and may only be cleared by software (by writing '0' to it).]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PTR_ERR</name>
    <description><![CDATA[Set when AIFINPTR or AIFOUTPTR has not been loaded with the next block address in time.
This error requires a complete restart since word synchronization has been lost. The bit is sticky and may only be cleared by software (by writing '0' to it).
]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQ_SET</name>
    <description><![CDATA[I2S interrupt set register]]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_IN</name>
    <description><![CDATA[A write '1' to this bit sets the level interrupt of AIF_DMA_IN_IRQ (unless a auto clear criteria was given at the same time, in which the set will be ignored)]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_OUT</name>
    <description><![CDATA[A write '1' to this bit sets the level interrupt of AIF_DMA_OUT_IRQ (unless a auto clear criteria was given at the same time, in which the set will be ignored)]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>WCLK_TIMEOUT</name>
    <description><![CDATA[A write '1' to this bit sets the level interrupt of WCLK_TIMEOUT ]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>BUS_ERR</name>
    <description><![CDATA[A write '1' to this bit sets the level interrupt of BUS_ERR]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>WCLK_ERR</name>
    <description><![CDATA[A write '1' to this bit sets the level interrupt of WCLK_ERR]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PTR_ERR</name>
    <description><![CDATA[A write '1' to this bit sets the level interrupt of PTR_ERR ]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IRQ_CLR</name>
    <description><![CDATA[I2S interrupt clear register]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved - unused]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_IN</name>
    <description><![CDATA[A write '1' to this bit clears the level interrupt of AIF_DMA_IN_IRQ (unless a set criteria was given at the same time in which the clear will be ignored)]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>AIF_DMA_OUT</name>
    <description><![CDATA[A write '1' to this bit clears the level interrupt of AIF_DMA_OUT_IRQ (unless a set criteria was given at the same time in which the clear will be ignored)]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>WCLK_TIMEOUT</name>
    <description><![CDATA[A write '1' to this bit clears the level interrupt of WCLK_TIMEOUT (unless a set criteria was given at the same time in which the clear will be ignored)]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>BUS_ERR</name>
    <description><![CDATA[A write '1' to this bit clears the level interrupt of BUS_ERR (unless a set criteria was given at the same time in which the clear will be ignored)]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>WCLK_ERR</name>
    <description><![CDATA[A write '1' to this bit clears the level interrupt of WCLK_ERR (unless a set criteria was given at the same time in which the clear will be ignored)]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>PTR_ERR</name>
    <description><![CDATA[A write '1' to this bit clears the level interrupt of PTR_ERR (unless a set criteria was given at the same time in which the clear will be ignored)]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
