zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
<name>GPRAM</name>
<description><![CDATA[General Purpose RAM]]></description>
<baseAddress>0x11000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00002000</size>
<usage>registers</usage>
</addressBlock>
<registers>
</registers>
</peripheral>
<peripheral>
<name>SRAM</name>
<description><![CDATA[General Purpose RAM]]></description>
<baseAddress>0x20000000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00004000</size>
<usage>registers</usage>
</addressBlock>
<registers>
</registers>
</peripheral>
<peripheral>
<name>UART0</name>
<description><![CDATA[UART Component]]></description>
<baseAddress>0x40001000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DR</name>
    <description><![CDATA[UART Data]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:12]</bitRange>
  </field>
  <field>
    <name>OE</name>
    <description><![CDATA[UART Overrrun Error]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>BE</name>
    <description><![CDATA[UART Break Error]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>PE</name>
    <description><![CDATA[UART Parity Error]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>FE</name>
    <description><![CDATA[UART  Framing Error]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[Data transmitted or received]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RSR</name>
    <description><![CDATA[UART Status Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>OE</name>
    <description><![CDATA[UART Overrrun Error]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>BE</name>
    <description><![CDATA[UART Break Error]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PE</name>
    <description><![CDATA[UART Parity Error]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>FE</name>
    <description><![CDATA[UART  Framing Error]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ECR</name>
    <description><![CDATA[UART Error Clear Register]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[UART Clear Error]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESERVED0</name>
    <description><![CDATA[UART Reserved area]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FR</name>
    <description><![CDATA[UART Flag]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>TXFE</name>
    <description><![CDATA[UART Transmit FIFO Empty]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RXFF</name>
    <description><![CDATA[UART Receive FIFO Full]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TXFF</name>
    <description><![CDATA[UART Transmit FIFO Full]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RXFE</name>
    <description><![CDATA[UART Receive FIFO Empty]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>BUSY</name>
    <description><![CDATA[UART Busy]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[2:1]</bitRange>
  </field>
  <field>
    <name>CTS</name>
    <description><![CDATA[Clear To Send]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IBRD</name>
    <description><![CDATA[UART integer part of the baud rate divisor value]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>DIVINT</name>
    <description><![CDATA[The integer baud rate divisor. These bits are cleared to 0 on reset.]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FBRD</name>
    <description><![CDATA[UART Fractional Baud-Rate Divisor]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>DIVFRAC</name>
    <description><![CDATA[Fractional Baud-Rate Divisor]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>LCRH</name>
    <description><![CDATA[UART Line Control]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SPS</name>
    <description><![CDATA[UART Stick Parity Select]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>WLEN</name>
    <description><![CDATA[UART Word Length]]></description>
    <bitRange>[6:5]</bitRange>
  </field>
  <field>
    <name>FEN</name>
    <description><![CDATA[UART Enable FIFOs]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>STP2</name>
    <description><![CDATA[UART Two Stop Bits Select]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>EPS</name>
    <description><![CDATA[UART Even Parity Select]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>PEN</name>
    <description><![CDATA[UART Parity Enable]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>BRK</name>
    <description><![CDATA[UART Send Break]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CTL</name>
    <description><![CDATA[UART Control]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000300</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:16]</bitRange>
  </field>
  <field>
    <name>CTSEN</name>
    <description><![CDATA[Enable Clear To Send]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>RTSEN</name>
    <description><![CDATA[Enable Request To Send]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved - do not modify, read 0]]></description>
    <bitRange>[13:12]</bitRange>
  </field>
  <field>
    <name>RTS</name>
    <description><![CDATA[Request to Send]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved - do not modify, read 0]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>RXE</name>
    <description><![CDATA[UART Receive Enable]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TXE</name>
    <description><![CDATA[UART Transmit Enable]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>LBE</name>
    <description><![CDATA[UART Loop Back Enable]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved - do not modify, read 0]]></description>
    <bitRange>[6:1]</bitRange>
  </field>
  <field>
    <name>UARTEN</name>
    <description><![CDATA[UART Enable]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IFLS</name>
    <description><![CDATA[UART Interrupt FIFO Level Select]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000012</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:6]</bitRange>
  </field>
  <field>
    <name>RXSEL</name>
    <description><![CDATA[Receive interrupt FIFO level select]]></description>
    <bitRange>[5:3]</bitRange>
  </field>
  <field>
    <name>TXSEL</name>
    <description><![CDATA[Transmit interrupt FIFO level select]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IMSC</name>
    <description><![CDATA[UART Interrupt mask set/clear register]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved, read as zero, do not modify]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>OEIM</name>
    <description><![CDATA[Overrun error interrupt mask. A read returns the current mask for the UARTOEINTR interrupt. On a write of 1, the mask of the UARTOEINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>BEIM</name>
    <description><![CDATA[Break error interrupt mask. A read returns the current mask for the UARTBEINTR interrupt. On a write of 1, the mask of the UARTBEINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PEIM</name>
    <description><![CDATA[Parity error interrupt mask. A read returns the current mask for the UARTPEINTR interrupt. On a write of 1, the mask of the UARTPEINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FEIM</name>
    <description><![CDATA[Framing error interrupt mask. A read returns the current mask for the UARTFEINTR interrupt. On a write of 1, the mask of the UARTFEINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RTIM</name>
    <description><![CDATA[Receive timeout interrupt mask. A read returns the current mask for the UARTRTINTR interrupt. On a write of 1, the mask of the UARTRTINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TXIM</name>
    <description><![CDATA[Transmit interrupt mask. A read returns the current mask for the UARTTXINTR interrupt. On a write of 1, the mask of the UARTTXINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RXIM</name>
    <description><![CDATA[Receive interrupt mask. A read returns the current mask for the UARTRXINTR interrupt. On a write of 1, the mask of the UARTRXINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved, read as zero, do not modify]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CTSMIM</name>
    <description><![CDATA[nUARTCTS modem interrupt mask. A read returns the current mask for the UARTCTSINTR interrupt. On a write of 1, the mask of the UARTCTSINTR interrupt is set. A write of 0 clears the mask.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved, read as zero, do not modify]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RIS</name>
    <description><![CDATA[UART RIS Register is the raw interrupt status register.]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>OERIS</name>
    <description><![CDATA[Overrun error interrupt status. Returns the raw interrupt state of the UARTOEINTR interrupt.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>BERIS</name>
    <description><![CDATA[Break error interrupt status. Returns the raw interrupt state of the UARTBEINTR interrupt.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PERIS</name>
    <description><![CDATA[Parity error interrupt status. Returns the raw interrupt state of the UARTPEINTR interrupt.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FERIS</name>
    <description><![CDATA[Framing error interrupt status. Returns the raw interrupt state of the UARTFEINTR interrupt.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RTRIS</name>
    <description><![CDATA[Receive timeout interrupt status. Returns the raw interrupt state of the UARTRTINTR interrupt (In this case the raw interrupt cannot be set unless the mask is set, this is because the mask acts as an enable for power saving. That is, the same status can be read from UARTMIS and UARTRIS for the receive timeout interrupt.)]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TXRIS</name>
    <description><![CDATA[Transmit interrupt status. Returns the raw interrupt state of the UARTTXINTR interrupt.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RXRIS</name>
    <description><![CDATA[Receive interrupt status. Returns the raw interrupt state of the UARTRXINTR interrupt.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved, read as zero]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CTSRMIS</name>
    <description><![CDATA[nUARTCTS modem interrupt status. Returns the raw interrupt state of the UARTCTSINTR interrupt.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved, read as zero]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>MIS</name>
    <description><![CDATA[UART MIS Register is the masked interrupt status register]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved, read as zero, do not modify]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>OEMIS</name>
    <description><![CDATA[Overrun error masked interrupt status. Returns the masked interrupt state of the UARTOEINTR interrupt.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>BEMIS</name>
    <description><![CDATA[Break error masked interrupt status. Returns the masked interrupt state of the UARTBEINTR interrupt.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PEMIS</name>
    <description><![CDATA[Parity error masked interrupt status. Returns the masked interrupt state of the UARTPEINTR interrupt.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FEMIS</name>
    <description><![CDATA[Framing error masked interrupt status. Returns the masked interrupt state of the UARTFEINTR interrupt]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RTMIS</name>
    <description><![CDATA[Receive timeout masked interrupt status. Returns the masked interrupt state of the UARTRTINTR interrupt.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TXMIS</name>
    <description><![CDATA[Transmit masked interrupt status. Returns the masked interrupt state of the UARTTXINTR interrupt.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RXMIS</name>
    <description><![CDATA[Receive masked interrupt status. Returns the masked interrupt state of the UARTRXINTR interrupt.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved, read as zero]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CTSMMIS</name>
    <description><![CDATA[nUARTCTS modem masked interrupt status. Returns the masked interrupt state of the UARTCTSINTR interrupt.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved, read as zero]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ICR</name>
    <description><![CDATA[UART Interrupt Clear]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved, read as zero, do not modify]]></description>
    <bitRange>[31:11]</bitRange>
  </field>
  <field>
    <name>OEIC</name>
    <description><![CDATA[Overrun error interrupt clear. Clears the UARTOEINTR interrupt.]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>BEIC</name>
    <description><![CDATA[Break error interrupt clear. Clears the UARTBEINTR interrupt.]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>PEIC</name>
    <description><![CDATA[Parity error interrupt clear. Clears the UARTPEINTR interrupt.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>FEIC</name>
    <description><![CDATA[Framing error interrupt clear. Clears the UARTFEINTR interrupt.]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>RTIC</name>
    <description><![CDATA[Receive timeout interrupt clear. Clears the UARTRTINTR interrupt.]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TXIC</name>
    <description><![CDATA[Transmit interrupt clear. Clears the UARTTXINTR interrupt.]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>RXIC</name>
    <description><![CDATA[Receive interrupt clear. Clears the UARTRXINTR interrupt.]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved, write 0]]></description>
    <bitRange>[3:2]</bitRange>
  </field>
  <field>
    <name>CTSMIC</name>
    <description><![CDATA[nUARTCTS modem interrupt clear. Clears the UARTCTSINTR interrupt.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved, write 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DMACTL</name>
    <description><![CDATA[UART DMACR Register is the DMA control register.]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read as zero, do not modify.]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>DMAONERR</name>
    <description><![CDATA[DMA on error. If this bit is set to 1, the DMA receive request outputs, UARTRXDMASREQ or UARTRXDMABREQ, are disabled when the UART error interrupt is asserted.]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TXDMAE</name>
    <description><![CDATA[Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>RXDMAE</name>
    <description><![CDATA[Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is enabled.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESERVED1</name>
    <description><![CDATA[UART Reserved area]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TCR</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ITIP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>ITOP</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000088</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>TDR</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x0000008C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0unknown</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RESERVED2</name>
    <description><![CDATA[UART Reserved area]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
