zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>RESERVED3</name>
    <description><![CDATA[UART Reserved area for
future ID expansion]]></description>
    <addressOffset>0x00000FD0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID0</name>
    <description><![CDATA[Peripheral Identification Register]]></description>
    <addressOffset>0x00000FE0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000011</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>PARTNUMBER0</name>
    <description><![CDATA[Identifies the peripheral]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID1</name>
    <description><![CDATA[Peripheral Identification Register]]></description>
    <addressOffset>0x00000FE4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000010</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>DESIGNER0</name>
    <description><![CDATA[Identifies the designer (ARM)]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>PARTNUMBER1</name>
    <description><![CDATA[Identifies the peripheral]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID2</name>
    <description><![CDATA[Peripheral Identification Register]]></description>
    <addressOffset>0x00000FE8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000034</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>REVISION</name>
    <description><![CDATA[UART revision]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>DESIGNER1</name>
    <description><![CDATA[Identifies the designer (ARM)]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PERIPHID3</name>
    <description><![CDATA[Peripheral Identification Register]]></description>
    <addressOffset>0x00000FEC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Reserved, read undefined must read as zeros]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>CONFIGURATION</name>
    <description><![CDATA[The configuration option of the UART.]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID0</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000FF0</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID1</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000FF4</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000F0</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID2</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000FF8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000005</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PCELLID3</name>
    <description><![CDATA[]]></description>
    <addressOffset>0x00000FFC</addressOffset>
    <access>read-write</access>
    <resetValue>0x000000B1</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>EVENT</name>
<description><![CDATA[Event Fabric Component Definition]]></description>
<baseAddress>0x40083000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>CM3SEL0</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 0 - AON Edge detect]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000004</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL1</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 1 - I2C]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000009</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL2</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 2 – RF_cpe_1]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000001E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL3</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 3 – SPIS event combo]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000038</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL4</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 4 - AON RTC]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL5</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 5 - UART0 combined]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000024</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL6</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 6 - UART1 combined]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000025</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL7</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 7 - SSI0 combined]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000022</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL8</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 8 - SSI1 combined]]></description>
    <addressOffset>0x00000020</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000023</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL9</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 9 - RF CPE 0]]></description>
    <addressOffset>0x00000024</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000001B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL10</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 10 - RF HW]]></description>
    <addressOffset>0x00000028</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000001A</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL11</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 11 - RF Command Ack]]></description>
    <addressOffset>0x0000002C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000019</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL12</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 12 - I2S Interrupt]]></description>
    <addressOffset>0x00000030</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000008</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL13</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 13 – unassigned]]></description>
    <addressOffset>0x00000034</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL14</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 14 – WDT]]></description>
    <addressOffset>0x00000038</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000018</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL15</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 15 - GPT0A]]></description>
    <addressOffset>0x0000003C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000010</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL16</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 16 - GPT0B]]></description>
    <addressOffset>0x00000040</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000011</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL17</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 17 - GPT1A]]></description>
    <addressOffset>0x00000044</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000012</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL18</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 18 - GPT1B]]></description>
    <addressOffset>0x00000048</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000013</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL19</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 19 - GPT2A]]></description>
    <addressOffset>0x0000004C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000C</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL20</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 20 - GPT2B]]></description>
    <addressOffset>0x00000050</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL21</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 21 - GPT 3A]]></description>
    <addressOffset>0x00000054</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL22</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 22 - GPT 3B]]></description>
    <addressOffset>0x00000058</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL23</name>
    <description><![CDATA[Output selection for CM3 interrupt 23 - Crypto result available]]></description>
    <addressOffset>0x0000005C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000005D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL24</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 24 - DMA software combined]]></description>
    <addressOffset>0x00000060</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000027</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL25</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 25 - DMA Error]]></description>
    <addressOffset>0x00000064</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000026</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL26</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 26 - Flash]]></description>
    <addressOffset>0x00000068</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000015</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL27</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 27 - SW0_EV]]></description>
    <addressOffset>0x0000006C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000064</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL28</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 28 – AUX MCU_EVENT_COMB]]></description>
    <addressOffset>0x00000070</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000000B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL29</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 29 - AON programmable 0]]></description>
    <addressOffset>0x00000074</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL30</name>
    <description><![CDATA[Output selection for CM3 interrupt 30 - Programmable interrupt - default:  no event '0']]></description>
    <addressOffset>0x00000078</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL31</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 31 – AUX_MCU_TRIGGER[1]]]></description>
    <addressOffset>0x0000007C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000006A</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
