zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>CM3SEL32</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 32 – AUX_MCU_TRIGGER[10]]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000073</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CM3SEL33</name>
    <description><![CDATA[Non-Programmable Output selection for CM3 interrupt 33 – TRNG interrupt]]></description>
    <addressOffset>0x00000084</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000068</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL0</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 0]]></description>
    <addressOffset>0x00000100</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL1</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 1]]></description>
    <addressOffset>0x00000104</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL2</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 2]]></description>
    <addressOffset>0x00000108</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL3</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 3]]></description>
    <addressOffset>0x0000010C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000040</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL4</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 4]]></description>
    <addressOffset>0x00000110</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000041</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL5</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 5]]></description>
    <addressOffset>0x00000114</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000042</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL6</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 6]]></description>
    <addressOffset>0x00000118</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000043</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL7</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 7]]></description>
    <addressOffset>0x0000011C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000044</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL8</name>
    <description><![CDATA[Non-Programmable Output selection for RF_CORE event 8]]></description>
    <addressOffset>0x00000120</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000077</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>RFCORESEL9</name>
    <description><![CDATA[Programmable Output selection for RF_CORE event 9]]></description>
    <addressOffset>0x00000124</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000002</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT0SEL0</name>
    <description><![CDATA[Programmable Output selection for GPT0]]></description>
    <addressOffset>0x00000200</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000055</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT0SEL1</name>
    <description><![CDATA[Programmable Output selection for GPT0]]></description>
    <addressOffset>0x00000204</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000056</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT1SEL0</name>
    <description><![CDATA[Programmable Output selection for GPT1]]></description>
    <addressOffset>0x00000300</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000057</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT1SEL1</name>
    <description><![CDATA[Programmable Output selection for GPT1]]></description>
    <addressOffset>0x00000304</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000058</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT2SEL0</name>
    <description><![CDATA[Programmable Output selection for GPT2]]></description>
    <addressOffset>0x00000400</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000059</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT2SEL1</name>
    <description><![CDATA[Programmable Output selection for GPT2]]></description>
    <addressOffset>0x00000404</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000005A</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH0_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 0 sreq]]></description>
    <addressOffset>0x00000500</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH0_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 0 req]]></description>
    <addressOffset>0x00000504</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH1_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 1 req – uart0_rx_sreq]]></description>
    <addressOffset>0x00000508</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000031</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH1_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 1 req – uart0_rx_req]]></description>
    <addressOffset>0x0000050C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000030</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH2_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 2 sreq – uart0_tx_sreq]]></description>
    <addressOffset>0x00000510</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000033</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH2_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 2 req – uart0_tx_req]]></description>
    <addressOffset>0x00000514</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000032</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH3_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 3 sreq – ssi0_rx_sreq]]></description>
    <addressOffset>0x00000518</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000029</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH3_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 3 req – ssi0_rx_req]]></description>
    <addressOffset>0x0000051C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000028</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH4_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 4 sreq – ssi0_tx_sreq]]></description>
    <addressOffset>0x00000520</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000002B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH4_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 4 req – ssi0_tx_req]]></description>
    <addressOffset>0x00000524</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000002A</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH5_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 5 sreq – spis_rx_sreq]]></description>
    <addressOffset>0x00000528</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003A</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH5_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 5 req – spis_rx_req]]></description>
    <addressOffset>0x0000052C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000039</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH6_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 6 sreq – spis_tx_sreq]]></description>
    <addressOffset>0x00000530</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003C</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH6_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 6 req – spis_tx_req]]></description>
    <addressOffset>0x00000534</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000003B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH7_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 7 sreq – AUX_ADC]]></description>
    <addressOffset>0x00000538</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000070</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH7_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 7 req – AUX_ADC]]></description>
    <addressOffset>0x0000053C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000070</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH8_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 8 sreq – AUX_SM]]></description>
    <addressOffset>0x00000540</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000006F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH8_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 8 req – AUX_SM]]></description>
    <addressOffset>0x00000544</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000006F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH9_S</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 9 sreq – GPT 0A]]></description>
    <addressOffset>0x00000548</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000004D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH9_B</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 9 req – GPT 0A]]></description>
    <addressOffset>0x0000054C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000045</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH10_S</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 10 sreq – GPT 0B]]></description>
    <addressOffset>0x00000550</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000004E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH10_B</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 10 req – GPT 0B]]></description>
    <addressOffset>0x00000554</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000046</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH11_S</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 11 sreq – GPT 1A]]></description>
    <addressOffset>0x00000558</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000004F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
