zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>UDMASELCH11_B</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 11 req – GPT 1A]]></description>
    <addressOffset>0x0000055C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000047</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH12_S</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 12 sreq – GPT 1B]]></description>
    <addressOffset>0x00000560</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000050</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH12_B</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 12 req – GPT 1B]]></description>
    <addressOffset>0x00000564</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000048</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH13_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 13 sreq – AON Programmable]]></description>
    <addressOffset>0x00000568</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH13_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 13 req – AON Programmable]]></description>
    <addressOffset>0x0000056C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000003</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH14_S</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 14 sreq – DMA Programmable]]></description>
    <addressOffset>0x00000570</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH14_B</name>
    <description><![CDATA[Programmable Output selection for uDMA  Ch 14 req – DMA Programmable ]]></description>
    <addressOffset>0x00000574</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000001</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[ selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH15_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 15 sreq – AN RTC ]]></description>
    <addressOffset>0x00000578</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH15_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 15 req -  ON RTC]]></description>
    <addressOffset>0x0000057C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000007</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH16_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 16 sreq -  ssi1 Rx sreq]]></description>
    <addressOffset>0x00000580</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000002D</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH16_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 16 req -  ssi1 RX req]]></description>
    <addressOffset>0x00000584</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000002C</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH17_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 17 sreq – ssi1 TX Sreq]]></description>
    <addressOffset>0x00000588</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000002F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH17_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 17 req – ssi1 TX req]]></description>
    <addressOffset>0x0000058C</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000002E</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH018_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 18 sreq – reserved for software ]]></description>
    <addressOffset>0x00000590</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH18_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 18 req – reserved for software]]></description>
    <addressOffset>0x00000594</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH19_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 19 sreq – reserved for software]]></description>
    <addressOffset>0x00000598</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH19_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 19 req – reserved for SW]]></description>
    <addressOffset>0x0000059C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH20_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 20 sreq – reserved for SW]]></description>
    <addressOffset>0x000005A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH20_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 20 req – reserved for SW]]></description>
    <addressOffset>0x000005A4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH21_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 21 sreq – SW_EVENT0]]></description>
    <addressOffset>0x000005A8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000064</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH21_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 21 req – SW_EVENT0]]></description>
    <addressOffset>0x000005AC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000064</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH22_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 22 sreq – SW_EVENT 1]]></description>
    <addressOffset>0x000005B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000065</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH22_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 22 req – SW_EVENT1]]></description>
    <addressOffset>0x000005B4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000065</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH23_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 23 sreq – SW_EVENT2]]></description>
    <addressOffset>0x000005B8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000066</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH23_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 23 req – SW_EVENT2]]></description>
    <addressOffset>0x000005BC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000066</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH24_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 24 sreq – SW_EVENT3]]></description>
    <addressOffset>0x000005C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000067</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH24_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 24 req – SW_EVENT3]]></description>
    <addressOffset>0x000005C4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000067</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH25_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 25 sreq - not mapped to hw]]></description>
    <addressOffset>0x000005C8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH25_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 25 req - not mapped to hw]]></description>
    <addressOffset>0x000005CC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH26_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 26 req - not mapped to hw]]></description>
    <addressOffset>0x000005D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH26_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 26 req - not mapped to hw]]></description>
    <addressOffset>0x000005D4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH27_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 27 req - not mapped to hw]]></description>
    <addressOffset>0x000005D8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH27_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 27 req - not mapped to hw]]></description>
    <addressOffset>0x000005DC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH28_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 28 sreq  - NO HW]]></description>
    <addressOffset>0x000005E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH28_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 28 req  - NO HW]]></description>
    <addressOffset>0x000005E4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH29_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 29 sreq - NO HW]]></description>
    <addressOffset>0x000005E8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH29_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 29 req - NO HW]]></description>
    <addressOffset>0x000005EC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH30_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 30 sreq - NO HW]]></description>
    <addressOffset>0x000005F0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH30_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 30 req - NO HW]]></description>
    <addressOffset>0x000005F4</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>UDMASELCH31_S</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 31 sreq - NO HW]]></description>
    <addressOffset>0x000005F8</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
