zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>UDMASELCH31_B</name>
    <description><![CDATA[Non-Programmable Output selection for uDMA  Ch 31 req - NO HW ]]></description>
    <addressOffset>0x000005FC</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT3SEL0</name>
    <description><![CDATA[Programmable Output selection for GPT3]]></description>
    <addressOffset>0x00000600</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000005B</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>GPT3SEL1</name>
    <description><![CDATA[Programmable Output selection for GPT3]]></description>
    <addressOffset>0x00000604</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000005C</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>AUXSUB0</name>
    <description><![CDATA[Programmable Output selection for AUX subscriber]]></description>
    <addressOffset>0x00000700</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000010</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>NMISUB0</name>
    <description><![CDATA[Non-Programmable Output selection for NMI subscriber]]></description>
    <addressOffset>0x00000800</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000063</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read only selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>I2SSUB0</name>
    <description><![CDATA[Programmable Output selection for I2S subscriber]]></description>
    <addressOffset>0x00000900</addressOffset>
    <access>read-write</access>
    <resetValue>0x0000005F</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>FRZSUB0</name>
    <description><![CDATA[Programmable Output selection for FRZ subscriber]]></description>
    <addressOffset>0x00000A00</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000078</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:7]</bitRange>
  </field>
  <field>
    <name>SELVAL</name>
    <description><![CDATA[Read/write selection value]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>SW_EVENT</name>
    <description><![CDATA[Set or clear software events]]></description>
    <addressOffset>0x00000F00</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>SWEV3</name>
    <description><![CDATA[Writing '1' to this bit when the value is '0' triggers the Software 3 event. Hardware clears the bit once it is ready to trigger another event.]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>SWEV2</name>
    <description><![CDATA[Writing '1' to this bit when the value is '0' triggers the Software 2 event. Hardware clears the bit once it is ready to trigger another event.]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>SWEV1</name>
    <description><![CDATA[Writing '1' to this bit when the value is '0' triggers the Software 1 event. Hardware clears the bit once it is ready to trigger another event.]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Unused - Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>SWEV0</name>
    <description><![CDATA[Writing '1' to this bit when the value is '0' triggers the Software 0 event. Hardware clears the bit once it is ready to trigger another event.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>GPIO</name>
<description><![CDATA[GPIO Component]]></description>
<baseAddress>0x40022000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00000400</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>DAT3_0</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED3</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT3</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#3]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT2</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#2]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT1</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#1]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT0</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT7_4</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED7</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT7</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#7]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED6</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT6</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#6]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED5</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT5</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#5]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED4</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT4</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#4]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT11_8</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED11</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT11</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#11]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED10</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT10</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#10]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED9</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT9</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#9]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED8</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT8</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#8]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT15_12</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED15</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT15</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#15]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED14</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT14</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#14]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED13</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT13</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#13]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED12</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT12</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#12]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT19_16</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x00000010</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED19</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT19</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#19]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED18</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT18</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#18]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED17</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT17</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#17]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED16</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT16</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#16]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT23_20</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x00000014</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED23</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT23</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#23]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED22</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT22</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#22]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED21</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT21</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#21]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED20</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT20</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#20]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT27_24</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x00000018</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED27</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT27</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#27]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED26</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT26</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#26]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED25</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT25</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#25]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED24</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT24</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#24]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DAT31_28</name>
    <description><![CDATA[Unpacked Data register for GPIO(#M-#N)]]></description>
    <addressOffset>0x0000001C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED31</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[31:25]</bitRange>
  </field>
  <field>
    <name>DAT31</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#31]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>RESERVED30</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[23:17]</bitRange>
  </field>
  <field>
    <name>DAT30</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#30]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>RESERVED29</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[15:9]</bitRange>
  </field>
  <field>
    <name>DAT29</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#29]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>RESERVED28</name>
    <description><![CDATA[Reserved]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>DAT28</name>
    <description><![CDATA[Sets the state of the pin that is configured as GPIO#28]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATO31_0</name>
    <description><![CDATA[Data output for GPIO 0 to 31]]></description>
    <addressOffset>0x00000080</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DATO31</name>
    <description><![CDATA[Data output for GPIO 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>DATO30</name>
    <description><![CDATA[Data output for GPIO 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>DATO29</name>
    <description><![CDATA[Data output for GPIO 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>DATO28</name>
    <description><![CDATA[Data output for GPIO 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>DATO27</name>
    <description><![CDATA[Data output for GPIO 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>DATO26</name>
    <description><![CDATA[Data output for GPIO 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>DATO25</name>
    <description><![CDATA[Data output for GPIO 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>DATO24</name>
    <description><![CDATA[Data output for GPIO 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>DATO23</name>
    <description><![CDATA[Data output for GPIO 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>DATO22</name>
    <description><![CDATA[Data output for GPIO 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>DATO21</name>
    <description><![CDATA[Data output for GPIO 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>DATO20</name>
    <description><![CDATA[Data output for GPIO 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>DATO19</name>
    <description><![CDATA[Data output for GPIO 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>DATO18</name>
    <description><![CDATA[Data output for GPIO 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>DATO17</name>
    <description><![CDATA[Data output for GPIO 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>DATO16</name>
    <description><![CDATA[Data output for GPIO 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>DATO15</name>
    <description><![CDATA[Data output for GPIO 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>DATO14</name>
    <description><![CDATA[Data output for GPIO 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>DATO13</name>
    <description><![CDATA[Data output for GPIO 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>DATO12</name>
    <description><![CDATA[Data output for GPIO 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>DATO11</name>
    <description><![CDATA[Data output for GPIO 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>DATO10</name>
    <description><![CDATA[Data output for GPIO 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>DATO9</name>
    <description><![CDATA[Data output for GPIO 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>DATO8</name>
    <description><![CDATA[Data output for GPIO 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>DATO7</name>
    <description><![CDATA[Data output for GPIO 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DATO6</name>
    <description><![CDATA[Data output for GPIO 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>DATO5</name>
    <description><![CDATA[Data output for GPIO 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DATO4</name>
    <description><![CDATA[Data output for GPIO 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DATO3</name>
    <description><![CDATA[Data output for GPIO 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>DATO2</name>
    <description><![CDATA[Data output for GPIO 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DATO1</name>
    <description><![CDATA[Data output for GPIO 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATO0</name>
    <description><![CDATA[Data output for GPIO 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
