zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>DATOSET31_0</name>
    <description><![CDATA[Writing 1 to a bit position sets the corresponding bit in the DATO register]]></description>
    <addressOffset>0x00000090</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>SET31</name>
    <description><![CDATA[Set bit 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>SET30</name>
    <description><![CDATA[Set bit 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>SET29</name>
    <description><![CDATA[Set bit 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>SET28</name>
    <description><![CDATA[Set bit 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>SET27</name>
    <description><![CDATA[Set bit 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>SET26</name>
    <description><![CDATA[Set bit 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>SET25</name>
    <description><![CDATA[Set bit 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>SET24</name>
    <description><![CDATA[Set bit 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>SET23</name>
    <description><![CDATA[Set bit 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>SET22</name>
    <description><![CDATA[Set bit 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>SET21</name>
    <description><![CDATA[Set bit 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>SET20</name>
    <description><![CDATA[Set bit 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>SET19</name>
    <description><![CDATA[Set bit 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>SET18</name>
    <description><![CDATA[Set bit 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>SET17</name>
    <description><![CDATA[Set bit 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>SET16</name>
    <description><![CDATA[Set bit 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>SET15</name>
    <description><![CDATA[Set bit 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>SET14</name>
    <description><![CDATA[Set bit 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>SET13</name>
    <description><![CDATA[Set bit 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>SET12</name>
    <description><![CDATA[Set bit 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>SET11</name>
    <description><![CDATA[Set bit 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>SET10</name>
    <description><![CDATA[Set bit 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>SET9</name>
    <description><![CDATA[Set bit 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>SET8</name>
    <description><![CDATA[Set bit 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>SET7</name>
    <description><![CDATA[Set bit 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>SET6</name>
    <description><![CDATA[Set bit 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>SET5</name>
    <description><![CDATA[Set bit 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>SET4</name>
    <description><![CDATA[Set bit 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>SET3</name>
    <description><![CDATA[Set bit 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>SET2</name>
    <description><![CDATA[Set bit 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>SET1</name>
    <description><![CDATA[Set bit 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>SET0</name>
    <description><![CDATA[Set bit 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATOCLR31_0</name>
    <description><![CDATA[Writing 1 to a bit position clears the corresponding bit in the DATO register]]></description>
    <addressOffset>0x000000A0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>CLR31</name>
    <description><![CDATA[Clears bit 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>CLR30</name>
    <description><![CDATA[Clears bit 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>CLR29</name>
    <description><![CDATA[Clears bit 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>CLR28</name>
    <description><![CDATA[Clears bit 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>CLR27</name>
    <description><![CDATA[Clears bit 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>CLR26</name>
    <description><![CDATA[Clears bit 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>CLR25</name>
    <description><![CDATA[Clears bit 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>CLR24</name>
    <description><![CDATA[Clears bit 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>CLR23</name>
    <description><![CDATA[Clears bit 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>CLR22</name>
    <description><![CDATA[Clears bit 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>CLR21</name>
    <description><![CDATA[Clears bit 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>CLR20</name>
    <description><![CDATA[Clears bit 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>CLR19</name>
    <description><![CDATA[Clears bit 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>CLR18</name>
    <description><![CDATA[Clears bit 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>CLR17</name>
    <description><![CDATA[Clears bit 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>CLR16</name>
    <description><![CDATA[Clears bit 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>CLR15</name>
    <description><![CDATA[Clears bit 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>CLR14</name>
    <description><![CDATA[Clears bit 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>CLR13</name>
    <description><![CDATA[Clears bit 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>CLR12</name>
    <description><![CDATA[Clears bit 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>CLR11</name>
    <description><![CDATA[Clears bit 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>CLR10</name>
    <description><![CDATA[Clears bit 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>CLR9</name>
    <description><![CDATA[Clears bit 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>CLR8</name>
    <description><![CDATA[Clears bit 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>CLR7</name>
    <description><![CDATA[Clears bit 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>CLR6</name>
    <description><![CDATA[Clears bit 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>CLR5</name>
    <description><![CDATA[Clears bit 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>CLR4</name>
    <description><![CDATA[Clears bit 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>CLR3</name>
    <description><![CDATA[Clears bit 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>CLR2</name>
    <description><![CDATA[Clears bit 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>CLR1</name>
    <description><![CDATA[Clears bit 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>CLR0</name>
    <description><![CDATA[Clears bit 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATOTGL31_0</name>
    <description><![CDATA[Writing 1 to a bit position toggles the corresponding bit in the DATO register]]></description>
    <addressOffset>0x000000B0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>TGL31</name>
    <description><![CDATA[Toggles bit 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>TGL30</name>
    <description><![CDATA[Toggles bit 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>TGL29</name>
    <description><![CDATA[Toggles bit 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>TGL28</name>
    <description><![CDATA[Toggles bit 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>TGL27</name>
    <description><![CDATA[Toggles bit 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>TGL26</name>
    <description><![CDATA[Toggles bit 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>TGL25</name>
    <description><![CDATA[Toggles bit 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>TGL24</name>
    <description><![CDATA[Toggles bit 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>TGL23</name>
    <description><![CDATA[Toggles bit 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>TGL22</name>
    <description><![CDATA[Toggles bit 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>TGL21</name>
    <description><![CDATA[Toggles bit 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>TGL20</name>
    <description><![CDATA[Toggles bit 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>TGL19</name>
    <description><![CDATA[Toggles bit 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>TGL18</name>
    <description><![CDATA[Toggles bit 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>TGL17</name>
    <description><![CDATA[Toggles bit 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>TGL16</name>
    <description><![CDATA[Toggles bit 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>TGL15</name>
    <description><![CDATA[Toggles bit 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>TGL14</name>
    <description><![CDATA[Toggles bit 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>TGL13</name>
    <description><![CDATA[Toggles bit 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>TGL12</name>
    <description><![CDATA[Toggles bit 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>TGL11</name>
    <description><![CDATA[Toggles bit 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>TGL10</name>
    <description><![CDATA[Toggles bit 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>TGL9</name>
    <description><![CDATA[Toggles bit 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>TGL8</name>
    <description><![CDATA[Toggles bit 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>TGL7</name>
    <description><![CDATA[Toggles bit 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>TGL6</name>
    <description><![CDATA[Toggles bit 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>TGL5</name>
    <description><![CDATA[Toggles bit 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>TGL4</name>
    <description><![CDATA[Toggles bit 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>TGL3</name>
    <description><![CDATA[Toggles bit 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>TGL2</name>
    <description><![CDATA[Toggles bit 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>TGL1</name>
    <description><![CDATA[Toggles bit 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>TGL0</name>
    <description><![CDATA[Toggles bit 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATI31_0</name>
    <description><![CDATA[Data input from GPIO 0 to 31]]></description>
    <addressOffset>0x000000C0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DATI31</name>
    <description><![CDATA[Data input from GPIO 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>DATI30</name>
    <description><![CDATA[Data input from GPIO 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>DATI29</name>
    <description><![CDATA[Data input from GPIO 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>DATI28</name>
    <description><![CDATA[Data input from GPIO 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>DATI27</name>
    <description><![CDATA[Data input from GPIO 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>DATI26</name>
    <description><![CDATA[Data input from GPIO 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>DATI25</name>
    <description><![CDATA[Data input from GPIO 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>DATI24</name>
    <description><![CDATA[Data input from GPIO 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>DATI23</name>
    <description><![CDATA[Data input from GPIO 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>DATI22</name>
    <description><![CDATA[Data input from GPIO 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>DATI21</name>
    <description><![CDATA[Data input from GPIO 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>DATI20</name>
    <description><![CDATA[Data input from GPIO 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>DATI19</name>
    <description><![CDATA[Data input from GPIO 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>DATI18</name>
    <description><![CDATA[Data input from GPIO 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>DATI17</name>
    <description><![CDATA[Data input from GPIO 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>DATI16</name>
    <description><![CDATA[Data input from GPIO 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>DATI15</name>
    <description><![CDATA[Data input from GPIO 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>DATI14</name>
    <description><![CDATA[Data input from GPIO 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>DATI13</name>
    <description><![CDATA[Data input from GPIO 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>DATI12</name>
    <description><![CDATA[Data input from GPIO 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>DATI11</name>
    <description><![CDATA[Data input from GPIO 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>DATI10</name>
    <description><![CDATA[Data input from GPIO 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>DATI9</name>
    <description><![CDATA[Data input from GPIO 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>DATI8</name>
    <description><![CDATA[Data input from GPIO 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>DATI7</name>
    <description><![CDATA[Data input from GPIO 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DATI6</name>
    <description><![CDATA[Data input from GPIO 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>DATI5</name>
    <description><![CDATA[Data input from GPIO 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DATI4</name>
    <description><![CDATA[Data input from GPIO 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DATI3</name>
    <description><![CDATA[Data input from GPIO 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>DATI2</name>
    <description><![CDATA[Data input from GPIO 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DATI1</name>
    <description><![CDATA[Data input from GPIO 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATI0</name>
    <description><![CDATA[Data input from GPIO 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>DATOE31_0</name>
    <description><![CDATA[Data output enable for GPIO 0 to 31]]></description>
    <addressOffset>0x000000D0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>DATOE31</name>
    <description><![CDATA[Data output enable for GPIO 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>DATOE30</name>
    <description><![CDATA[Data output enable for GPIO 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>DATOE29</name>
    <description><![CDATA[Data output enable for GPIO 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>DATOE28</name>
    <description><![CDATA[Data output enable for GPIO 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>DATOE27</name>
    <description><![CDATA[Data output enable for GPIO 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>DATOE26</name>
    <description><![CDATA[Data output enable for GPIO 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>DATOE25</name>
    <description><![CDATA[Data output enable for GPIO 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>DATOE24</name>
    <description><![CDATA[Data output enable for GPIO 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>DATOE23</name>
    <description><![CDATA[Data output enable for GPIO 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>DATOE22</name>
    <description><![CDATA[Data output enable for GPIO 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>DATOE21</name>
    <description><![CDATA[Data output enable for GPIO 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>DATOE20</name>
    <description><![CDATA[Data output enable for GPIO 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>DATOE19</name>
    <description><![CDATA[Data output enable for GPIO 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>DATOE18</name>
    <description><![CDATA[Data output enable for GPIO 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>DATOE17</name>
    <description><![CDATA[Data output enable for GPIO 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>DATOE16</name>
    <description><![CDATA[Data output enable for GPIO 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>DATOE15</name>
    <description><![CDATA[Data output enable for GPIO 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>DATOE14</name>
    <description><![CDATA[Data output enable for GPIO 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>DATOE13</name>
    <description><![CDATA[Data output enable for GPIO 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>DATOE12</name>
    <description><![CDATA[Data output enable for GPIO 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>DATOE11</name>
    <description><![CDATA[Data output enable for GPIO 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>DATOE10</name>
    <description><![CDATA[Data output enable for GPIO 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>DATOE9</name>
    <description><![CDATA[Data output enable for GPIO 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>DATOE8</name>
    <description><![CDATA[Data output enable for GPIO 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>DATOE7</name>
    <description><![CDATA[Data output enable for GPIO 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>DATOE6</name>
    <description><![CDATA[Data output enable for GPIO 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>DATOE5</name>
    <description><![CDATA[Data output enable for GPIO 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>DATOE4</name>
    <description><![CDATA[Data output enable for GPIO 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>DATOE3</name>
    <description><![CDATA[Data output enable for GPIO 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>DATOE2</name>
    <description><![CDATA[Data output enable for GPIO 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>DATOE1</name>
    <description><![CDATA[Data output enable for GPIO 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>DATOE0</name>
    <description><![CDATA[Data output enable for GPIO 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
