zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>EVENT31_0</name>
    <description><![CDATA[Event register for GPIO 0 to 31. Read will display triggered events, write one will clear event.]]></description>
    <addressOffset>0x000000E0</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>EVENT31</name>
    <description><![CDATA[Event for GPIO 31]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>EVENT30</name>
    <description><![CDATA[Event for GPIO 30]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>EVENT29</name>
    <description><![CDATA[Event for GPIO 29]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>EVENT28</name>
    <description><![CDATA[Event for GPIO 28]]></description>
    <bitRange>[28:28]</bitRange>
  </field>
  <field>
    <name>EVENT27</name>
    <description><![CDATA[Event for GPIO 27]]></description>
    <bitRange>[27:27]</bitRange>
  </field>
  <field>
    <name>EVENT26</name>
    <description><![CDATA[Event for GPIO 26]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>EVENT25</name>
    <description><![CDATA[Event for GPIO 25]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>EVENT24</name>
    <description><![CDATA[Event for GPIO 24]]></description>
    <bitRange>[24:24]</bitRange>
  </field>
  <field>
    <name>EVENT23</name>
    <description><![CDATA[Event for GPIO 23]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>EVENT22</name>
    <description><![CDATA[Event for GPIO 22]]></description>
    <bitRange>[22:22]</bitRange>
  </field>
  <field>
    <name>EVENT21</name>
    <description><![CDATA[Event for GPIO 21]]></description>
    <bitRange>[21:21]</bitRange>
  </field>
  <field>
    <name>EVENT20</name>
    <description><![CDATA[Event for GPIO 20]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>EVENT19</name>
    <description><![CDATA[Event for GPIO 19]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>EVENT18</name>
    <description><![CDATA[Event for GPIO 18]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>EVENT17</name>
    <description><![CDATA[Event for GPIO 17]]></description>
    <bitRange>[17:17]</bitRange>
  </field>
  <field>
    <name>EVENT16</name>
    <description><![CDATA[Event for GPIO 16]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>EVENT15</name>
    <description><![CDATA[Event for GPIO 15]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>EVENT14</name>
    <description><![CDATA[Event for GPIO 14]]></description>
    <bitRange>[14:14]</bitRange>
  </field>
  <field>
    <name>EVENT13</name>
    <description><![CDATA[Event for GPIO 13]]></description>
    <bitRange>[13:13]</bitRange>
  </field>
  <field>
    <name>EVENT12</name>
    <description><![CDATA[Event for GPIO 12]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>EVENT11</name>
    <description><![CDATA[Event for GPIO 11]]></description>
    <bitRange>[11:11]</bitRange>
  </field>
  <field>
    <name>EVENT10</name>
    <description><![CDATA[Event for GPIO 10]]></description>
    <bitRange>[10:10]</bitRange>
  </field>
  <field>
    <name>EVENT9</name>
    <description><![CDATA[Event for GPIO 9]]></description>
    <bitRange>[9:9]</bitRange>
  </field>
  <field>
    <name>EVENT8</name>
    <description><![CDATA[Event for GPIO 8]]></description>
    <bitRange>[8:8]</bitRange>
  </field>
  <field>
    <name>EVENT7</name>
    <description><![CDATA[Event for GPIO 7]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>EVENT6</name>
    <description><![CDATA[Event for GPIO 6]]></description>
    <bitRange>[6:6]</bitRange>
  </field>
  <field>
    <name>EVENT5</name>
    <description><![CDATA[Event for GPIO 5]]></description>
    <bitRange>[5:5]</bitRange>
  </field>
  <field>
    <name>EVENT4</name>
    <description><![CDATA[Event for GPIO 4]]></description>
    <bitRange>[4:4]</bitRange>
  </field>
  <field>
    <name>EVENT3</name>
    <description><![CDATA[Event for GPIO 3]]></description>
    <bitRange>[3:3]</bitRange>
  </field>
  <field>
    <name>EVENT2</name>
    <description><![CDATA[Event for GPIO 2]]></description>
    <bitRange>[2:2]</bitRange>
  </field>
  <field>
    <name>EVENT1</name>
    <description><![CDATA[Event for GPIO 1]]></description>
    <bitRange>[1:1]</bitRange>
  </field>
  <field>
    <name>EVENT0</name>
    <description><![CDATA[Event for GPIO 0]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
</registers>
</peripheral>
<peripheral>
<name>IOC</name>
<description><![CDATA[IOC Component]]></description>
<baseAddress>0x40081000</baseAddress>
<addressBlock>
<offset>0</offset>
<size>0x00001000</size>
<usage>registers</usage>
</addressBlock>
<registers>
  <register>
    <name>IOCFG0</name>
    <description><![CDATA[Configuration of IO(#N)]]></description>
    <addressOffset>0x00000000</addressOffset>
    <access>read-write</access>
    <resetValue>0x00006000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOIH</name>
    <description><![CDATA[1: Input hysteresis enable]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IOIE</name>
    <description><![CDATA[0: Input disabled
1: Input enabled

Note: If IO is configured for AUX the enable will be ignored.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN</name>
    <description><![CDATA[(N/A for IO configured for AON peripheral signals and AUX)
0d: No wake-up
10: Input with shutdown wake-up on low:
       (WUEN_pad=1, A_pad=0, GZ=1)
11: Input with shutdown wake-up on high
         (WUEN_pad=1, A_pad=1, GZ=1)

Note: Enable wake-up from sleep if IE=”1” only (see [13])
]]></description>
    <bitRange>[28:27]</bitRange>
  </field>
  <field>
    <name>IOMODE</name>
    <description><![CDATA[IO Mode (N/A for IO configured for AON periph. signals and AUX)
000: Normal input/output:
         (Y_int=Y_pad, A_pad=A_int)
001: Inverted input/ouput:
         (Y_int=not(Y_pad), A_pad=not(A_int))
010: Reserved. Undefined behavior.
011: Reserved. Undefined behavior.
100: Open Drain, Normal input/output
       (GZ_pad = A_int or GZ_int, A_PAD = 0 , Y_int = Y_pad)
101: Open Drain, inverted input / output
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 0, Y_int = (not Y_pad))
110: Open Source, Normal input/outut
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 1, Y_int =  Y_pad )
111: Open Source: Inverted input/output
         (GZ_pad = A_int or GZ_int, A_PAD = 1, Y_int = (not Y_pad))
]]></description>
    <bitRange>[26:24]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>TDI</name>
    <description><![CDATA[1:IO enabled as JTAG TDI
It must always be one IO that is set as TDI.
If another IO is set as TDI, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>TDO</name>
    <description><![CDATA[1:IO enabled as JTAG TDO
It must always be one IO that is set as TDO.
If another IO is set as TDO, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>EDINT</name>
    <description><![CDATA[1: Enable interrupt generation for this IO (Only effective if edge detection is enabled) 0: No interrupt generation ]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>EDET</name>
    <description><![CDATA[Enable generation of edge detection events on this IO.

00: No edge detection
01: Negative edge detection
10: Positive edge detection
11: Positive and negative edge detection
]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>PULLEN</name>
    <description><![CDATA[11: No pull
10: Pull up
01: Pull down
00: Reserved]]></description>
    <bitRange>[14:13]</bitRange>
  </field>
  <field>
    <name>IOSC</name>
    <description><![CDATA[1: Enables slew control on output ]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>IOCC</name>
    <description><![CDATA[Selects IO current in combination with IOSTR
00: 2mA   (Sets IO_EC,IO_HC= 00)
01: 4mA   (Sets IO_EC,IO_HC= 01)
10: 4 or 8mA   (8 mA if master is double drive strength)  Setting sets IO_EC,IO_HC= 11)
11: up to 16 mA (for double bonded pads (Sets IO_EC,IO_HC=11 on all connected pads)
]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>IOSTR</name>
    <description><![CDATA[Select drive strength IO
00: Automatic drive strength (2/4/8mA@VDDS)
01: Minimum drive strength (2/4/8mA@3.3V)
10: Medium drive strength (2/4/8mA@2.5V)
11: Maximum drive strength (2/4/8mA@1.8V)
]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>PORTID</name>
    <description><![CDATA[PORTID=0: Selects GPIO (#N)
  >0 Selects peripheral port # PORTID.
  Except PORTID=8 which is reserved for AUX.

Ports with PORTID from 1 to PORTCNT_EXT are reserved for external peripherals in the AON domain.
]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOCFG1</name>
    <description><![CDATA[Configuration of IO(#N)]]></description>
    <addressOffset>0x00000004</addressOffset>
    <access>read-write</access>
    <resetValue>0x00006000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOIH</name>
    <description><![CDATA[1: Input hysteresis enable]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IOIE</name>
    <description><![CDATA[0: Input disabled
1: Input enabled

Note: If IO is configured for AUX the enable will be ignored.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN</name>
    <description><![CDATA[(N/A for IO configured for AON peripheral signals and AUX)
0d: No wake-up
10: Input with shutdown wake-up on low:
       (WUEN_pad=1, A_pad=0, GZ=1)
11: Input with shutdown wake-up on high
         (WUEN_pad=1, A_pad=1, GZ=1)

Note: Enable wake-up from sleep if IE=”1” only (see [13])
]]></description>
    <bitRange>[28:27]</bitRange>
  </field>
  <field>
    <name>IOMODE</name>
    <description><![CDATA[IO Mode (N/A for IO configured for AON periph. signals and AUX)
000: Normal input/output:
         (Y_int=Y_pad, A_pad=A_int)
001: Inverted input/ouput:
         (Y_int=not(Y_pad), A_pad=not(A_int))
010: Reserved. Undefined behavior.
011: Reserved. Undefined behavior.
100: Open Drain, Normal input/output
       (GZ_pad = A_int or GZ_int, A_PAD = 0 , Y_int = Y_pad)
101: Open Drain, inverted input / output
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 0, Y_int = (not Y_pad))
110: Open Source, Normal input/outut
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 1, Y_int =  Y_pad )
111: Open Source: Inverted input/output
         (GZ_pad = A_int or GZ_int, A_PAD = 1, Y_int = (not Y_pad))
]]></description>
    <bitRange>[26:24]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>TDI</name>
    <description><![CDATA[1:IO enabled as JTAG TDI
It must always be one IO that is set as TDI.
If another IO is set as TDI, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>TDO</name>
    <description><![CDATA[1:IO enabled as JTAG TDO
It must always be one IO that is set as TDO.
If another IO is set as TDO, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>EDINT</name>
    <description><![CDATA[1: Enable interrupt generation for this IO (Only effective if edge detection is enabled) 0: No interrupt generation ]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>EDET</name>
    <description><![CDATA[Enable generation of edge detection events on this IO.

00: No edge detection
01: Negative edge detection
10: Positive edge detection
11: Positive and negative edge detection
]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>PULLEN</name>
    <description><![CDATA[11: No pull
10: Pull up
01: Pull down
00: Reserved]]></description>
    <bitRange>[14:13]</bitRange>
  </field>
  <field>
    <name>IOSC</name>
    <description><![CDATA[1: Enables slew control on output ]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>IOCC</name>
    <description><![CDATA[Selects IO current in combination with IOSTR
00: 2mA   (Sets IO_EC,IO_HC= 00)
01: 4mA   (Sets IO_EC,IO_HC= 01)
10: 4 or 8mA   (8 mA if master is double drive strength)  Setting sets IO_EC,IO_HC= 11)
11: up to 16 mA (for double bonded pads (Sets IO_EC,IO_HC=11 on all connected pads)
]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>IOSTR</name>
    <description><![CDATA[Select drive strength IO
00: Automatic drive strength (2/4/8mA@VDDS)
01: Minimum drive strength (2/4/8mA@3.3V)
10: Medium drive strength (2/4/8mA@2.5V)
11: Maximum drive strength (2/4/8mA@1.8V)
]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>PORTID</name>
    <description><![CDATA[PORTID=0: Selects GPIO (#N)
  >0 Selects peripheral port # PORTID.
  Except PORTID=8 which is reserved for AUX.

Ports with PORTID from 1 to PORTCNT_EXT are reserved for external peripherals in the AON domain.
]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOCFG2</name>
    <description><![CDATA[Configuration of IO(#N)]]></description>
    <addressOffset>0x00000008</addressOffset>
    <access>read-write</access>
    <resetValue>0x00006000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOIH</name>
    <description><![CDATA[1: Input hysteresis enable]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IOIE</name>
    <description><![CDATA[0: Input disabled
1: Input enabled

Note: If IO is configured for AUX the enable will be ignored.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN</name>
    <description><![CDATA[(N/A for IO configured for AON peripheral signals and AUX)
0d: No wake-up
10: Input with shutdown wake-up on low:
       (WUEN_pad=1, A_pad=0, GZ=1)
11: Input with shutdown wake-up on high
         (WUEN_pad=1, A_pad=1, GZ=1)

Note: Enable wake-up from sleep if IE=”1” only (see [13])
]]></description>
    <bitRange>[28:27]</bitRange>
  </field>
  <field>
    <name>IOMODE</name>
    <description><![CDATA[IO Mode (N/A for IO configured for AON periph. signals and AUX)
000: Normal input/output:
         (Y_int=Y_pad, A_pad=A_int)
001: Inverted input/ouput:
         (Y_int=not(Y_pad), A_pad=not(A_int))
010: Reserved. Undefined behavior.
011: Reserved. Undefined behavior.
100: Open Drain, Normal input/output
       (GZ_pad = A_int or GZ_int, A_PAD = 0 , Y_int = Y_pad)
101: Open Drain, inverted input / output
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 0, Y_int = (not Y_pad))
110: Open Source, Normal input/outut
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 1, Y_int =  Y_pad )
111: Open Source: Inverted input/output
         (GZ_pad = A_int or GZ_int, A_PAD = 1, Y_int = (not Y_pad))
]]></description>
    <bitRange>[26:24]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>TDI</name>
    <description><![CDATA[1:IO enabled as JTAG TDI
It must always be one IO that is set as TDI.
If another IO is set as TDI, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>TDO</name>
    <description><![CDATA[1:IO enabled as JTAG TDO
It must always be one IO that is set as TDO.
If another IO is set as TDO, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>EDINT</name>
    <description><![CDATA[1: Enable interrupt generation for this IO (Only effective if edge detection is enabled) 0: No interrupt generation ]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>EDET</name>
    <description><![CDATA[Enable generation of edge detection events on this IO.

00: No edge detection
01: Negative edge detection
10: Positive edge detection
11: Positive and negative edge detection
]]></description>
    <bitRange>[17:16]</bitRange>
  </field>
  <field>
    <name>RESERVED0</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>PULLEN</name>
    <description><![CDATA[11: No pull
10: Pull up
01: Pull down
00: Reserved]]></description>
    <bitRange>[14:13]</bitRange>
  </field>
  <field>
    <name>IOSC</name>
    <description><![CDATA[1: Enables slew control on output ]]></description>
    <bitRange>[12:12]</bitRange>
  </field>
  <field>
    <name>IOCC</name>
    <description><![CDATA[Selects IO current in combination with IOSTR
00: 2mA   (Sets IO_EC,IO_HC= 00)
01: 4mA   (Sets IO_EC,IO_HC= 01)
10: 4 or 8mA   (8 mA if master is double drive strength)  Setting sets IO_EC,IO_HC= 11)
11: up to 16 mA (for double bonded pads (Sets IO_EC,IO_HC=11 on all connected pads)
]]></description>
    <bitRange>[11:10]</bitRange>
  </field>
  <field>
    <name>IOSTR</name>
    <description><![CDATA[Select drive strength IO
00: Automatic drive strength (2/4/8mA@VDDS)
01: Minimum drive strength (2/4/8mA@3.3V)
10: Medium drive strength (2/4/8mA@2.5V)
11: Maximum drive strength (2/4/8mA@1.8V)
]]></description>
    <bitRange>[9:8]</bitRange>
  </field>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[7:6]</bitRange>
  </field>
  <field>
    <name>PORTID</name>
    <description><![CDATA[PORTID=0: Selects GPIO (#N)
  >0 Selects peripheral port # PORTID.
  Except PORTID=8 which is reserved for AUX.

Ports with PORTID from 1 to PORTCNT_EXT are reserved for external peripherals in the AON domain.
]]></description>
    <bitRange>[5:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>IOCFG3</name>
    <description><![CDATA[Configuration of IO(#N)]]></description>
    <addressOffset>0x0000000C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00006000</resetValue>
<fields>
  <field>
    <name>RESERVED2</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOIH</name>
    <description><![CDATA[1: Input hysteresis enable]]></description>
    <bitRange>[30:30]</bitRange>
  </field>
  <field>
    <name>IOIE</name>
    <description><![CDATA[0: Input disabled
1: Input enabled

Note: If IO is configured for AUX the enable will be ignored.]]></description>
    <bitRange>[29:29]</bitRange>
  </field>
  <field>
    <name>SHUTDOWN</name>
    <description><![CDATA[(N/A for IO configured for AON peripheral signals and AUX)
0d: No wake-up
10: Input with shutdown wake-up on low:
       (WUEN_pad=1, A_pad=0, GZ=1)
11: Input with shutdown wake-up on high
         (WUEN_pad=1, A_pad=1, GZ=1)

Note: Enable wake-up from sleep if IE=”1” only (see [13])
]]></description>
    <bitRange>[28:27]</bitRange>
  </field>
  <field>
    <name>IOMODE</name>
    <description><![CDATA[IO Mode (N/A for IO configured for AON periph. signals and AUX)
000: Normal input/output:
         (Y_int=Y_pad, A_pad=A_int)
001: Inverted input/ouput:
         (Y_int=not(Y_pad), A_pad=not(A_int))
010: Reserved. Undefined behavior.
011: Reserved. Undefined behavior.
100: Open Drain, Normal input/output
       (GZ_pad = A_int or GZ_int, A_PAD = 0 , Y_int = Y_pad)
101: Open Drain, inverted input / output
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 0, Y_int = (not Y_pad))
110: Open Source, Normal input/outut
         (GZ_pad = (not A_int) or GZ_int, A_PAD = 1, Y_int =  Y_pad )
111: Open Source: Inverted input/output
         (GZ_pad = A_int or GZ_int, A_PAD = 1, Y_int = (not Y_pad))
]]></description>
    <bitRange>[26:24]</bitRange>
  </field>
  <field>
    <name>RESERVED1</name>
    <description><![CDATA[Byte fill]]></description>
    <bitRange>[23:21]</bitRange>
  </field>
  <field>
    <name>TDI</name>
    <description><![CDATA[1:IO enabled as JTAG TDI
It must always be one IO that is set as TDI.
If another IO is set as TDI, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[20:20]</bitRange>
  </field>
  <field>
    <name>TDO</name>
    <description><![CDATA[1:IO enabled as JTAG TDO
It must always be one IO that is set as TDO.
If another IO is set as TDO, this bit will be cleared. Will not be cleared if writing '0' to it.]]></description>
    <bitRange>[19:19]</bitRange>
  </field>
  <field>
    <name>EDINT</name>
    <description><![CDATA[1: Enable interrupt generation for this IO (Only effective if edge detection is enabled) 0: No interrupt generation ]]></description>
    <bitRange>[18:18]</bitRange>
  </field>
  <field>
    <name>EDET</name>
    <description><![CDATA[Enable generation of edge detection events on this IO.

