zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
  <register>
    <name>PADCFG3_0</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x00000200</addressOffset>
    <access>read-write</access>
    <resetValue>0x8F90917F</resetValue>
<fields>
  <field>
    <name>MASTER3</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID3</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #3]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER2</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID2</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #2]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER1</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID1</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #1]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER0</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID0</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #0]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG7_4</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x00000204</addressOffset>
    <access>read-write</access>
    <resetValue>0x8B8C8D8E</resetValue>
<fields>
  <field>
    <name>MASTER7</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID7</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #7]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER6</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID6</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #6]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER5</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID5</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #5]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER4</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID4</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #4]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG11_8</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x00000208</addressOffset>
    <access>read-write</access>
    <resetValue>0x8788898A</resetValue>
<fields>
  <field>
    <name>MASTER11</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID11</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #11]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER10</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID10</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #10]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER9</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID9</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #9]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER8</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID8</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #8]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG15_12</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x0000020C</addressOffset>
    <access>read-write</access>
    <resetValue>0x83848586</resetValue>
<fields>
  <field>
    <name>MASTER15</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID15</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #15]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER14</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID14</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #14]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER13</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID13</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #13]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER12</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID12</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #12]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG19_16</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x00000210</addressOffset>
    <access>read-write</access>
    <resetValue>0x9E808182</resetValue>
<fields>
  <field>
    <name>MASTER19</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID19</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #19]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER18</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID18</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #18]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER17</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID17</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #17]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER16</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID16</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #16]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG23_20</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x00000214</addressOffset>
    <access>read-write</access>
    <resetValue>0x9A9B9C9D</resetValue>
<fields>
  <field>
    <name>MASTER23</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID23</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #23]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER22</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID22</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #22]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER21</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID21</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #21]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER20</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID20</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #20]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG27_24</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x00000218</addressOffset>
    <access>read-write</access>
    <resetValue>0x96979899</resetValue>
<fields>
  <field>
    <name>MASTER27</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID27</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #27]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER26</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID26</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #26]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER25</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID25</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #25]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER24</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID24</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #24]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>PADCFG31_28</name>
    <description><![CDATA[Configuration of PAD(#M-#N)]]></description>
    <addressOffset>0x0000021C</addressOffset>
    <access>read-write</access>
    <resetValue>0x92939495</resetValue>
<fields>
  <field>
    <name>MASTER31</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[31:31]</bitRange>
  </field>
  <field>
    <name>IOID31</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #31]]></description>
    <bitRange>[30:24]</bitRange>
  </field>
  <field>
    <name>MASTER30</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[23:23]</bitRange>
  </field>
  <field>
    <name>IOID30</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #30]]></description>
    <bitRange>[22:16]</bitRange>
  </field>
  <field>
    <name>MASTER29</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[15:15]</bitRange>
  </field>
  <field>
    <name>IOID29</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #29]]></description>
    <bitRange>[14:8]</bitRange>
  </field>
  <field>
    <name>MASTER28</name>
    <description><![CDATA[Marks the pad as a master]]></description>
    <bitRange>[7:7]</bitRange>
  </field>
  <field>
    <name>IOID28</name>
    <description><![CDATA[Selects logical IO pin mapped to physical pin #28]]></description>
    <bitRange>[6:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>CFG</name>
    <description><![CDATA[Common Config]]></description>
    <addressOffset>0x00000280</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>GPIOCNT</name>
    <description><![CDATA[Obsolete. Not in use.]]></description>
    <bitRange>[7:1]</bitRange>
  </field>
  <field>
    <name>LOCK</name>
    <description><![CDATA[The PAD_CFG registers and the PADCFGLOCK register are only accessible when this bit is 0.]]></description>
    <bitRange>[0:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVEDOMAIN</name>
    <description><![CDATA[Domain Configuration of Observation MUX]]></description>
    <addressOffset>0x00000400</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:3]</bitRange>
  </field>
  <field>
    <name>SELECT</name>
    <description><![CDATA[Select which domain in the CC26xx that drives the observation output and observation clock output
000: None
001: MCU
010: AUX
011: AON
100: ANA1
101: ANA2
110: DEBUG SS
111: None]]></description>
    <bitRange>[2:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVECLKDIV</name>
    <description><![CDATA[Clock configuration of observation MUX]]></description>
    <addressOffset>0x00000404</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:2]</bitRange>
  </field>
  <field>
    <name>DIVIDE</name>
    <description><![CDATA[Clock divider setting for observation clock output]]></description>
    <bitRange>[1:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVEIOMASK</name>
    <description><![CDATA[Mask configuration for observation MUX]]></description>
    <addressOffset>0x00000408</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:17]</bitRange>
  </field>
  <field>
    <name>CLK</name>
    <description><![CDATA[Mask setting for IO used for observe clk output
1: IO enabled for observation
0: IO disabled for observation]]></description>
    <bitRange>[16:16]</bitRange>
  </field>
  <field>
    <name>DATA</name>
    <description><![CDATA[Mask setting for IO used for observe data output
1: IO enabled for observation
0: IO disabled for observation]]></description>
    <bitRange>[15:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVEAUXOUTPUT</name>
    <description><![CDATA[Configuration of observation output to AUX]]></description>
    <addressOffset>0x0000040C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:20]</bitRange>
  </field>
  <field>
    <name>SELECTMISC</name>
    <description><![CDATA[Misc. select observation towards TEST_SS for AUX outputs
bit 16:aux_tdc_clk_sel
bit 17-19: reserved]]></description>
    <bitRange>[19:16]</bitRange>
  </field>
  <field>
    <name>SELECT3</name>
    <description><![CDATA[Select observation output[3] to AUX]]></description>
    <bitRange>[15:12]</bitRange>
  </field>
  <field>
    <name>SELECT2</name>
    <description><![CDATA[Select observation output[2] to AUX]]></description>
    <bitRange>[11:8]</bitRange>
  </field>
  <field>
    <name>SELECT1</name>
    <description><![CDATA[Select observation output[1] to AUX]]></description>
    <bitRange>[7:4]</bitRange>
  </field>
  <field>
    <name>SELECT0</name>
    <description><![CDATA[Select observation output[0] to AUX]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVESUBDOMAIN</name>
    <description><![CDATA[Sub domain configuration of observation MUX]]></description>
    <addressOffset>0x00000410</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:8]</bitRange>
  </field>
  <field>
    <name>SELECT</name>
    <description><![CDATA[Select vector sent towards sub domain chosen in OBSERVEDOMAIN register]]></description>
    <bitRange>[7:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVEMCUDOMAIN</name>
    <description><![CDATA[Configuration of the final stage of observation MUX in MCU domain]]></description>
    <addressOffset>0x00000414</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:27]</bitRange>
  </field>
  <field>
    <name>SELECTFINALSTAGEMSB</name>
    <description><![CDATA[Select for the final stage of the observation MUX in MCU domain.
0: Discrete vector to output[15:8]
1: Bus vector to output[15:8]]]></description>
    <bitRange>[26:26]</bitRange>
  </field>
  <field>
    <name>SELECTFINALSTAGELSB</name>
    <description><![CDATA[Select for the final stage of the observation MUX in MCU domain.
0: Discrete vector to output[7:0]
1: Bus vector to output[7:0]]]></description>
    <bitRange>[25:25]</bitRange>
  </field>
  <field>
    <name>SELECTBUS</name>
    <description><![CDATA[Select MCU submodule that will output signals on MCU observation vector[15:0] for bus signals.]]></description>
    <bitRange>[24:20]</bitRange>
  </field>
  <field>
    <name>SELECTDISCRETE3</name>
    <description><![CDATA[Select MCU submodule that will output signals on MCU observation vector[15:12] for discrete signals.]]></description>
    <bitRange>[19:15]</bitRange>
  </field>
  <field>
    <name>SELECTDISCRETE2</name>
    <description><![CDATA[Select MCU submodule that will output signals on MCU observation vector[11:8] for discrete signals.]]></description>
    <bitRange>[14:10]</bitRange>
  </field>
  <field>
    <name>SELECTDISCRETE1</name>
    <description><![CDATA[Select MCU submodule that will output signals on MCU observation vector[7:4] for discrete signals.]]></description>
    <bitRange>[9:5]</bitRange>
  </field>
  <field>
    <name>SELECTDISCRETE0</name>
    <description><![CDATA[Select MCU submodule that will output signals on MCU observation vector[3:0] for discrete signals.]]></description>
    <bitRange>[4:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVEMCUMODULEBUS</name>
    <description><![CDATA[Configuration of bus vector observation MUX inside chosen MCU submodule.]]></description>
    <addressOffset>0x00000418</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>SELECT</name>
    <description><![CDATA[Bus select sent towards all MCU submodules]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
  <register>
    <name>OBSERVEMCUMODULEDISCRETE</name>
    <description><![CDATA[Configuration of discrete vector observation MUX inside chosen MCU submodule.]]></description>
    <addressOffset>0x0000041C</addressOffset>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
<fields>
  <field>
    <name>RESERVED</name>
    <description><![CDATA[Fill to 32 bit]]></description>
    <bitRange>[31:4]</bitRange>
  </field>
  <field>
    <name>SELECT</name>
    <description><![CDATA[Select sent towars MCU submodule]]></description>
    <bitRange>[3:0]</bitRange>
  </field>
</fields>
  </register>
