zahidul3/athan-clock/simplelink_cc26x2_sdk_2_20_00_36/examples/rtos/CC26X2R1_LAUNCHXL/ti154stack/common/cc26xx/CC26xx.xml
</registers>
</peripheral>
<peripheral>
  <name>CM3_FPB</name>
  <description><![CDATA[]]></description>
  <baseAddress>0xE0002000</baseAddress>
  <addressBlock>
    <offset>0</offset>
    <size>0x00001000</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
    <register>
      <name>FP_CTRL</name>
      <description><![CDATA[FP Control]]></description>
      <addressOffset>0x00000000</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000261</resetValue>
      <fields>
        <field>
          <name>ENABLE</name>
          <description><![CDATA[Enable FPB Logic]]></description>
          <bitRange>[0:0]</bitRange>
        </field>
        <field>
          <name>KEY</name>
          <description><![CDATA[FPB Write Unlock Key]]></description>
          <bitRange>[1:1]</bitRange>
        </field>
        <field>
          <name>NUM_CODE3_0</name>
          <description><![CDATA[Number of Remapped Codes 3..0]]></description>
          <bitRange>[7:4]</bitRange>
        </field>
        <field>
          <name>NUM_LIT</name>
          <description><![CDATA[Number of Remapped Literals]]></description>
          <bitRange>[11:8]</bitRange>
        </field>
        <field>
          <name>NUM_CODE6_4</name>
          <description><![CDATA[Number of Remapped Codes 6..4]]></description>
          <bitRange>[14:12]</bitRange>
        </field>
      </fields>
    </register>
    <register>
      <name>FP_REMAP</name>
      <description><![CDATA[FP Remap]]></description>
      <addressOffset>0x00000004</addressOffset>
      <access>read-write</access>
      <resetValue>0x20000000</resetValue>
      <fields>
        <field>
          <name>REMAP_ADDR</name>
          <description><![CDATA[Remap Address]]></description>
          <bitRange>[29:0]</bitRange>
        </field>
      </fields>
    </register>
  </registers>
</peripheral>
<peripheral>
  <name>CM3_SCB</name>
  <description><![CDATA[]]></description>
  <baseAddress>0xE000ED00</baseAddress>
  <addressBlock>
    <offset>0</offset>
    <size>0x00001000</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
    <register>
      <name>ICSR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x00000004</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
    <register>
      <name>VTOR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x00000008</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
    <register>
      <name>SHCSR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x00000024</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
    <register>
      <name>CFSR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x00000028</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
    <register>
      <name>HFSR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x0000002C</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
    <register>
      <name>DFSR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x00000030</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
    <register>
      <name>BFAR</name>
      <description><![CDATA[]]></description>
      <addressOffset>0x00000038</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
    </register>
  </registers>
</peripheral>
</peripherals>
</device>

